//BP13D101 JOB (BP13P),'SOC',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),                 
//       NOTIFY=CSD0071                                                         
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//* ============================================================== *            
//*                                                                *            
//*             D A I L Y    F I N A N C I A L    J O B            *            
//*                                                                *            
//* ============================================================== *            
//* CHG REF  BY   ON       DESCRIPTION                                          
//* -------- --   ------   -----------                                          
//* BP130531 LSB  980806   BACKUP CPF PAYMENT & VOUCHER FILE                    
//*                        ADD REPORT BP13S123                                  
//* BP130549 CLT  981101   REMOVE READING OF AC19 DATASETS                      
//* BP130836 LSB  000417   ADD STEP FOR BACKUP F120/F130                        
//* BP130835 CLT  000412   ADD STEP TO EXTRACT RDE CASE FOR CPFB                
//* BP130883 CLT  271000   REMOVE CALLING OF BP13C904                           
//* BP130986 CLT  010301   CHANGE DDNAME FROM BP13F001 TO AB02F898              
//* BP131016 LSB  230501   ADD STUDIO APARTMENT                                 
//* BP130998 CLT  120701   MOD BP13.F120.SATRAN.SA TO BP13.F120.SAWEEK          
//* BP132309 CLT  040403   INTERFACE TO AB05 ON DAILY BASIS                     
//*                        REMOVE BP13K542                                      
//* BP132340 MTD  160403   REMOVE 'AA' 'AW' IN STEP33                           
//* BP132341 MCC  260503   INCLUDE BP13.F121.CPFTRAN.TPBO                       
//* BP132362 CLT  150603   PROCESS AC28.F544.SOC                                
//* BP132371 CLT  120703   PASS LRF TO STAMP FEE MASTER                         
//* BP132501 SSS  240304   DELETE BP13S123                                      
//* BP132627 GAN1 081104   CHG F800.APPLN.KEYISSUE TO BP13K893                  
//*                        CHG F820.OCCUP.KEYISSUE TO BP13K895                  
//* BP132717 JF4  080705   INCLUDE 'CD' CASES IN SORT STEP25                    
//* BP132801 CT2  130306   INCL BATCH PRG TO PROCESS AHG CASES/STEP 1A/B        
//* BP132742 CLT1 010406   SKIP WRITING OF B05F005 FOR SOCA CASES               
//* BP132902 SSS2 080107   STOP PRINT L118, L653, LB03                          
//* BP133474 LSB1 081120   BYPASS DBSS IN STEP04                                
//* BP133480 LSB1 090202   BYPASS DBSS PAYMT=PP IN STEP04                       
//* BP133973 CCC5 100921   UPDATE B004 DATASETS TO AB02 DATASETS                
//* BP134209 JB8  110523   TO REMOVE 'SUM FIELDS=NONE' IN STEP1B                
//* BP134267 AB9  110810   TO CATER FOR AMR ADVANCE PAYMENT.          *         
//* BP134302 LJL  110826   TO CATER FOR AMR ADVANCE PAYMENT FOR SA    *         
//* BP134355 AB9  110808   ADD BP13C36R FOR SENDING EMAIL             *         
//* BP134381 AB9  111008   CATER FOR AHG RECOVERY                     *         
//* BP134355 AB9  111206   REMOVE ADV & AMR REPORT TO OUTPUT 5.       *         
//* BP134355 AB9  120615   REMOVE KIV FILE FROM BP13C36C,BP13C36D,    *         
//*                        BP13C36D                                   *         
//* BP134506 AB9  210912   INCLUDE 6011E,6020H,0520C FOR SHG/AHG/INT  *         
//* BP134408 AB9  091012   ADD BP13C36S- DEL FROM KIV AND UPD TO HIST *         
//* BP134561 ESD1 230413   INCLUDE FILE TO CREATE F130 FILE           *         
//*                        BP13.F125.DAILYINT.SUBTRF.                 *         
//* BP134942 LJL1 250713   TO FACILITATE UPDATE OF AMR KIV RECORD     *         
//*                        TO CHANGE TRANSACTION DATE                 *         
//*                        FROM 20121009 TO 20120301.                 *         
//* BP134872 JGO1 020813   TO ADD K410 AS INPUT TO BP13C36S           *         
//* BP135003 220813 LSB1   REMOVE BATCH.COM                           *         
//* BP134604 231213 NST1   TO PRINT BP13LB03 TO RST TEAM FOR FOLLOWUP *         
//* BP135171 100214 RJE1   TO CATER FOR DB2 UPGRADE                             
//* BP135265 070314 PCL4   TO UPDATE KD07-DTE-GRANT-PAYMENT IN BP13CB03         
//* BP135210 250314 PCL4   TO PRINT SUBMISSION STATUS/DATE IN BP13CF98          
//* BP135291 030914 ESD1   CATER FOR SUG                                        
//* BP135978 151015 MRN1   CATER FOR SRG RECOVERY                               
//* BP136098 020316 KSJ3   REMOVE RESALE LEVY COLLECTION FROM F136              
//* BP136147 210316 MRN1   CATER FOR AHG/SHG AND SUG RECOVERY                   
//* BP136181 220416 CT2    REMOVE GRANT PROCESSING AND PUT IN BP13D115          
//* BP137155 080117 LJL1   TO CATER FOR THE BACKUP OF F128 ACCUM                
//* BP137325 021018 LJL1  TO CATER FOR NEW FILE FROM CASH PAYMENT KIOSK         
//*                       AC28.F569.SOC                                         
//* BP139632 210623 LJL1  ADD CATER FOR SUBTR EX-SOL                            
//* BP139632 120723 LJL1  ADD CATER FOR SUBTR VOLUNTARY REFUND TO CPFB          
//* ==================================================================          
//* SEND DYNAMIC JDE AHEAD OF THE PRINT DATASET                                 
//* PRT01 : CLASS = 2, COPIES = 1 ** (SALES - AGM TEAM)                         
//*-----------------------------------------------------------------            
//PRT01    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAALAG1 CP-2',END;                                     
1$DJDE$ JDE=BP13D,JDL=BP13,COPIES=2,END;                                        
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALAG1                                    
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID),DEST=IOM2                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*=================================================================            
//* SEND DYNAMIC JDE AHEAD OF THE PRINT DATASET                                 
//* PRT02 : CLASS = 2, COPIES = 1 ** (ALLOCATION SECTION - RST)                 
//*-----------------------------------------------------------------            
//PRT02    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAAL2A CP-2',END;                                      
1$DJDE$ JDE=BP13D,JDL=BP13,COPIES=2,END;                                        
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAAL2A                                     
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID),DEST=IOM2                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*=================================================================            
//* BACKUP FINANTIAL TRANSACTION FILES                                          
//*-----------------------------------------------------------------            
//STEP00   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//INPUT1   DD DSN=BP13.F120.SATRAN,DISP=SHR                                     
//OUTPUT1  DD DSN=BP13.F120.SATRAN.BKUP,DISP=SHR                                
//*                                                                             
//INPUT2   DD DSN=BP13.F130.SATRAN,DISP=SHR                                     
//OUTPUT2  DD DSN=BP13.F130.SATRAN.BKUP,DISP=SHR                                
//*                                                                             
//INPUT3   DD DSN=BP13.F130.SATRAN.SUBTRF,DISP=SHR                              
//OUTPUT3  DD DSN=BP13.F130.SATRAN.SUBTRF.BKUP,DISP=SHR                         
//*                                                                             
//INPUT4   DD DSN=BP13.F130.SATRAN.DEMISE,DISP=SHR                              
//OUTPUT4  DD DSN=BP13.F130.SATRAN.DEMISE.BKUP,DISP=SHR                         
//*                                                                             
//INPUT5   DD DSN=BP13.F130.REFUND,DISP=SHR                                     
//OUTPUT5  DD DSN=BP13.F130.REFUND.BKUP,DISP=SHR                                
//*                                                                             
//INPUT6   DD DSN=BP13.F130.MLTRF,DISP=SHR                                      
//OUTPUT6  DD DSN=BP13.F130.MLTRF.BKUP,DISP=SHR                                 
//*                                                                             
//INPUT7   DD DSN=BP13.F121.CPFTRAN.TPBO,DISP=SHR                               
//OUTPUT7  DD DSN=BP13.F121.CPFTRAN.TPBO.BKUP,DISP=SHR                          
//*                                                                             
//INPUT8   DD DSN=BP13.F120.SATRAN.BO,DISP=SHR                                  
//OUTPUT8  DD DSN=BP13.F120.SATRAN.BO.BKUP,DISP=SHR                             
//*                                                                             
//INPUT9   DD DSN=BP13.F130.SATRAN.EXSOL,DISP=SHR                               
//OUTPUT9  DD DSN=BP13.F130.SATRAN.EXSOL.BKUP,DISP=SHR                          
//*                                                                             
//INPUT10  DD DSN=BP13.F130.SATRAN.VOLCPF,DISP=SHR                              
//OUTPUT10 DD DSN=BP13.F130.SATRAN.VOLCPF.BKUP,DISP=SHR                         
//*                                                                             
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
     REPRO IFILE(INPUT1) OFILE(OUTPUT1)                                         
     REPRO IFILE(INPUT2) OFILE(OUTPUT2)                                         
     REPRO IFILE(INPUT3) OFILE(OUTPUT3)                                         
     REPRO IFILE(INPUT4) OFILE(OUTPUT4)                                         
     REPRO IFILE(INPUT5) OFILE(OUTPUT5)                                         
     REPRO IFILE(INPUT6) OFILE(OUTPUT6)                                         
     REPRO IFILE(INPUT7) OFILE(OUTPUT7)                                         
     REPRO IFILE(INPUT8) OFILE(OUTPUT8)                                         
     REPRO IFILE(INPUT9) OFILE(OUTPUT9)                                         
     REPRO IFILE(INPUT10) OFILE(OUTPUT10)                                       
/*                                                                              
//*=================================================================            
//*-------------------------------------------------------------------*         
//* MERGE DAILY FINANCIAL TRANS WITH SALES AGRMT HIST TRANS           *         
//*-------------------------------------------------------------------*         
//STEP01   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F125.DAILYTRN,DISP=SHR                                   
//         DD DSN=BP13.F130.SATRAN,DISP=SHR                                     
//         DD DSN=BP13.F130.SATRAN.SUBTRF,DISP=SHR                              
//         DD DSN=BP13.F130.SATRAN.DEMISE,DISP=SHR                              
//         DD DSN=BP13.F130.SATRAN.EXSOL,DISP=SHR                               
//         DD DSN=BP13.F130.SATRAN.VOLCPF,DISP=SHR                              
//         DD DSN=BP13.F130.REFUND,DISP=SHR                                     
//         DD DSN=BP13.F120.SATRAN.SA,DISP=SHR                                  
//         DD DSN=BP13.F120.SATRAN.BO,DISP=SHR                                  
//         DD DSN=BP13.F121.CPFTRAN.TPBO,DISP=SHR                               
//         DD DSN=BP13.F125.DAILYINT.SUBTRF,DISP=SHR                            
//SORTOUT  DD DSN=&&BP13F126,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(TRK,(20,5),RLSE),                               
//            DCB=(BLKSIZE=23400,LRECL=150,RECFM=FB)                            
//SYSIN    DD *                                                                 
     SORT FIELDS=(5,19,A),FORMAT=CH                                             
/*                                                                              
//*-------------------------------------------------------------------*         
//*  WRITE FINANCIAL TRANS FOR DAY TO TRANS LOG FILE                  *         
//*-------------------------------------------------------------------*         
//STEP02   EXEC PGM=BP13C107,COND=(0,NE)                                        
//BP13F125 DD DSN=&&BP13F126,DISP=(OLD,PASS)                                    
//BP13K130 DD DSN=BP13.K130.SOCHIST,DISP=SHR,                                   
//            AMP=('BUFND=4','BUFNI=8')                                         
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*-------------------------------------------------------------------*         
//* PERFORM UPDATE OF KIV TRANSACTIONS TO BALANCING FILE              *         
//* FOR NEW, VALIDATED AND TAGGED DELETE KIV CASES                    *         
//*-------------------------------------------------------------------*         
//STEP03   EXEC PGM=BP13C137,COND=(0,NE)                                        
//BP13F140 DD DSN=BP13.F140.KIVPOST,DISP=SHR                                    
//BP13K160 DD DSN=BP13.K160.BALANCE,DISP=SHR                                    
//BP13L137 DD SYSOUT=N                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*-------------------------------------------------------------------*         
//* ACCUMULATE DAILY PAYMENT TRANS TO MTHLY PAYMENT TRANS             *         
//*                                                                   *         
//*-------------------------------------------------------------------*         
//STEP04   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F125.ACCUM,DISP=OLD                                      
//SORTOUT  DD DSN=BP13.F136.MTHTRAN,DISP=MOD                                    
//SYSIN    DD *                                                                 
    SORT FIELDS=(1,2,A,5,19,A),FORMAT=CH                                        
    OMIT COND=((5,1,CH,EQ,C'5',AND,                                             
               (99,3,CH,EQ,C'DSP',OR,                                           
                99,3,CH,EQ,C'DCV',OR,                                           
                99,3,CH,EQ,C'PP ')),OR,                                         
               (99,3,CH,EQ,C'INT',OR,99,3,CH,EQ,C'L04',OR,                      
                99,3,CH,EQ,C'L02',OR,99,3,CH,EQ,C'L05',OR,                      
                99,3,CH,EQ,C'LEC',OR,99,3,CH,EQ,C'LEX',OR,                      
                99,3,CH,EQ,C'L03'))                                             
//*                                                                             
//*-------------------------------------------------------------------*         
//* MERGE DAILY SALES AGREEMENT TRANS TO WEEKLY FILE                  *         
//* DO WRITE TO B05F005 IN BP13C304                                   *         
//*-------------------------------------------------------------------*         
//*STEP05   EXEC SORT,COND=(0,NE)                                               
//*SORTIN   DD DSN=BP13.F120.SATRAN,DISP=SHR                                    
//*SORTOUT  DD DSN=BP13.F120.SAWEEK,DISP=MOD                                    
//*SYSIN    DD *                                                                
//*     SORT FIELDS=(1,2,A),FORMAT=CH                                           
//*                                                                             
//*-------------------------------------------------------------------*         
//* MERGE DAILY SALES AGREEMENT TRANS TO WEEKLY FILE                  *         
//*-------------------------------------------------------------------*         
//STEP06   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F120.SATRAN.SA,DISP=SHR                                  
//SORTOUT  DD DSN=BP13.F120.SAWEEK,DISP=MOD                                     
//SYSIN    DD *                                                                 
     SORT FIELDS=(1,2,A),FORMAT=CH                                              
//*                                                                             
//*-------------------------------------------------------------------*         
//* MERGE DAILY SALES AGREEMENT TRANS TO WEEKLY FILE                  *         
//*-------------------------------------------------------------------*         
//STEP07   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F120.SATRAN.BO,DISP=SHR                                  
//SORTOUT  DD DSN=BP13.F120.SAWEEK,DISP=MOD                                     
//SYSIN    DD *                                                                 
     SORT FIELDS=(1,2,A),FORMAT=CH                                              
//*                                                                             
//*-------------------------------------------------------------------*         
//* MERGE DAILY BANK LOAN CASES TO WEEKLY FILE                        *         
//*-------------------------------------------------------------------*         
//STEP7A   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F121.CPFTRAN.TPBO,DISP=SHR                               
//SORTOUT  DD DSN=BP13.F120.SAWEEK,DISP=MOD                                     
//SYSIN    DD *                                                                 
     SORT FIELDS=(1,2,A),FORMAT=CH                                              
//*                                                                             
//*-------------------------------------------------------------------*         
//*  TO CREATE STAMP FEE INTERFACE FILE                               *         
//*-------------------------------------------------------------------*         
//STEP8    EXEC PGM=BP13C125,COND=(0,NE)                                        
//BP13F136 DD DSN=BP13.F120.SAWEEK,DISP=SHR                                     
//B05F005  DD DSN=BP13.F128.STPFEE,DISP=MOD                                     
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*-------------------------------------------------------------------*         
//* EMPTY WEEKLY ACCUMULATED SA TRANS FILE                            *         
//*-------------------------------------------------------------------*         
//STEP09   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT2   DD DSN=BP13.EMPTY.CHAR150,DISP=OLD                                   
//OUTPUT2  DD DSN=BP13.F120.SAWEEK,DISP=OLD                                     
//SYSIN    DD *                                                                 
        REPRO INFILE(INPUT2)  OUTFILE(OUTPUT2)                                  
//*                                                                             
//*-------------------------------------------------------------------*         
//* ACCUM CPF PAYMENT & VOUCHER FILE FOR BACKUP PURPOSE               *         
//*-------------------------------------------------------------------*         
//STEP10   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=AG07.F630.SOC,DISP=SHR                                        
//OUTPUT1  DD DSN=BP13.AG07.F630.VOUCHER,DISP=MOD                               
//INPUT2   DD DSN=AB02.F556.PYMNT.BP13,DISP=SHR                                 
//OUTPUT2  DD DSN=BP13.B004.F056.CPF,DISP=MOD                                   
//SYSIN    DD *                                                                 
        REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                  
        REPRO INFILE(INPUT2)  OUTFILE(OUTPUT2)                                  
//*                                                                             
//*-------------------------------------------------------------------*         
//* ACCUM CASH PAYMENT FILE (COLL)                                    *         
//*-------------------------------------------------------------------*         
//STEP11   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=AC28.F526.SOC,DISP=OLD                                        
//SORTOUT  DD DSN=BP13.AC28.F526.SOCCASH.MTHACCUM,DISP=MOD                      
//SYSIN    DD *                                                                 
        SORT FIELDS=(1,11,A),FORMAT=CH                                          
//*                                                                             
//*-------------------------------------------------------------------*         
//* ACCUM CASH PAYMENT FILE (COLL)                                    *         
//*-------------------------------------------------------------------*         
//STEP11A  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=AC28.F569.SOC,DISP=OLD                                        
//SORTOUT  DD DSN=BP13.AC28.F569.SOCCASH.MTHACCUM,DISP=MOD                      
//SYSIN    DD *                                                                 
        SORT FIELDS=(1,11,A),FORMAT=CH                                          
//*                                                                             
//*-------------------------------------------------------------------*         
//* ACCUM BO CASES COLLN FILE                                         *         
//*-------------------------------------------------------------------*         
//STEP12   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=AC28.F544.SOC,DISP=SHR                                        
//OUTPUT1  DD DSN=BP13.AC28.F544.SOC.MTHACCUM,DISP=MOD                          
//SYSIN    DD *                                                                 
        REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                  
//*                                                                             
//*-------------------------------------------------------------------*         
//* EMPTY CPF PAYMENT FILE                                            *         
//*-------------------------------------------------------------------*         
//STEP13   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT2   DD DSN=BP13.EMPTY.CHAR100,DISP=OLD                                   
//OUTPUT2  DD DSN=AB02.F556.PYMNT.BP13,DISP=OLD                                 
//SYSIN    DD *                                                                 
        REPRO INFILE(INPUT2)  OUTFILE(OUTPUT2)                                  
//*                                                                             
//*-------------------------------------------------------------------*         
//* EMPTY VOUCHER TRANSACTION FILE                                    *         
//*-------------------------------------------------------------------*         
//STEP14   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT3   DD DUMMY                                                             
//OUTPUT3  DD DSN=AG07.F630.SOC,DISP=OLD                                        
//SYSIN    DD *                                                                 
        REPRO INFILE(INPUT3)  OUTFILE(OUTPUT3)                                  
//*                                                                             
//*-------------------------------------------------------------------*         
//* EMPTY SALES AGREEMENT TRANS FILE                                  *         
//*-------------------------------------------------------------------*         
//STEP15   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT5   DD DSN=BP13.EMPTY.CHAR150,DISP=OLD                                   
//OUTPUT5  DD DSN=BP13.F120.SATRAN,DISP=OLD                                     
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT5)  OUTFILE(OUTPUT5)                                     
//*                                                                             
//*-------------------------------------------------------------------*         
//* EMPTY SALES AGREEMENT TRANS FILE                                  *         
//*-------------------------------------------------------------------*         
//STEP16   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT5A  DD DSN=BP13.EMPTY.CHAR150,DISP=OLD                                   
//OUTPUT5A DD DSN=BP13.F130.SATRAN.DEMISE,DISP=OLD                              
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT5A) OUTFILE(OUTPUT5A)                                    
//*                                                                             
//*-------------------------------------------------------------------*         
//* EMPTY SALES AGREEMENT TRANS FILE                                  *         
//*-------------------------------------------------------------------*         
//STEP16A  EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT5B  DD DSN=BP13.EMPTY.CHAR150,DISP=OLD                                   
//OUTPUT5B DD DSN=BP13.F130.SATRAN.EXSOL,DISP=OLD                               
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT5B) OUTFILE(OUTPUT5B)                                    
//*                                                                             
//*-------------------------------------------------------------------*         
//STEP16B  EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT5C  DD DSN=BP13.EMPTY.CHAR150,DISP=OLD                                   
//OUTPUT5C DD DSN=BP13.F130.SATRAN.VOLCPF,DISP=OLD                              
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT5C) OUTFILE(OUTPUT5C)                                    
//*                                                                             
//*-------------------------------------------------------------------*         
//* EMPTY SALES AGREEMENT TRANS FILE                                  *         
//*-------------------------------------------------------------------*         
//STEP17   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT6   DD DSN=BP13.EMPTY.CHAR150,DISP=OLD                                   
//OUTPUT6  DD DSN=BP13.F130.SATRAN,DISP=OLD                                     
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT6)  OUTFILE(OUTPUT6)                                     
//*                                                                             
//*-------------------------------------------------------------------*         
//* EMPTY SALES ORDER TRANSFER OF CD TO MORT LOAN                     *         
//*-------------------------------------------------------------------*         
//STEP18   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT7   DD DSN=BP13.EMPTY.CHAR150,DISP=OLD                                   
//OUTPUT7  DD DSN=BP13.F130.MLTRF,DISP=OLD                                      
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT7)  OUTFILE(OUTPUT7)                                     
//*                                                                             
//*-------------------------------------------------------------------*         
//*  BACKUP DAILY THE BALANCE FILE  7 GDG                             *         
//*-------------------------------------------------------------------*         
//STEP19  EXEC PGM=IDCAMS,COND=(0,NE)                                           
//SYSPRINT DD SYSOUT=*                                                          
//INPUT8   DD DSN=BP13.K160.BALANCE,DISP=SHR                                    
//OUTPUT8  DD DSN=BP13.F160.BALANCE(+1),                                        
//            DISP=(NEW,CATLG),                                                 
//            SPACE=(TRK,(2,1)),                                                
//            DCB=(BP13.GDG,RECFM=FB,LRECL=100,BLKSIZE=23400)                   
//SYSIN    DD *                                                                 
         REPRO INFILE(INPUT8)   OUTFILE(OUTPUT8)                                
//*                                                                             
//*-------------------------------------------------------------------*         
//* TO BACKUP DELETED KIV RECORDS                                     *         
//*-------------------------------------------------------------------*         
//STEP20   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F124.VALIDKIV,DISP=OLD                                   
//OUTPUT1  DD DSN=BP13.F140.DELETE.ACCUM,DISP=MOD                               
//SYSIN    DD *                                                                 
         REPRO INFILE(INPUT1) OUTFILE(OUTPUT1)                                  
//*                                                                             
//*-------------------------------------------------------------------*         
//* CASH PAYMENT FROM COLLECTION SYSTEM FOR SOC REGISTRATION FEE      *         
//*-------------------------------------------------------------------*         
//STEP21   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=AC28.F526.SOC,DISP=SHR                                        
//SORTOUT  DD DSN=&&REGNFEE1,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(TRK,(10,5),RLSE),                               
//            DCB=(BLKSIZE=27950,LRECL=130,RECFM=FB)                            
//SYSIN    DD *                                                                 
    SORT FIELDS=(113,8,A),FORMAT=CH                                             
    INCLUDE COND=(91,5,CH,EQ,C'0885H')                                          
//*                                                                             
//*-------------------------------------------------------------------*         
//* UPDATE REGN FEE COLLECTED FROM COLLECTION SYSTEM                  *         
//*-------------------------------------------------------------------*         
//STEP22   EXEC PGM=BP13C004,REGION=4096K                                       
//AC28F526 DD DSN=&&REGNFEE1,DISP=(OLD,PASS)                                    
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR                                      
//BP13K130 DD DSN=BP13.K130.SOCHIST,DISP=SHR                                    
//BP13F140 DD DSN=BP13.F100.REGNFEE,DISP=MOD                                    
//P13L004A DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//P13L004B DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*-------------------------------------------------------------------*         
//* SORT OUT DAILY TRANSACTION FOR BOOKING FEE REFUND CASES FOR SA-TP *         
//*-------------------------------------------------------------------*         
//STEP23   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F125.DAILYTRN,DISP=SHR                                   
//SORTOUT  DD DSN=&&STEP6A,DISP=(NEW,PASS),                                     
//            UNIT=(SYSDA,1),                                                   
//            DCB=(BLKSIZE=23400,LRECL=150,RECFM=FB),                           
//            SPACE=(CYL,(3,1),RLSE)                                            
//SYSIN    DD  *                                                                
   SORT FIELDS=(5,8,A),FORMAT=CH                                                
   INCLUDE COND=(1,2,CH,EQ,C'15',AND,                                           
                 (99,2,CH,EQ,C'BK',OR,99,2,CH,EQ,C'CD'))                        
//*                                                                             
//*-------------------------------------------------------------------*         
//* TO DELETE BP13K800/BP13K820 WHEN SALES COMPLETED                  *         
//*-------------------------------------------------------------------*         
//STEP24   EXEC PGM=BP13C653,COND=(0,NE)                                        
//BP13F125 DD DSN=&&STEP6A,DISP=(OLD,PASS)                                      
//BP13K410 DD DSN=BP13.K410.ACCUMSO,DISP=SHR,                                   
//         AMP=('BUFND=8','BUFNI=4')                                            
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//         AMP=('BUFND=8','BUFNI=4')                                            
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR,                                     
//         AMP=('BUFND=8','BUFNI=4')                                            
//BP13K840 DD DSN=BP13.K840.APPLHIST,DISP=SHR,                                  
//         AMP=('BUFND=8','BUFNI=4')                                            
//BP13K893 DD DSN=BP13.K893.APPLN.HISTORY,DISP=SHR,                             
//         AMP=('BUFND=8','BUFNI=4')                                            
//BP13K895 DD DSN=BP13.K895.OCCUP.HISTORY,DISP=SHR,                             
//         AMP=('BUFND=8','BUFNI=4')                                            
//BP13L653 DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*-------------------------------------------------------------------*         
//* SORT OUT ONLY REGN DEPOSIT AND PAYMENT BY CPF                     *         
//*-------------------------------------------------------------------*         
//STEP25   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F125.DAILYTRN,DISP=SHR                                   
//SORTOUT  DD DSN=&&F125RDE,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,SPACE=(CYL,(5,5),RLSE),                                
//            DCB=(BLKSIZE=23400,LRECL=150,RECFM=FB)                            
//SYSIN    DD *                                                                 
    SORT FIELDS=(5,8,A),FORMAT=CH                                               
    INCLUDE COND=(1,2,CH,EQ,C'12',AND,99,3,CH,EQ,C'RDE')                        
//*                                                                             
//*-------------------------------------------------------------------*         
//* APPEND RECORDS TO BP13.F001.CPFB.PROPERTY                         *         
//*-------------------------------------------------------------------*         
//STEP26   EXEC PGM=IKJEFT01,COND=(0,NE),REGION=4096K,DYNAMNBR=20               
//BP13F125 DD DSN=&&F125RDE,DISP=(OLD,DELETE)                                   
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR                                      
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR                                      
//AB02F898 DD DSN=BP13.F001.CPFB.PROPERTY,DISP=MOD                              
//BP13L058 DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSTSIN  DD  *                                                                
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C058) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
//*                                                                             
//*-------------------------------------------------------------------*         
//* EMPTY FINANCIAL TRANSACTION FILE                                  *         
//*-------------------------------------------------------------------*         
//STEP27   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT4   DD DSN=BP13.EMPTY.CHAR150,DISP=OLD                                   
//OUTPUT4  DD DSN=BP13.F125.DAILYTRN,DISP=OLD                                   
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT4)  OUTFILE(OUTPUT4)                                     
//*                                                                             
//*-------------------------------------------------------------------*         
//* EMPTY INTEREST TRANSACTION FILE                                   *         
//*-------------------------------------------------------------------*         
//STEP27A  EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT4   DD DSN=BP13.EMPTY.CHAR150,DISP=OLD                                   
//OUTPUT4  DD DSN=BP13.F125.DAILYINT.SUBTRF,DISP=OLD                            
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT4)  OUTFILE(OUTPUT4)                                     
//*                                                                             
//*-------------------------------------------------------------------*         
//* BACKUP BP13.F125.ACCUM.DAILY - GDG(7)                             *         
//* EMPTY FINANCIAL TRANSACTION FILE BP13.F125.ACCUM                  *         
//*-------------------------------------------------------------------*         
//STEP28   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT5   DD DSN=BP13.F125.ACCUM,DISP=SHR                                      
//OUTPUT5  DD DSN=BP13.F125.ACCUM.DAILY(+1),DISP=(NEW,CATLG),                   
//            SPACE=(CYL,(10,5)),                                               
//            DCB=(BP13.GDG,BLKSIZE=23400,LRECL=150,RECFM=FB)                   
//INPUT6   DD DSN=BP13.EMPTY.CHAR150,DISP=OLD                                   
//OUTPUT6  DD DSN=BP13.F125.ACCUM,DISP=OLD                                      
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT5)  OUTFILE(OUTPUT5)                                     
     REPRO INFILE(INPUT6)  OUTFILE(OUTPUT6)                                     
//*                                                                             
//*-------------------------------------------------------------------*         
//* ACCUM STUDIO APARTMENT TRANSACTION                                *         
//*-------------------------------------------------------------------*         
//STEP29   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT4   DD DSN=BP13.F120.SATRAN.SA,DISP=OLD                                  
//OUTPUT4  DD DSN=BP13.F120.SATRAN.SA.MTH,DISP=MOD                              
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT4)  OUTFILE(OUTPUT4)                                     
//*                                                                             
//*-------------------------------------------------------------------*         
//* BACKUP EX-APPLT FILE, SUB-TRANSFER FILE                           *         
//*-------------------------------------------------------------------*         
//STEP30   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.K880.SUBTRF.SUCC,DISP=SHR                                
//OUTPUT1  DD DSN=BP13.F880.SUBTRF.SUCC.DAILY,DISP=OLD                          
//INPUT2   DD DSN=BP13.K885.EXAPPLT,DISP=SHR                                    
//OUTPUT2  DD DSN=BP13.F885.EXAPPLT.DAILY,DISP=OLD                              
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                     
     REPRO INFILE(INPUT2)  OUTFILE(OUTPUT2)                                     
//*                                                                             
//*-------------------------------------------------------------------*         
//* EMPTY FINANCIAL TRANSACTION FILE                                  *         
//*-------------------------------------------------------------------*         
//STEP31   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT4   DD DSN=BP13.EMPTY.CHAR150,DISP=SHR                                   
//OUTPUT4  DD DSN=BP13.F120.SATRAN.SA,DISP=OLD                                  
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT4)  OUTFILE(OUTPUT4)                                     
//*                                                                             
//*-------------------------------------------------------------------*         
//* EMPTY FINANCIAL TRANSACTION FILE                                  *         
//*-------------------------------------------------------------------*         
//STEP32   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT4   DD DSN=BP13.EMPTY.CHAR150,DISP=SHR                                   
//OUTPUT4  DD DSN=BP13.F121.CPFTRAN.TPBO,DISP=OLD                               
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT4)  OUTFILE(OUTPUT4)                                     
//*                                                                             
//*-------------------------------------------------------------------*         
//* EMPTY FINANCIAL TRANSACTION FILE                                  *         
//*-------------------------------------------------------------------*         
//STEP33   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT4   DD DSN=BP13.EMPTY.CHAR150,DISP=SHR                                   
//OUTPUT4  DD DSN=BP13.F120.SATRAN.BO,DISP=OLD                                  
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT4)  OUTFILE(OUTPUT4)                                     
//*                                                                             
//*-------------------------------------------------------------------*         
//* EMPTY COLL PAYMENT FILE                                           *         
//*-------------------------------------------------------------------*         
//STEP34   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DUMMY                                                             
//OUTPUT1  DD DSN=AC28.F526.SOC,DISP=OLD                                        
//SYSIN    DD *                                                                 
        REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                  
//*                                                                             
//*-------------------------------------------------------------------*         
//* EMPTY COLL PAYMENT FILE                                           *         
//*-------------------------------------------------------------------*         
//STEP35   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DUMMY                                                             
//OUTPUT1  DD DSN=AC28.F544.SOC,DISP=OLD                                        
//SYSIN    DD *                                                                 
        REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                  
//*                                                                             
//*-------------------------------------------------------------------*         
//* EMPTY COLL PAYMENT FILE                                           *         
//*-------------------------------------------------------------------*         
//STEP35A  EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DUMMY                                                             
//OUTPUT1  DD DSN=AC28.F569.SOC,DISP=OLD                                        
//SYSIN    DD *                                                                 
        REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                  
//*                                                                             
//*-------------------------------------------------------------------*         
//* BACKUP BP13.F885.EXAPPLT                                                    
//*-------------------------------------------------------------------*         
//STEP36   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.K885.EXAPPLT,DISP=SHR                                    
//OUTPUT1  DD DSN=BP13.F885.EXAPPLT.DAY(+1),DISP=(NEW,CATLG),                   
//            SPACE=(CYL,(30,10)),                                              
//            DCB=(BP13.GDG,BLKSIZE=27600,LRECL=400,RECFM=FB)                   
//INPUT2   DD DSN=BP13.F120.SATRAN.BKUP,DISP=SHR                                
//OUTPUT2  DD DSN=BP13.F120.SATRAN.DAY(+1),DISP=(NEW,CATLG),                    
//            SPACE=(CYL,(20,10)),                                              
//            DCB=(BP13.GDG,BLKSIZE=27900,LRECL=150,RECFM=FB)                   
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                     
     REPRO INFILE(INPUT2)  OUTFILE(OUTPUT2)                                     
//*                                                                             
//*--------------------------------------------------------------------         
//* ACCUM INTERFCE FILE TO STAMP FEE SYSTEM                                     
//*--------------------------------------------------------------------         
//STEP37   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F128.STPFEE,DISP=SHR                                     
//OUTPUT1  DD DSN=BP13.F128.STPFEE.ACCUM,DISP=MOD                               
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                     
//*-------------------------------------------------------------------*         
//*          E N D      O F     J O B                                 *         
//*-------------------------------------------------------------------*         
