//BP13A20B JOB (BP13P),'BP13A22B',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//             NOTIFY=CSD0071                                                   
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//********************************************************************          
//* IMPORTANT NOTE :                                                    00000060
//* THIS JCL IS FOR CONVERTING THE UNITS FOR SELECTION FROM SBF TO ROF  00000070
//********************************************************************* 00000090
//* BP136835 20170718 ESA1 NEW JCL                                      00000100
//*=================================================================    00000120
//* SORT THE CONTROL REC FOR THIS OPTION                                00000130
//*-----------------------------------------------------------------    00000140
//STEP01   EXEC  SORT,COND=(0,NE)                                       00000150
//SORTIN   DD  DSN=BP13.K205.CTLREC,                                    00000160
//             DISP=SHR                                                 00000170
//SORTOUT  DD  DSN=&&BP13F205,DISP=(NEW,PASS),                                  
//             SPACE=(CYL,(2,1),RLSE),                                          
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=0)                                
//SYSIN    DD  *                                                        00000200
   SORT FIELDS=(1,15,A),FORMAT=CH                                               
   INCLUDE COND=(14,2,CH,EQ,C'RF')                                              
/*                                                                      00000210
//*-------------------------------------------------------------------*         
//* EXCLUDE BM06K110 CASES WITH ALLOCN-TAG 'WFS','KIV' AND 'REJ'                
//*-------------------------------------------------------------------*         
//STEP02   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BM06.K110.FLATINV,DISP=SHR                                    
//SORTOUT  DD DSN=&&BM06F110,DISP=(NEW,PASS),                                   
//         UNIT=SYSDA,DCB=(RECFM=FB,LRECL=500),                                 
//         SPACE=(CYL,(250,50),RLSE)                                            
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,11,A),FORMAT=CH                                               
   INCLUDE COND=(248,3,CH,NE,C'WFS',AND,                                        
                 248,3,CH,NE,C'KIV',AND,                                        
                 248,3,CH,NE,C'REJ')                                            
//*-------------------------------------------------------------------*         
//* SORT BP13K230 TO INCLUDE K230-NUM-ACCEPT NOT = 'A''               *         
//*-------------------------------------------------------------------*         
//STEP03   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K230.FLATLIST,DISP=SHR                                   
//SORTOUT  DD DSN=&&P13F230A,DISP=(NEW,PASS),                                   
//             UNIT=SYSDA,DCB=(RECFM=FB,LRECL=450),                             
//             SPACE=(CYL,(100,50),RLSE)                                        
//SYSIN    DD *                                                                 
           SORT FIELDS=(64,11,A),FORMAT=CH                                      
           INCLUDE COND=(75,1,CH,NE,C'A')                                       
//*------------------------------------------------------------------*          
//* MATCH BP13F230 WITH BM06F110                                     *          
//*------------------------------------------------------------------*          
//STEP04   EXEC PGM=SORT                                                        
//SORTJNF1 DD DSN=&&P13F230A,DISP=(SHR,PASS)                                    
//SORTJNF2 DD DSN=&&BM06F110,DISP=(SHR,PASS)                                    
//MATCH    DD DSN=&&P13F230B,DISP=(NEW,PASS),                                   
//             UNIT=SYSDA,DCB=(RECFM=FB,LRECL=450),                             
//             SPACE=(CYL,(100,50),RLSE)                                        
//SYSIN DD *                                                                    
   JOINKEYS FILE=F1,FIELDS=(64,11,A)                                            
   JOINKEYS FILE=F2,FIELDS=(1,11,A)                                             
   REFORMAT FIELDS=(F1:1,450)                                                   
   OUTFILE FNAMES=MATCH                                                         
   OPTION COPY                                                                  
/*                                                                              
//SYSUDUMP DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*-------------------------------------------------------------------*         
//* SORT BP13K23H TO INCLUDE K230-NUM-ACCEPT NOT = 'A''               *         
//*-------------------------------------------------------------------*         
//STEP05   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K23H.FLATLIST.HIST,DISP=SHR                              
//SORTOUT  DD DSN=&&P13F230C,DISP=(NEW,PASS),                                   
//             UNIT=SYSDA,DCB=(RECFM=FB,LRECL=450),                             
//             SPACE=(CYL,(100,50),RLSE)                                        
//SYSIN    DD *                                                                 
           SORT FIELDS=(64,11,A),FORMAT=CH                                      
           INCLUDE COND=(75,1,CH,NE,C'A')                                       
//*------------------------------------------------------------------*          
//* MATCH SORTED BP13F230 WITH BM06F110                              *          
//*------------------------------------------------------------------*          
//STEP06   EXEC PGM=SORT                                                        
//SORTJNF1 DD DSN=&&P13F230C,DISP=(SHR,PASS)                                    
//SORTJNF2 DD DSN=&&BM06F110,DISP=(SHR,PASS)                                    
//MATCH    DD DSN=&&P13F230D,DISP=(NEW,PASS),                                   
//             UNIT=SYSDA,DCB=(RECFM=FB,LRECL=450),                             
//             SPACE=(CYL,(100,50),RLSE)                                        
//SYSIN DD *                                                                    
   JOINKEYS FILE=F1,FIELDS=(64,11,A)                                            
   JOINKEYS FILE=F2,FIELDS=(1,11,A)                                             
   REFORMAT FIELDS=(F1:1,450)                                                   
   OUTFILE FNAMES=MATCH                                                         
   OPTION COPY                                                                  
/*                                                                              
//SYSUDUMP DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*-------------------------------------------------------------------*         
//* MERGE BP13F230 FROM BP13K230 AND BP13K23H                         *         
//*-------------------------------------------------------------------*         
//STEP07   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&P13F230B,DISP=(SHR,PASS)                                    
//         DD DSN=&&P13F230D,DISP=(SHR,PASS)                                    
//SORTOUT  DD DSN=&&P13F230E,DISP=(NEW,PASS),                                   
//             UNIT=SYSDA,DCB=(RECFM=FB,LRECL=450),                             
//             SPACE=(CYL,(100,50),RLSE)                                        
//SYSIN    DD *                                                                 
           SORT FIELDS=(64,11,A),FORMAT=CH                                      
//*------------------------------------------------------------------*          
//* TO REPLACE F230-DTE-BALLOT,F230-NUM-SELECTION,F230-NUM-SELECTION2*          
//* F230-NUM-SELECTION3,F230-NUM-SELECTION4 FROM F205-DTE-BALLOT AND *          
//* F205-NUM-SELECTION-NEW                                           *          
//*------------------------------------------------------------------*          
//STEP08   EXEC PGM=SORT                                                        
//SORTJNF1 DD DSN=&&P13F230E,DISP=(OLD,DELETE)                                  
//SORTJNF2 DD DSN=&&BP13F205,DISP=(SHR,PASS)                                    
//MATCH    DD DSN=&&P13F230F,DISP=(NEW,PASS),                                   
//             UNIT=SYSDA,DCB=(RECFM=FB,LRECL=450),                             
//             SPACE=(CYL,(100,50),RLSE)                                        
//SYSIN DD *                                                                    
   JOINKEYS FILE=F1,FIELDS=(108,3,A,117,6,A)                                    
   JOINKEYS FILE=F2,FIELDS=(60,3,A,24,6,A)                                      
   REFORMAT FIELDS=(F1:1,6,F2:16,8,F1:15,93,F2:32,3,F1:111,6,F2:51,6,           
                    F1:123,8,F2:32,3,F1:134,109,                                
                    F2:32,3,F1:246,49,F2:32,3,F1:298,153)                       
   OUTFILE FNAMES=MATCH                                                         
   OPTION COPY                                                                  
/*                                                                              
//SYSUDUMP DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*------------------------------------------------------------------*          
//* EXTRACT RECORDS FROM  BP13.K230.FLATLIST AND MATCH WITH BP13F205 *          
//*     TO BE TRANSFERRED TO BP13K23H                                *          
//*------------------------------------------------------------------*          
//STEP09   EXEC PGM=SORT                                                        
//SORTJNF1 DD DSN=BP13.K230.FLATLIST,DISP=SHR                                   
//SORTJNF2 DD DSN=&&BP13F205,DISP=(SHR,PASS)                                    
//MATCH    DD DSN=&&P13F230G,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(10,5),RLSE),                               
//            DCB=(RECFM=FB,LRECL=450)                                          
//SYSIN DD *                                                                    
   JOINKEYS FILE=F1,FIELDS=(108,3,A,117,6,A)                                    
   JOINKEYS FILE=F2,FIELDS=(60,3,A,24,6,A)                                      
   REFORMAT FIELDS=(F1:1,450)                                                   
   OUTFILE FNAMES=MATCH                                                         
   OPTION COPY                                                                  
/*                                                                              
//SYSUDUMP DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*------------------------------------------------------------------*          
//* TO REPRO THE SORTED BP13K230 TO BP13.K23H.FLATLIST.HIST          *          
//*------------------------------------------------------------------*          
//STEP10   EXEC PGM=IDCAMS                                                      
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=&&P13F230G,DISP=(SHR,PASS)                                    
//OUTPUT1  DD DSN=BP13.K23H.FLATLIST.HIST,DISP=SHR                              
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1) REPLACE                               
//*---------------------------------------------------------------------00000250
//* TO DELETE RECS FROM K230 BASED ON F230                              00000260
//*---------------------------------------------------------------------00000270
//STEP11  EXEC   PGM=BP13C211,COND=(0,NE)                               00000280
//BP13F230 DD  DSN=&&P13F230G,                                          00000290
//             DISP=(SHR,PASS)                                          00000300
//BP13K230 DD  DSN=BP13.K230.FLATLIST,                                  00000310
//             DISP=OLD                                                 00000320
//SYSDBG   DD  SYSOUT=*                                                 00000340
//SYSDBOUT DD  SYSOUT=*                                                 00000350
//SYSOUT   DD  SYSOUT=*                                                 00000360
/*                                                                      00000370
//*------------------------------------------------------------------*          
//* REPRO AND REPLACE BP13.K230.FLATLIST WITH THE UPDATE BP13F230   *           
//*------------------------------------------------------------------*          
//STEP12   EXEC PGM=IDCAMS                                                      
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=&&P13F230F,DISP=(SHR,PASS)                                    
//OUTPUT1  DD DSN=BP13.K230.FLATLIST,DISP=SHR                                   
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1) REPLACE                               
//*------------------------------------------------------------------*          
//* EXTRACT RECORDS FROM  BP13.K240.HEADFLAT AND MATCH IS WITH       *          
//*     BP13F205 UNDER F205-NUM-OPTION = 'RF'                        *          
//*------------------------------------------------------------------*          
//STEP13   EXEC PGM=SORT                                                        
//SORTJNF1 DD DSN=BP13.K240.HEADFLAT,DISP=SHR                                   
//SORTJNF2 DD DSN=&&BP13F205,DISP=(SHR,PASS)                                    
//MATCH    DD DSN=&&P13F240A,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(10,5),RLSE),                               
//            DCB=(RECFM=FB,LRECL=450)                                          
//SYSIN DD *                                                                    
   JOINKEYS FILE=F1,FIELDS=(108,3,A,117,6,A)                                    
   JOINKEYS FILE=F2,FIELDS=(60,3,A,24,6,A)                                      
   REFORMAT FIELDS=(F1:1,450)                                                   
   OUTFILE FNAMES=MATCH                                                         
   OPTION COPY                                                                  
/*                                                                              
//SYSUDUMP DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*------------------------------------------------------------------*          
//* EXTRACT RECORDS FROM  BP13.K240.HEADFLAT.HIST AND MATCH IS WITH  *          
//*     BP13F205 UNDER F205-NUM-OPTION = 'RF'                        *          
//*------------------------------------------------------------------*          
//STEP14   EXEC PGM=SORT                                                        
//SORTJNF1 DD DSN=BP13.K24H.HEADFLAT.HIST,DISP=SHR                              
//SORTJNF2 DD DSN=&&BP13F205,DISP=(SHR,PASS)                                    
//MATCH    DD DSN=&&P13F240B,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(10,5),RLSE),                               
//            DCB=(RECFM=FB,LRECL=450)                                          
//SYSIN DD *                                                                    
   JOINKEYS FILE=F1,FIELDS=(108,3,A,117,6,A)                                    
   JOINKEYS FILE=F2,FIELDS=(60,3,A,24,6,A)                                      
   REFORMAT FIELDS=(F1:1,450)                                                   
   OUTFILE FNAMES=MATCH                                                         
   OPTION COPY                                                                  
/*                                                                              
//SYSUDUMP DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*-------------------------------------------------------------------*         
//* MERGE BP13F240 FROM BP13K240 AND BP13K24H                         *         
//*-------------------------------------------------------------------*         
//STEP15   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&P13F240A,DISP=(SHR,PASS)                                    
//         DD DSN=&&P13F240B,DISP=(SHR,PASS)                                    
//SORTOUT  DD DSN=&&P13F240C,DISP=(NEW,PASS),                                   
//             UNIT=SYSDA,DCB=(RECFM=FB,LRECL=450),                             
//             SPACE=(CYL,(100,50),RLSE)                                        
//SYSIN    DD *                                                                 
           SORT FIELDS=(64,11,A),FORMAT=CH                                      
//*-----------------------------------------------------------------            
//* TO EXCLUDE FULLY BOOKED BLOCKS                                              
//*-----------------------------------------------------------------            
//STEP16 EXEC    PGM=BP13C212,COND=(0,NE)                                       
//BP13F240 DD  DSN=&&P13F240C,                                                  
//             DISP=(SHR,PASS)                                                  
//P13F240A DD  DSN=&&P13F240D,DISP=(NEW,PASS),                                  
//             UNIT=SYSDA,SPACE=(CYL,(10,5),RLSE),                              
//             DCB=(RECFM=FB,LRECL=450)                                         
//SYSOUT   DD  SYSOUT=*                                                         
//SYSTSPRT DD  SYSOUT=*                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSTSIN  DD  *                                                                
//*------------------------------------------------------------------*          
//* TO REPLACE F240-DTE-BALLOT,F240-NUM-SELECTION,F240-NUM-SELECTION2*          
//* F240-NUM-SELECTION3,F240-NUM-SELECTION4,F240-NUM-SELECTION5 AND  *          
//* F240-DTE-BALLOT5,F240-DTE-ALLOC WITH BP13F205 INPUT              *          
//*------------------------------------------------------------------*          
//STEP17   EXEC PGM=SORT                                                        
//SORTJNF1 DD DSN=&&P13F240D,DISP=(OLD,DELETE)                                  
//SORTJNF2 DD DSN=&&BP13F205,DISP=(SHR,PASS)                                    
//MATCH    DD DSN=&&P13F240E,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(10,5),RLSE),                               
//            DCB=(RECFM=FB,LRECL=450)                                          
//SYSIN DD *                                                                    
   JOINKEYS FILE=F1,FIELDS=(108,3,A,117,6,A)                                    
   JOINKEYS FILE=F2,FIELDS=(60,3,A,24,6,A)                                      
   REFORMAT FIELDS=(F1:1,6,F2:16,8,F1:15,93,F2:32,3,F1:111,6,F2:51,6,           
                    F1:123,8,F2:32,3,F1:134,48,                                 
                    F2:32,3,F1:185,125,F2:32,3,F1:313,73,                       
                    F2:32,3,F2:51,6,F1:395,56)                                  
   OUTFILE FNAMES=MATCH                                                         
   OPTION COPY                                                                  
/*                                                                              
//SYSUDUMP DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*------------------------------------------------------------------*          
//* TO REPRO THE SORTED BP13K240 TO BP13.K24H.HEADFLAT.HIST          *          
//*------------------------------------------------------------------*          
//STEP18   EXEC PGM=IDCAMS                                                      
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=&&P13F240A,DISP=(SHR,PASS)                                    
//OUTPUT1  DD DSN=BP13.K24H.HEADFLAT.HIST,DISP=SHR                              
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1) REPLACE                               
//*------------------------------------------------------------------*          
//* EXTRACT RECORDS FROM  BP13.K240.HEADFLAT AND MATCH IS WITH       *          
//*     BP13F205 UNDER F205-NUM-OPTION = 'RF'                        *          
//*------------------------------------------------------------------*          
//STEP19   EXEC PGM=SORT                                                        
//SORTJNF1 DD DSN=BP13.K240.HEADFLAT,DISP=SHR                                   
//SORTJNF2 DD DSN=&&BP13F205,DISP=(SHR,PASS)                                    
//MATCH    DD DSN=&&P13F240F,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(10,5),RLSE),                               
//            DCB=(RECFM=FB,LRECL=450)                                          
//SYSIN DD *                                                                    
   JOINKEYS FILE=F1,FIELDS=(108,3,A,117,6,A)                                    
   JOINKEYS FILE=F2,FIELDS=(60,3,A,24,6,A)                                      
   REFORMAT FIELDS=(F1:1,450)                                                   
   JOIN UNPAIRED,F1,ONLY                                                        
   OUTFILE FNAMES=MATCH                                                         
   OPTION COPY                                                                  
/*                                                                              
//SYSUDUMP DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*-----------------------------------------------------------------*           
//*     SORT BP13F240 ACCORDING TO F240-KEY-FLD                     *           
//*-----------------------------------------------------------------*           
//STEP20   EXEC SORT,CYL=30,COND=(0,NE)                                         
//SORTIN   DD DSN=&&P13F240F,DISP=(OLD,DELETE)                                  
//SORTOUT  DD DSN=&&P13F240G,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(10,5),RLSE),                               
//            DCB=(RECFM=FB,LRECL=450)                                          
//SYSIN    DD  *                                                                
  SORT FIELDS=(5,52,A),FORMAT=CH                                                
//*-----------------------------------------------------------------*           
//* DEFINE HEADFLAT VSAM FILE BP13K240                                          
//*-----------------------------------------------------------------*           
//STEP21   EXEC  PGM=IDCAMS,COND=(0,NE)                                         
//INPUT1   DD  DSN=&&P13F240G,DISP=(SHR,PASS)                                   
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  *                                                                
          DEL 'BP13.K240.HEADFLAT' CLUSTER PURGE                        00800000
          DEF CLUSTER                                -                          
              (NAME(BP13.K240.HEADFLAT)             -                           
              CYL(5 5)                               -                          
              STORCLAS(PRODRLS)                      -                          
              LOG(NONE)                              -                          
              UNIQUE                                 -                          
              SHR(2 3))                              -                          
              DATA                                   -                          
              (NAME(BP13.K240.HEADFLAT.DATA)        -                           
              KEYS(52 4)                             -                          
              RECSZ(450 450)                         -                          
              CISZ(4096)                             -                          
              FSPC(10 10))                           -                          
              INDEX                                  -                          
              (NAME(BP13.K240.HEADFLAT.INDEX)       -                           
              CISZ(4096))                                                       
      IF MAXCC = 0  THEN                             -                          
      REPRO IFILE(INPUT1)                            -                          
            ODS(BP13.K240.HEADFLAT)                 -                           
            REUSE                                                               
      IF MAXCC = 0 THEN                              -                          
         DEF AIX (NAME(BP13.K240.HEADFLAT.ALTX1) -                              
              REL(BP13.K240.HEADFLAT)               -                           
              CYL(5  2)                              -                          
              SHR(2 3)                               -                          
              KEYS(51 130)                           -                          
              CISZ(4096)                             -                          
              RECSZ(7000 7000))                                                 
      IF LASTCC = 0 THEN                             -                          
         DEF PATH(NAME(BP13.K240.HEADFLAT.PATH1) -                              
             PENT(BP13.K240.HEADFLAT.ALTX1))                                    
      IF LASTCC = 0 THEN                             -                          
         BIX IDS(BP13.K240.HEADFLAT)                -                           
             ODS(BP13.K240.HEADFLAT.ALTX1)                                      
      IF MAXCC = 0 THEN                              -                          
         DEF AIX (NAME(BP13.K240.HEADFLAT.ALTX2) -                              
              REL(BP13.K240.HEADFLAT)               -                           
              CYL(5  2)                              -                          
              SHR(2 3)                               -                          
              KEYS(47 181)                           -                          
              CISZ(4096)                             -                          
              RECSZ(7000 7000))                                                 
      IF LASTCC = 0 THEN                             -                          
         DEF PATH(NAME(BP13.K240.HEADFLAT.PATH2) -                              
             PENT(BP13.K240.HEADFLAT.ALTX2))                                    
      IF LASTCC = 0 THEN                             -                          
         BIX IDS(BP13.K240.HEADFLAT)                -                           
             ODS(BP13.K240.HEADFLAT.ALTX2)                                      
      IF MAXCC = 0 THEN                              -                          
         DEF AIX (NAME(BP13.K240.HEADFLAT.ALTX3) -                              
              REL(BP13.K240.HEADFLAT)               -                           
              TRK(10 5)                             -                           
              SHR(2 3)                               -                          
              KEYS(45 309)                           -                          
              CISZ(4096)                             -                          
              RECSZ(7000 7000))                                                 
      IF LASTCC = 0 THEN                             -                          
         DEF PATH(NAME(BP13.K240.HEADFLAT.PATH3) -                              
             PENT(BP13.K240.HEADFLAT.ALTX3))                                    
      IF LASTCC = 0 THEN                             -                          
         BIX IDS(BP13.K240.HEADFLAT)                -                           
             ODS(BP13.K240.HEADFLAT.ALTX3)                                      
      IF MAXCC = 0 THEN                              -                          
         DEF AIX (NAME(BP13.K240.HEADFLAT.ALTX4) -                              
              REL(BP13.K240.HEADFLAT)               -                           
              TRK(10 5)                             -                           
              SHR(2 3)                               -                          
              KEYS(39 356)                           -                          
              CISZ(4096)                             -                          
              RECSZ(20000 20000))                                               
      IF LASTCC = 0 THEN                             -                          
         DEF PATH(NAME(BP13.K240.HEADFLAT.PATH4) -                              
             PENT(BP13.K240.HEADFLAT.ALTX4))                                    
      IF LASTCC = 0 THEN                             -                          
         BIX IDS(BP13.K240.HEADFLAT)                -                           
             ODS(BP13.K240.HEADFLAT.ALTX4)                                      
/*                                                                              
//*------------------------------------------------------------------*          
//*      SORT BP13F240 ACCORDING TO F240-KEY-FLD                     *          
//*------------------------------------------------------------------*          
//STEP22   EXEC SORT,CYL=30,COND=(0,NE)                                         
//SORTIN   DD DSN=&&P13F240E,DISP=(SHR,PASS)                                    
//SORTOUT  DD DSN=&&P13F240H,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(10,5),RLSE),                               
//            DCB=(RECFM=FB,LRECL=450)                                          
//SYSIN    DD  *                                                                
  SORT FIELDS=(5,52,A),FORMAT=CH                                                
//*------------------------------------------------------------------*          
//* TO REPRO THE SORTED BP13F240 TO BP13.K240.HEADFLAT               *          
//*------------------------------------------------------------------*          
//STEP23   EXEC PGM=IDCAMS                                                      
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=&&P13F240H,DISP=(OLD,DELETE)                                  
//OUTPUT1  DD DSN=BP13.K240.HEADFLAT,DISP=SHR                                   
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1) REPLACE                               
//*-------------------------------------------------------------------*         
//* SORT BP13K230 FOR BP13K240 UPDATE                                 *         
//*-------------------------------------------------------------------*         
//STEP24   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&P13F230F,DISP=(SHR,PASS)                                    
//SORTOUT  DD DSN=&&P13F230H,DISP=(NEW,PASS),                                   
//             UNIT=SYSDA,DCB=(RECFM=FB,LRECL=450),                             
//             SPACE=(CYL,(100,50),RLSE)                                        
//SYSIN    DD *                                                                 
           SORT FIELDS=(5,10,A,229,8,A,30,27,A),FORMAT=CH                       
//*-----------------------------------------------------------------            
//* TO UPDATE K240-MAX-CAT1, K240-MAX-CAT2, AND K240-MAX-CAT3                   
//* TO UPDATE K240-TOT-CAT1, K240-TOT-CAT2, AND K240-TOT-CAT3 TO ZERO           
//*-----------------------------------------------------------------            
//STEP25 EXEC    PGM=BP13C213,COND=(0,NE)                                       
//BP13F230 DD  DSN=&&P13F230H,                                                  
//             DISP=(SHR,PASS)                                                  
//BP13K240 DD  DSN=BP13.K240.HEADFLAT,DISP=SHR                                  
//BP13F240 DD  DSN=&&P13F240I,DISP=(NEW,PASS),                                  
//             UNIT=SYSDA,SPACE=(CYL,(10,5),RLSE),                              
//             DCB=(RECFM=FB,LRECL=450)                                         
//SYSOUT   DD  SYSOUT=*                                                         
//SYSTSPRT DD  SYSOUT=*                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSTSIN  DD  *                                                                
//*------------------------------------------------------------------*          
//*      SORT BP13F240 ACCORDING TO F240-KEY-FLD                     *          
//*------------------------------------------------------------------*          
//STEP26   EXEC SORT,CYL=30,COND=(0,NE)                                         
//SORTIN   DD DSN=&&P13F240I,DISP=(OLD,DELETE)                                  
//SORTOUT  DD DSN=&&P13F240J,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(10,5),RLSE),                               
//            DCB=(RECFM=FB,LRECL=450)                                          
//SYSIN    DD  *                                                                
  SORT FIELDS=(5,52,A),FORMAT=CH                                                
//*------------------------------------------------------------------*          
//* TO REPRO THE SORTED BP13F240 TO BP13T.K240.HEADFLAT.ROF          *          
//*------------------------------------------------------------------*          
//STEP27   EXEC PGM=IDCAMS                                                      
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=&&P13F240J,DISP=(SHR,PASS)                                    
//OUTPUT1  DD DSN=BP13.K240.HEADFLAT,DISP=SHR                                   
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1) REPLACE                               
//*------------------------------------------------------------------*          
//* TO REPRO THE SORTED BP13K240 TO BP13.K24H.HEADFLAT.HIST          *          
//*------------------------------------------------------------------*          
//STEP28   EXEC PGM=IDCAMS                                                      
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=&&P13F240A,DISP=(SHR,PASS)                                    
//OUTPUT1  DD DSN=BP13.K24H.HEADFLAT.HIST,DISP=SHR                              
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1) REPLACE                               
//*-----------------------------------------------------------------            
//* SORT BP13K240                                                               
//*-----------------------------------------------------------------            
//STEP29   EXEC  SORT,COND=(0,NE)                                               
//SORTIN   DD DSN=&&P13F240J,DISP=(SHR,PASS)                                    
//SORTOUT  DD DSN=&&P13F240K,DISP=(NEW,PASS),                                   
//            SPACE=(CYL,(10,10),RLSE),UNIT=SYSDA,                              
//            DCB=(RECFM=FB,BLKSIZE=0,LRECL=450)                                
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
   SORT FIELDS=(5,52,A),FORMAT=CH                                               
   INCLUDE COND=(5,2,CH,EQ,C'01')                                               
//*-----------------------------------------------------------------            
//* TO UPDATE K240-DTE-EST-CMPLTN AND K240-DTE-LSE-COMM                         
//*-----------------------------------------------------------------            
//STEP30   EXEC PGM=BP13C27E,COND=(0,NE)                                        
//BP13F240 DD DSN=&&P13F240K,DISP=(OLD,PASS)                                    
//BM06K100 DD DSN=BM06.K100.BLOCK,DISP=SHR,                                     
//         AMP=('BUFND=8','BUFNI=4')                                            
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR,                                   
//         AMP=('BUFND=8','BUFNI=4')                                            
//BM06K111 DD DSN=BM06.K110.FLATINV.PATH2,DISP=SHR,                             
//         AMP=('BUFND=8','BUFNI=4')                                            
//BB14K500 DD DSN=BB14.K500.BLKLEASE,DISP=SHR,                                  
//         AMP=('BUFND=8','BUFNI=4')                                            
//BB14K580 DD DSN=BB14.K580.UNTLEASE,DISP=SHR,                                  
//         AMP=('BUFND=8','BUFNI=4')                                            
//BB14K581 DD DSN=BB14.K580.UNTLEASE.PATH1,DISP=SHR,                            
//         AMP=('BUFND=8','BUFNI=4')                                            
//BP13K260 DD DSN=BP13.K260.BLOCK.DPP,DISP=SHR,                                 
//         AMP=('BUFND=8','BUFNI=4')                                            
//BP13K240 DD DSN=BP13.K240.HEADFLAT,DISP=SHR,                                  
//         AMP=('BUFND=8','BUFNI=4')                                            
//SYSUDUMP DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*-----------------------------------------------------------------            
//* TO SORT BP13K230 ACCORDING TO K230-KEY-FLD                                  
//*-----------------------------------------------------------------            
//STEP31   EXEC  SORT,COND=(0,NE)                                               
//SORTIN   DD DSN=&&P13F230H,DISP=(SHR,PASS)                                    
//SORTOUT  DD DSN=&&P13F230I,DISP=(NEW,PASS),                                   
//            SPACE=(CYL,(10,10),RLSE),UNIT=SYSDA,                              
//            DCB=(RECFM=FB,BLKSIZE=0,LRECL=450)                                
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
   SORT FIELDS=(64,11,A),FORMAT=CH                                              
//*-----------------------------------------------------------------            
//* TO UPDATE K230-NUM-RP                                                       
//*-----------------------------------------------------------------            
//STEP32   EXEC PGM=BP13C27F,COND=(0,NE)                                        
//BP13F230 DD DSN=&&P13F230I,DISP=(OLD,PASS)                                    
//BP13K230 DD DSN=BP13.K230.FLATLIST,DISP=SHR,                                  
//         AMP=('BUFND=8','BUFNI=4')                                            
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR,                                   
//         AMP=('BUFND=8','BUFNI=4')                                            
//SYSUDUMP DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*-----------------------------------------------------------------            
//* TO CREATE BP13.F230.EQMS                                                    
//*-----------------------------------------------------------------            
//STEP33 EXEC    PGM=BP13C22L,COND=(0,NE)                                       
//BP13F240 DD  DSN=&&P13F240K,DISP=(SHR,PASS)                                   
//BP13K230 DD  DSN=BP13.K230.FLATLIST,DISP=SHR,                                 
//         AMP=('BUFND=8','BUFNI=4')                                            
//BP13K231 DD  DSN=BP13.K230.FLATLIST.PATH3,DISP=SHR,                           
//         AMP=('BUFND=8','BUFNI=4')                                            
//BP13F230 DD DSN=&&P13F230J,DISP=(NEW,PASS),                                   
//            SPACE=(CYL,(10,10),RLSE),UNIT=SYSDA,                              
//            DCB=(RECFM=FB,BLKSIZE=0,LRECL=450)                                
//P13F230B DD DUMMY                                                             
//SYSOUT   DD  SYSOUT=*                                                         
//SYSTSPRT DD  SYSOUT=*                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSTSIN  DD  *                                                                
//*---------------------------------------------------------------------        
//STEP34   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&P13F230J,DISP=(SHR,PASS)                                    
//SORTOUT  DD DSN=BP13.F230.EQMS,DISP=SHR                                       
//SYSIN    DD  *                                                                
  SORT FIELDS=COPY                                                              
//*---------------------------------------------------------------------        
//* TO INCLUDE THE EQMS1 FOOTER                                                 
//*---------------------------------------------------------------------        
//STEP35 EXEC  PGM=BP13C23Q,COND=(0,NE)                                         
//BP13F230 DD  DSN=BP13.F230.EQMS,DISP=MOD                                      
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
/*                                                                              
//*------------------------------------------------------------------*          
//*  ACCUMULATE THE CONTROL REC INTO CTLREC-ACC FILE                            
//*------------------------------------------------------------------*          
//STEP36 EXEC    PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT DD  SYSOUT=*                                                         
//INPUT1   DD  DSN=&&BP13F205,DISP=(OLD,DELETE)                                 
//OUTPUT1  DD  DSN=BP13.F205.ACCUM,DISP=MOD                                     
//SYSIN    DD  *                                                                
      REPRO INFILE(INPUT1) OUTFILE(OUTPUT1)                                     
/*                                                                              
//******************************************************************            
//* FTP EQMS FILE TO HDBEQMSPF1 SERVER                                          
//******************************************************************            
//*STEP37   EXEC FTP,PARM='HDBEQMSPF1 (EXIT',COND=(8,LT)                        
//*NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                                 
//*INPUT    DD *                                                                
//*  CD  FTP\INTV\IN                                                            
//*  ASCII                                                                      
//*  PUT 'BP13.F230.EQMS' INTV_ZONE_IN.TXT                                      
//*  QUIT                                                                       
//*                                                                             
//******************************************************************            
//* FTP EQMS FILE TO HDBEQMSPF2 SERVER                                          
//******************************************************************            
//*STEP38   EXEC FTP,PARM='HDBEQMSPF2 (EXIT',COND=(8,LT)                        
//*NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                                 
//*INPUT    DD *                                                                
//*  CD  FTP\INTV\IN                                                            
//*  ASCII                                                                      
//*  PUT 'BP13.F230.EQMS' INTV_ZONE_IN.TXT                                      
//*  QUIT                                                                       
//*                                                                             
/*                                                                              
//******************************************************************            
//* FTP HQMS FILE TO HQMSIFSGP01 SERVER (PRODUCTION SERVER)                     
//******************************************************************            
//STEP39   EXEC FTP,PARM='HQMSIFSGP01 (EXIT',COND=(8,LT)                        
//NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                                  
//INPUT    DD *                                                                 
  CD  HQMS\FTP\INTV\IN                                                          
  ASCII                                                                         
  PUT 'BP13.F230.EQMS' INTV_ZONE_IN.TXT                                         
  QUIT                                                                          
//*                                                                             
//*---------------------------------------------------------------------        
//* END BP13A20B                                                                
//*---------------------------------------------------------------------        
