//BP13VFY  JOB (BP13P),'VERIFY FILES',CLASS=I,MSGCLASS=N,                       
//          MSGLEVEL=(1,1),NOTIFY=CSD0071                                       
//******************************************************************            
//* CHG REF  BY   ON      DESCRIPTION                                           
//* -------- --- ------   -----------                                           
//* BP130998 CLT 150501 - ADD STEP TO REMOVE SA FLAT CASES                      
//* BP130998 CLT 010601 - REMOVE STEP TO REMOVE SA FLAT CASES                   
//* BP132651 SSD 010305 - ADD INPUT17 FOR STEP01                                
//* BP132698 CLT 180505 - REMOVE AG07K962                                       
//* BP132847 YCH 110506 - ADD BP13K162 BP13K165                                 
//* BP132932 CKK 141206 - ADD BP13K730 BP13K825 BP13K830 BP13K500               
//*                       BP13K857                                              
//* BP133527 YCH 200209 - DELETE VERIFY BP17                                    
//******************************************************************            
//*--------------------------------------------------------------------         
//*      VERIFY FILES BEFORE DAILY PRODUCTION RUN                               
//*--------------------------------------------------------------------         
//STEP01  EXEC PGM=IDCAMS,COND=(0,NE)                                           
//INPUT1   DD DSN=BP13.K010.TENDER,DISP=OLD                                     
//INPUT2   DD DSN=BP13.K130.SOCHIST,DISP=OLD                                    
//INPUT3   DD DSN=BP13.K140.KIVTRAN,DISP=OLD                                    
//INPUT4   DD DSN=BP13.K150.EXAPPL,DISP=OLD                                     
//INPUT5   DD DSN=BP13.K160.BALANCE,DISP=OLD                                    
//INPUT6   DD DSN=BP13.K300.AGRORDER,DISP=OLD                                   
//INPUT7   DD DSN=BP13.K310.TRANS,DISP=OLD                                      
//INPUT8   DD DSN=BP13.K320.SCHEDULE,DISP=OLD                                   
//INPUT9   DD DSN=BP13.K330.ACCUMAO,DISP=OLD                                    
//INPUT10  DD DSN=BP13.K400.SALEORD,DISP=OLD                                    
//INPUT11  DD DSN=BP13.K410.ACCUMSO,DISP=OLD                                    
//INPUT12  DD DSN=BP13.K490.SCHEDULE,DISP=OLD                                   
//INPUT13  DD DSN=BP13.K490.SCHEDULE,DISP=OLD                                   
//INPUT14  DD DSN=BP13.K500.PREREGN,DISP=OLD                                    
//INPUT15  DD DSN=BP13.K910.TENDER.LOG,DISP=OLD                                 
//INPUT16  DD DSN=BP13.K650.PREPVRCH,DISP=OLD                                   
//INPUT17  DD DSN=BP13.E350.STDAPT.LOG,DISP=OLD                                 
//INPUT18  DD DSN=BP13.K162.LVYTAG,DISP=OLD                                     
//INPUT19  DD DSN=BP13.K165.LVYTAG.LOG,DISP=OLD                                 
//INPUT20  DD DSN=BP13.K730.MATURERQ,DISP=OLD                                   
//INPUT21  DD DSN=BP13.K825.REQOCCP,DISP=OLD                                    
//INPUT22  DD DSN=BP13.K830.ADDR,DISP=OLD                                       
//INPUT23  DD DSN=BP13.K500.PREREGN,DISP=OLD                                    
//INPUT24  DD DSN=BP13.K857.EMAIL,DISP=OLD                                      
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN   DD *                                                                  
          VFY FILE(INPUT1)                                                      
          VFY FILE(INPUT2)                                                      
          VFY FILE(INPUT3)                                                      
          VFY FILE(INPUT4)                                                      
          VFY FILE(INPUT5)                                                      
          VFY FILE(INPUT6)                                                      
          VFY FILE(INPUT7)                                                      
          VFY FILE(INPUT8)                                                      
          VFY FILE(INPUT9)                                                      
          VFY FILE(INPUT10)                                                     
          VFY FILE(INPUT11)                                                     
          VFY FILE(INPUT12)                                                     
          VFY FILE(INPUT13)                                                     
          VFY FILE(INPUT14)                                                     
          VFY FILE(INPUT15)                                                     
          VFY FILE(INPUT16)                                                     
          VFY FILE(INPUT17)                                                     
          VFY FILE(INPUT18)                                                     
          VFY FILE(INPUT19)                                                     
          VFY FILE(INPUT20)                                                     
          VFY FILE(INPUT21)                                                     
          VFY FILE(INPUT22)                                                     
          VFY FILE(INPUT23)                                                     
          VFY FILE(INPUT24)                                                     
//*--------------------------------------------------------------------         
//STEP02  EXEC PGM=IDCAMS,COND=(0,NE)                                           
//INPUT1   DD DSN=BP13.K010.TENDER,DISP=OLD                                     
//INPUT2   DD DSN=BP13.K130.SOCHIST,DISP=OLD                                    
//INPUT3   DD DSN=BP13.K140.KIVTRAN,DISP=OLD                                    
//INPUT4   DD DSN=BP13.K150.EXAPPL,DISP=OLD                                     
//INPUT5   DD DSN=BP13.K160.BALANCE,DISP=OLD                                    
//INPUT6   DD DSN=BP13.K300.AGRORDER,DISP=OLD                                   
//INPUT7   DD DSN=BP13.K310.TRANS,DISP=OLD                                      
//INPUT8   DD DSN=BP13.K320.SCHEDULE,DISP=OLD                                   
//INPUT9   DD DSN=BP13.K330.ACCUMAO,DISP=OLD                                    
//INPUT10  DD DSN=BP13.K400.SALEORD,DISP=OLD                                    
//INPUT11  DD DSN=BP13.K410.ACCUMSO,DISP=OLD                                    
//INPUT12  DD DSN=BP13.K490.SCHEDULE,DISP=OLD                                   
//INPUT13  DD DSN=BP13.K490.SCHEDULE,DISP=OLD                                   
//INPUT14  DD DSN=BP13.K500.PREREGN,DISP=OLD                                    
//INPUT15  DD DSN=BP13.K910.TENDER.LOG,DISP=OLD                                 
//INPUT16  DD DSN=BP13.K650.PREPVRCH,DISP=OLD                                   
//INPUT17  DD DSN=BP13.E350.STDAPT.LOG,DISP=OLD                                 
//INPUT18  DD DSN=BP13.K162.LVYTAG,DISP=OLD                                     
//INPUT19  DD DSN=BP13.K165.LVYTAG.LOG,DISP=OLD                                 
//INPUT20  DD DSN=BP13.K730.MATURERQ,DISP=OLD                                   
//INPUT21  DD DSN=BP13.K825.REQOCCP,DISP=OLD                                    
//INPUT22  DD DSN=BP13.K830.ADDR,DISP=OLD                                       
//INPUT23  DD DSN=BP13.K500.PREREGN,DISP=OLD                                    
//INPUT24  DD DSN=BP13.K857.EMAIL,DISP=OLD                                      
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN   DD *                                                                  
          VFY FILE(INPUT1)                                                      
          VFY FILE(INPUT2)                                                      
          VFY FILE(INPUT3)                                                      
          VFY FILE(INPUT4)                                                      
          VFY FILE(INPUT5)                                                      
          VFY FILE(INPUT6)                                                      
          VFY FILE(INPUT7)                                                      
          VFY FILE(INPUT8)                                                      
          VFY FILE(INPUT9)                                                      
          VFY FILE(INPUT10)                                                     
          VFY FILE(INPUT11)                                                     
          VFY FILE(INPUT12)                                                     
          VFY FILE(INPUT13)                                                     
          VFY FILE(INPUT14)                                                     
          VFY FILE(INPUT15)                                                     
          VFY FILE(INPUT16)                                                     
          VFY FILE(INPUT17)                                                     
          VFY FILE(INPUT18)                                                     
          VFY FILE(INPUT19)                                                     
          VFY FILE(INPUT20)                                                     
          VFY FILE(INPUT21)                                                     
          VFY FILE(INPUT22)                                                     
          VFY FILE(INPUT23)                                                     
          VFY FILE(INPUT24)                                                     
//*--------------------------------------------------------------------         
//STEP03  EXEC PGM=IDCAMS,COND=(0,NE)                                           
//INPUT1   DD DSN=BM06.K110.FLATINV,DISP=OLD                                    
//INPUT2   DD DSN=BM06.K190.LOG,DISP=OLD                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN   DD *                                                                  
          VFY FILE(INPUT1)                                                      
          VFY FILE(INPUT2)                                                      
//*--------------------------------------------------------------------         
