//BP13A564 JOB (BP13P),'BP13A564',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),    JOB02565
//       NOTIFY=CSD0071                                                         
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//*-------------------------------------------------------------------*         
//* DESCRIPTION :  RUN MQ TRIGGER PROGRAM                             *         
//*-------------------------------------------------------------------*         
//* SORT BP13F203 BY APPT TYPE, INCLUDE ONLY APPT TYPE = AQ           *         
//* AND FLAT TYP = WIA, WIB, WIC AND FIRST PHASE APPLICANTS           *         
//*-------------------------------------------------------------------*         
//STEP01   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K203.SMS,DISP=SHR                                        
//SORTOUT  DD DSN=&&BP13F203,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,                                                       
//            SPACE=(CYL,(50,10),RLSE),                                         
//            DCB=(RECFM=FB,LRECL=200,BLKSIZE=0)                                
//SYSIN    DD *                                                                 
      SORT FIELDS=(12,8,CH,A),FORMAT=CH                                         
      INCLUDE COND=(9,2,CH,EQ,C'AQ',AND,                                        
                    1,3,CH,EQ,C'WIA',AND,                                       
                    34,1,CH,EQ,C'A')                                            
//*-------------------------------------------------------------------*         
//*  CHECK CANCELLED CASES IN BP13K800                                *         
//*-------------------------------------------------------------------*         
//STEP1A   EXEC PGM=BP13CB09,COND=(0,NE)                                00581021
//BP13F203 DD DSN=&&BP13F203,DISP=(SHR,PASS)                                    
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR                                      
//P13F203A DD DSN=BP13.F203.SMS.AQ,DISP=SHR                                     
//BP13K764 DD DSN=BP13.K764.SALES,DISP=SHR                                      
//SYSDBG   DD SYSOUT=*                                                  00585021
//SYSDBOUT DD SYSOUT=*                                                  00585021
//SYSOUT   DD SYSOUT=*                                                  00585021
//*-------------------------------------------------------------------*         
//* SORT BP13F203 OMIT RECS WITHOUT HP NO.                            *         
//*-------------------------------------------------------------------*         
//STEP02   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F203.SMS.AQ,DISP=SHR                                     
//SORTOUT  DD DSN=BP13.F203.SMS.AQSMS,DISP=OLD                                  
//SYSIN    DD *                                                                 
      SORT FIELDS=(12,8,CH,A),FORMAT=CH                                         
      OMIT COND=(118,1,CH,EQ,C' ')                                              
//*--------------------------------------------------------------------*        
//* STEP03:  GET FIRST 500 RECS                                        *        
//*--------------------------------------------------------------------*        
//STEP03   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F203.SMS.AQSMS,DISP=SHR                                  
//OUTPUT1  DD DSN=BP13.F203.SMS.AQSMS.F100,DISP=OLD                             
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1) COUNT(500)                          
//*--------------------------------------------------------------------*        
//* STEP04:  GET NEXT 500 RECS                                         *        
//*--------------------------------------------------------------------*        
//STEP04   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F203.SMS.AQSMS,DISP=SHR                                  
//OUTPUT1  DD DSN=BP13.F203.SMS.AQSMS.F200,DISP=OLD                             
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1) COUNT(500) SKIP(500)                
//*--------------------------------------------------------------------*        
//* STEP05:  GET NEXT 500 RECS                                         *        
//*--------------------------------------------------------------------*        
//STEP05   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F203.SMS.AQSMS,DISP=SHR                                  
//OUTPUT1  DD DSN=BP13.F203.SMS.AQSMS.F300,DISP=OLD                             
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1) COUNT(500) SKIP(1000)               
//*--------------------------------------------------------------------*        
//*--------------------------------------------------------------------*        
//* STEP06:  GET NEXT 500 RECS                                         *        
//*--------------------------------------------------------------------*        
//STEP06   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F203.SMS.AQSMS,DISP=SHR                                  
//OUTPUT1  DD DSN=BP13.F203.SMS.AQSMS.F400,DISP=OLD                             
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1) COUNT(500) SKIP(1500)               
//*--------------------------------------------------------------------*        
//* STEP07:  GET NEXT 500 RECS                                         *        
//*--------------------------------------------------------------------*        
//STEP07   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F203.SMS.AQSMS,DISP=SHR                                  
//OUTPUT1  DD DSN=BP13.F203.SMS.AQSMS.F500,DISP=OLD                             
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1) COUNT(500) SKIP(2000)               
//*--------------------------------------------------------------------*        
//* STEP08:  GET NEXT 500 RECS                                         *        
//*--------------------------------------------------------------------*        
//STEP08   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F203.SMS.AQSMS,DISP=SHR                                  
//OUTPUT1  DD DSN=BP13.F203.SMS.AQSMS.F600,DISP=OLD                             
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1) COUNT(500) SKIP(2500)               
//*--------------------------------------------------------------------*        
//* STEP09:  GET NEXT 500 RECS                                         *        
//*--------------------------------------------------------------------*        
//STEP09   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F203.SMS.AQSMS,DISP=SHR                                  
//OUTPUT1  DD DSN=BP13.F203.SMS.AQSMS.F700,DISP=OLD                             
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1) COUNT(500) SKIP(3000)               
//*--------------------------------------------------------------------*        
//* STEP10:  GET NEXT 500 RECS                                         *        
//*--------------------------------------------------------------------*        
//STEP10   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F203.SMS.AQSMS,DISP=SHR                                  
//OUTPUT1  DD DSN=BP13.F203.SMS.AQSMS.F800,DISP=OLD                             
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1) COUNT(500) SKIP(3500)               
//*--------------------------------------------------------------------*        
//* STEP11:  GET NEXT 500 RECS                                         *        
//*--------------------------------------------------------------------*        
//STEP11   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F203.SMS.AQSMS,DISP=SHR                                  
//OUTPUT1  DD DSN=BP13.F203.SMS.AQSMS.F900,DISP=OLD                             
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1) COUNT(500) SKIP(4000)               
//*--------------------------------------------------------------------*        
//* STEP12:  GET FIRST 2000 RECS FOR EMAIL                             *        
//*--------------------------------------------------------------------*        
//STEP12   EXEC PGM=IDCAMS                                                      
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F203.SMS.AQ,DISP=SHR                                     
//OUTPUT1  DD DSN=BP13.F203.SMS.AQ.F100,DISP=OLD                                
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1) COUNT(2000)                         
//*--------------------------------------------------------------------*        
//* STEP13:  GET NEXT 2000 RECS FOR EMAIL                              *        
//*--------------------------------------------------------------------*        
//IFTEST1 IF (STEP12.RC = 0) THEN                                               
//STEP13   EXEC PGM=IDCAMS                                                      
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F203.SMS.AQ,DISP=SHR                                     
//OUTPUT1  DD DSN=BP13.F203.SMS.AQ.F200,DISP=OLD                                
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1) COUNT(2000) SKIP(2000)              
//ENDTEST1  ENDIF                                                               
//*--------------------------------------------------------------------*        
//* STEP14:  GET NEXT 2000 RECS FOR EMAIL                              *        
//*--------------------------------------------------------------------*        
//IFTEST2 IF (STEP13.RC = 0) THEN                                               
//STEP14   EXEC PGM=IDCAMS                                                      
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F203.SMS.AQ,DISP=SHR                                     
//OUTPUT1  DD DSN=BP13.F203.SMS.AQ.F300,DISP=OLD                                
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1) COUNT(2000) SKIP(4000)              
//ENDTEST2  ENDIF                                                               
//*--------------------------------------------------------------------*        
