//BP13A597 JOB (BP13P),'BP13A597',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//         NOTIFY=CSD0071,TYPRUN=HOLD                                           
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//*=====================================================================        
//* CHGE REQ  BY     DATE    DESCRIPTION                                        
//* -------- ---- -------- -------------------------------------                
//* BP130652 NOR  19990826 EXPAND F500,K500,F510,F520,K520,F595 RECL            
//*                        300 TO 500                                           
//* BP132546 YCH  11062004 INCLUDE STORCLAS(PRODRLS) & LOG(NONE)                
//* BP132627 SSS2 30112004 DELETE K542                                          
//* BP132818 BA3  26012006 TO CHANGE SORTING OF REF NO FROM 6 BYTES             
//*                        TO 8 BYTES.                                          
//*=====================================================================        
//*      VERIFY FILES BEFORE JOB RUN                                            
//*=====================================================================        
//STEPA    EXEC PGM=IDCAMS,COND=(0,NE)                                          
//INPUT1   DD DSN=BP13.K595.BALLOT.LOG,DISP=OLD                                 
//INPUT2   DD DSN=BP13.K730.MATURERQ,DISP=OLD                                   
//INPUT3   DD DSN=BP13.K825.REQOCCP,DISP=OLD                                    
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
          VFY FILE(INPUT1)                                                      
          VFY FILE(INPUT2)                                                      
          VFY FILE(INPUT3)                                                      
//*---------------------------------------------------------------------        
//* SORT BALLOT FILE BY REF-NO ORDER                                            
//*---------------------------------------------------------------------        
//STEP01   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K730.MATURERQ,DISP=SHR                                   
//SORTOUT  DD DSN=&&BP13F500,DISP=(,PASS),                                      
//            UNIT=SYSDA,SPACE=(CYL,(80,5),RLSE),                               
//            DCB=(RECFM=FB,LRECL=500)                                          
//SYSIN    DD *                                                                 
   SORT FIELDS=(33,8,A),FORMAT=CH                                               
   INCLUDE COND=(33,1,CH,EQ,C'Q')                                               
//*---------------------------------------------------------------------        
//* SORT BALLOT FILE BY REF-NO ORDER                                            
//*---------------------------------------------------------------------        
//STEP02   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K740.MATUREBA,DISP=SHR                                   
//SORTOUT  DD DSN=&&BP13F520,DISP=(,PASS),                                      
//            UNIT=SYSDA,SPACE=(CYL,(10,5),RLSE),                               
//            DCB=(RECFM=FB,LRECL=500)                                          
//SYSIN    DD *                                                                 
   SORT FIELDS=(33,8,A),FORMAT=CH                                               
   INCLUDE COND=(33,1,CH,EQ,C'Q')                                               
//*OUTREC FIELDS=(1,225,211,2,X,229,72)                                         
//*---------------------------------------------------------------------        
//*  MATCH BALLOT FILE WITH REQUEST FILE FOR LOADING TO HIST FILE               
//*  FOR MATCHED CASES, OUTPUT THE REC TO HISTORY FILE BP13F595                 
//*  FOR UNMATCHED CASES, OUTPUT THE REC BACK TO REQUEST FILE                   
//*---------------------------------------------------------------------        
//STEP03   EXEC PGM=BP13C546,COND=(0,NE)                                        
//BP13F520 DD DSN=&&BP13F520,DISP=(OLD,PASS)                                    
//BP13F500 DD DSN=&&BP13F500,DISP=(OLD,PASS)                                    
//BP13F595 DD DSN=BP13.F595.BALLOT.LOG,DISP=OLD                                 
//BP13F510 DD DSN=BP13.F500.REN,DISP=OLD                                        
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*---------------------------------------------------------------------        
//*  REPRO NEW HISTORY RECORDS TO BP13K595 FILE                                 
//*---------------------------------------------------------------------        
//STEP04   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F595.BALLOT.LOG,DISP=SHR                                 
//OUTPUT1  DD DSN=BP13.K595.BALLOT.LOG,DISP=SHR,                                
//            AMP=('BUFND=23')                                                  
//SYSIN    DD *                                                                 
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1) REPLACE                               
//*                                                                             
//*=====================================================================        
//* OMIT REN CASES FROM BP13.K730.MATURERQ                                      
//*---------------------------------------------------------------------        
//STEP11   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K730.MATURERQ,DISP=SHR,AMP=('BUFND=23')                  
//SORTOUT  DD DSN=BP13.F730.MATURERQ.PROD,DISP=(NEW,CATLG),                     
//            UNIT=SYSDA,SPACE=(CYL,(80,5),RLSE),                               
//            DCB=(RECFM=FB,LRECL=500)                                          
//SYSIN    DD  *                                                                
   SORT FIELDS=(123,8,A),FORMAT=CH,FILSZ=E50000                                 
   OMIT COND=(33,1,CH,EQ,C'Q')                                                  
//*---------------------------------------------------------------------        
//* REDEFINE BP13.K730.MATURERQ (WITHOUT REN CASES)                             
//*---------------------------------------------------------------------        
//STEP12   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//INPUT    DD DSN=BP13.F730.MATURERQ.PROD,DISP=SHR                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
         DEL (BP13.K730.MATURERQ) CLUSTER PURGE                                 
         DEF CL (NAME(BP13.K730.MATURERQ)              -                        
                 CYL(50 5)                             -                        
                 UNIQUE                                -                        
                 SPEED                                 -                        
                 STORCLAS(PRODRLS)                     -                        
                 LOG(NONE)                             -                        
                 SHR(2 3))                             -                        
                 DATA                                  -                        
                 (NAME(BP13.K730.MATURERQ.DATA)        -                        
                 KEYS(8 122)                           -                        
                 RECSZ(500 500)                        -                        
                 CISZ(4096))                                                    
         IF LASTCC = 0 THEN                            -                        
           REPRO IFILE(INPUT)                          -                        
                 ODS(BP13.K730.MATURERQ)                                        
         IF MAXCC = 0 THEN                             -                        
           DEF AIX (NAME(BP13.K730.MATURERQ.ALTX1)     -                        
               REL(BP13.K730.MATURERQ)                 -                        
               CYL(5 3)                                -                        
              UNIQUE                                   -                        
               SHR(2 3))                               -                        
               DATA                                    -                        
               (NAME(BP13.K730.MATURERQ.ALTX1.DATA)    -                        
               KEYS(9 40)                              -                        
               CISZ(4096)                              -                        
               RECSZ(60 500)                           -                        
               NUNQK)                                                           
         IF LASTCC = 0 THEN                            -                        
           DEF PATH(NAME(BP13.K730.MATURERQ.PATH1)     -                        
               PENT(BP13.K730.MATURERQ.ALTX1))                                  
         IF LASTCC = 0 THEN                            -                        
           BIX IDS(BP13.K730.MATURERQ)                 -                        
               ODS(BP13.K730.MATURERQ.ALTX1)                                    
         IF MAXCC = 0 THEN                             -                        
           DEF AIX (NAME(BP13.K730.MATURERQ.ALTX2)     -                        
               REL(BP13.K730.MATURERQ)                 -                        
               CYL(5  3)                               -                        
              UNIQUE                                   -                        
               SHR(2 3))                               -                        
               DATA                                    -                        
               (NAME(BP13.K730.MATURERQ.ALTX2.DATA)    -                        
               KEYS(9 81)                              -                        
               CISZ(4096)                              -                        
               RECSZ(500 3000)                         -                        
               NUNQK)                                                           
         IF LASTCC = 0 THEN                            -                        
           DEF PATH(NAME(BP13.K730.MATURERQ.PATH2)     -                        
               PENT(BP13.K730.MATURERQ.ALTX2))                                  
         IF LASTCC = 0 THEN                            -                        
           BIX IDS(BP13.K730.MATURERQ)                 -                        
               ODS(BP13.K730.MATURERQ.ALTX2)                                    
//*---------------------------------------------------------------------        
//* OMIT REN CASES FROM BP13.K825.REQOCCP                                       
//*---------------------------------------------------------------------        
//STEP13  EXEC SORT,COND=(0,NE)                                                 
//SORTIN   DD DSN=BP13.K825.REQOCCP,DISP=SHR,AMP=('BUFND=23')                   
//SORTOUT  DD DSN=BP13.F825.REQOCCP.PROD,DISP=(NEW,CATLG),                      
//            UNIT=SYSDA,SPACE=(CYL,(50,5),RLSE),                               
//            DCB=(RECFM=FB,LRECL=200)                                          
//SYSIN   DD *                                                                  
   SORT FIELDS=(1,17,A),FORMAT=CH                                               
   OMIT COND=(1,1,CH,EQ,C'Q')                                                   
//*---------------------------------------------------------------------        
//* REDEFINE BP13.K825.REQOCCP  (WITHOUT REN CASES)                             
//*---------------------------------------------------------------------        
//STEP14   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT    DD DSN=BP13.F825.REQOCCP.PROD,DISP=SHR                               
//SYSIN    DD *                                                                 
  DEL (BP13.K825.REQOCCP) CLUSTER PURGE                                         
  DEF CLUSTER                                          -                        
        (NAME(BP13.K825.REQOCCP)                       -                        
        SHR(2,3)                                       -                        
        KEYS(17 0)                                     -                        
        CYL(40 5)                                      -                        
        RECSZ(200 200)                                 -                        
        FREESPACE(30 30)                               -                        
        CISZ(4096)                                     -                        
        STORCLAS(PRODRLS)                              -                        
        LOG(NONE)                                      -                        
        IXD                                            -                        
        UNQ)                                           -                        
      DATA                                             -                        
        (NAME(BP13.K825.REQOCCP.DATA))                 -                        
      INDEX                                            -                        
        (NAME(BP13.K825.REQOCCP.INDEX))                                         
      IF LASTCC = 0 THEN                               -                        
        REPRO IFILE(INPUT)                             -                        
              ODS(BP13.K825.REQOCCP)                                            
      IF MAXCC = 0 THEN                                -                        
        DEF AIX (NAME(BP13.K825.REQOCCP.ALTX1)         -                        
            REL(BP13.K825.REQOCCP)                     -                        
            CYL(20 2)                                  -                        
              UNIQUE                                   -                        
            SHR(2 3))                                  -                        
            DATA                                       -                        
            (NAME(BP13.K825.REQOCCP.ALTX1.DATA)        -                        
            KEYS(9 8)                                  -                        
            CISZ(4096)                                 -                        
            RECSZ(60 300)                              -                        
            NUNQK)                                                              
      IF MAXCC = 0 THEN                                -                        
        DEF PATH(NAME(BP13.K825.REQOCCP.PATH1)         -                        
            PENT(BP13.K825.REQOCCP.ALTX1))                                      
      IF MAXCC = 0 THEN                                -                        
        BIX IDS(BP13.K825.REQOCCP)                     -                        
            ODS(BP13.K825.REQOCCP.ALTX1)                                        
//*---------------------------------------------------------------------        
//* DELETE TEMP FILE                                                            
//*---------------------------------------------------------------------        
//STEP15   EXEC PGM=IEFBR14,COND=(0,NE)                                         
//OUTPUT1  DD  DSN=BP13.F730.MATURERQ.PROD,DISP=(OLD,DELETE)                    
//OUTPUT2  DD  DSN=BP13.F825.REQOCCP.PROD,DISP=(OLD,DELETE)                     
//SYSIN    DD *                                                                 
//*                                                                             
//*---------------------------------------------------------------------        
//* SORT OUT WITH REGN-NO OCCUP                                                 
//*---------------------------------------------------------------------        
//STEP16   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K825.REQOCCP,DISP=SHR                                    
//SORTOUT  DD DSN=&&F825SUCC,DISP=(,PASS),                                      
//         UNIT=SYSDA,SPACE=(CYL,(30,10),RLSE),                                 
//         DCB=(RECFM=FB,LRECL=200,BLKSIZE=23400)                               
//SYSIN    DD  *                                                                
      SORT FIELDS=(1,17,A),FORMAT=CH                                            
      INCLUDE COND=(1,1,CH,EQ,C'1')                                             
//*-----------------------------------------------------------------            
//* DELETE BP13K825 IF FOUND IN BP13K820                                        
//*-----------------------------------------------------------------            
//STEP17    EXEC PGM=BP13C184,COND=(0,NE)                                       
//BP13F825  DD DSN=&&F825SUCC,DISP=(OLD,PASS)                                   
//BP13K820  DD DSN=BP13.K820.OCCUP,DISP=SHR,                                    
//          AMP=('BUFND=4','BUFNI=8')                                           
//BP13K825  DD DSN=BP13.K825.REQOCCP,DISP=SHR,                                  
//          AMP=('BUFND=4','BUFNI=8')                                           
//SYSOUT    DD SYSOUT=*                                                         
//SYSPRINT  DD SYSOUT=*                                                         
//SYSDBG    DD SYSOUT=*                                                         
//SYSDBOUT  DD SYSOUT=*                                                         
//SYSABOUT  DD SYSOUT=*                                                         
//SYSIN     DD *                                                                
/*                                                                              
//*---------------------------------------------------------------------        
//* END BP13A597                                                                
//*---------------------------------------------------------------------        
