//BP13M711 JOB (BP13P),'BP13M711',MSGCLASS=N,CLASS=I,MSGLEVEL=(1,1),            
//      NOTIFY=CSD0071                                                          
//JOBLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                    
//*====================================================================         
//* RUN ON 4TH OF THE MONTH AFTER CLOSING OF SOC ACCOUNT                        
//*====================================================================         
//* PRINT MONTH END REPORT                                                      
//*====================================================================         
//* BP132772 030506 LSB  DBSS                                                   
//* BP133091 151207 LMS  EXPANSION OF BP13KD00 FROM 1200 TO 1600                
//* BP133115 210308 LSB  REPEAT STEP23-33 FOR NON-CON LOAN REPORT LC28          
//* BP133115 200307 ED1  EXPANSION OF BP13CC22 & BP13CC33 INTO                  
//*                      CONCESSIONARY & NON-CONCESSIONARY CASES                
//* BP133314 130608 LSB  ADD JVP FOR CC66, ADD REPORT TO FIN LC34/LC08          
//* BP133314 150508 ED1 TAKE OUT BP13.FD38.PPTRANS.DUEDTE ;                     
//*                     SORT DUE CASES FOR STEP23 & STEP23A INSTEAD             
//* BP133360 120808 ED1 INCLUDE JVP IN STEP11.                                  
//*                     REMOVE JVP IN STEPS 38,38A (BP13CC22 & BP13CC23)        
//* BP133545 250209 LSB NEW REPORT BP13LCAC                                     
//* BP133572 060409 JB8 TO SEPARATE REPORT BP13LC34 BY PP                       
//* BP133588 060509 LSB INCLUDE JVI IN SC02, CC22, CC23                         
//* BP133638 210709 LSB OMIT TRANS-TY=70, 71 IN STEP11                          
//* BP133638 071009 LSB MOVE BP13CC33 FROM M711 TO BP13M710 JOB                 
//* BP133784 251010 JB8 ADD BP13S038 REPORT ON LOAN                             
//* BP133847 150310 LSB ADD SUB-TRF TO BP13S038, DEL CHECK IN STEP55            
//* BP133907 180610 JB8 REPLACE BP13S038 WITH BP13CC35 & BP13CC3A               
//* BP134089 080211 LSB ADD BP13KD03 TO BP13CC28                                
//* BP134372 031011 ZDD1ADD NEW FORM FOR BP13CB49                               
//* BP134429 031011 LSB MOVE CC64, CC63 FROM M713 TO M711                       
//* BP134372 101212 PCL PRINT ONLY D03 & D06 PROJECT CODE FOR BP13CB49          
//* BP134632 141212 ALLOCATE PERMANENT DATASET FOR LC15 AND LC28 REPORT         
//* BP134707 280513 ADD UNMATCHED REPORT BP13CC22                               
//* BP134889 020513 NST STOP PRINTING DBSS FIRE INSURANCE LETTER                
//*                     & LISTING (STEP 64 & 65)                                
//* BP134744 141013 LSB ADD BP13CM23 FO PRINTING BP13CC23                       
//* BP135171 110214 RJE TO CATER FOR DB2 UPGRADE                                
//* BP135262 200314 PCL TO CONVERT BP13LB49 TO EMAIL                            
//* BP137181 060918 LSB IOMS CHANGE                                             
//*====================================================================         
//******************************************************************            
//*  SEND DYNAMIC JDE AHEAD OF THE PRINT DATASET - MA&B UNIT                    
//*-----------------------------------------------------------------            
//PRT01   EXEC PGM=IEBGENER                                                     
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAAARS1A CP-1',END;                                    
1$DJDE$ JDE=BP13D,JDL=BP13,COPIES=1,END;                                        
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAAARS1A                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID),DEST=IOM2                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//******************************************************************            
//*  SEND DYNAMIC JDE AHEAD OF THE PRINT DATASET - FIN DEPT                     
//*-----------------------------------------------------------------            
//PRT02   EXEC PGM=IEBGENER                                                     
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-FI1A CP-1',END;                                        
1$DJDE$ JDE=BP13D,JDL=BP13,COPIES=1,END;                                        
//FORMID   OUTPUT FORMS=1WD1,GROUPID=FI1A                                       
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID),DEST=IOM2                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*-----------------------------------------------------------------            
//* TO SEND DYNAMIC JDE AHEAD OF THE PRINT DATASETS                             
//* PRT02 : 2 COPIES                         (MA&B TEAM)                        
//*-----------------------------------------------------------------            
//PRT03    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAAARS2A CP-1',END;                                    
1$DJDE$ JDE=BP13D,JDL=BP13,COPIES=1,END;                                        
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAAARS2A                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID),DEST=IOM2                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*                                                                             
//******************************************************************            
//*  SEND DYNAMIC JDE AHEAD OF THE PRINT DATASET - HOUSING FIN (HAD)            
//*-----------------------------------------------------------------            
//PRT04   EXEC PGM=IEBGENER                                                     
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-HAHF CP-1',END;                                        
1$DJDE$ JDE=BP13D,JDL=BP13,COPIES=1,END;                                        
//FORMID   OUTPUT FORMS=1WD1,GROUPID=HAHF                                       
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID),DEST=IOM2                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//******************************************************************            
//*  SEND DYNAMIC JDE AHEAD OF THE PRINT DATASET - AGREEMENT TEAM               
//*-----------------------------------------------------------------            
//PRT05   EXEC PGM=IEBGENER                                                     
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAALAG1A CP-1',END;                                    
1$DJDE$ JDE=BP13D,JDL=BP13,COPIES=1,END;                                        
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALAG1A                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID),DEST=IOM2                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*-------------------------------------------------------------------*         
//*-----------------------------------------------------------------            
//* SEND DJDE AHEAD OF THE PRINT DATASET                                        
//* PRT06 : COPIES = 1 (BP13AY)                                                 
//*-----------------------------------------------------------------            
//PRT06    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAALST1C CP-1',END;                                    
1$DJDE$ JDE=13POT5,FORM=BP13AY,JDL=BP13,END;                                    
//FORMID   OUTPUT FORMS=1WS1,GROUPID=EAALST1C                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID),DEST=IOM2                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*-------------------------------------------------------------------*         
//* SORT BP13F136 MONTH TRANSACTION                                   *         
//*-------------------------------------------------------------------*         
//STEP01   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F136.MTHTRAN.DBSS,DISP=SHR                               
//SORTOUT  DD DSN=&&F136PPTX,DISP=(,PASS),                                      
//          UNIT=SYSDA,SPACE=(CYL,(20,5),RLSE),                                 
//          DCB=(BLKSIZE=23400,LRECL=150,RECFM=FB)                              
//SYSIN     DD  *                                                               
   SORT FIELDS=(5,8,A),FORMAT=CH                                                
   INCLUDE COND=(99,3,CH,EQ,C'PP ',OR,                                          
                 99,3,CH,EQ,C'OPT',OR,                                          
                 99,3,CH,EQ,C'JVP',OR,                                          
                 99,3,CH,EQ,C'JVI',OR,                                          
                 99,3,CH,EQ,C'JVL')                                             
//*-------------------------------------------------------------------*         
//* PRINT REPORT ON CASH RECEIPT FOR PP LUMPSUM                                 
//*-------------------------------------------------------------------*         
//STEP02   EXEC  SAS,COND=(0,NE)                                                
//BP13LC01 DD DSN=&&BP13LC01,DISP=(,PASS),                                      
//         UNIT=SYSDA,                                                          
//         SPACE=(CYL,(20,10),RLSE),                                            
//         DCB=(RECFM=FA,LRECL=133,BLKSIZE=133)                                 
//BP13F136 DD DSN=&&F136PPTX,DISP=(OLD,PASS)                                    
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13SC01),DISP=SHR                             
//*-------------------------------------------------------------------*         
//* REPORT ON CASH RECEIPT FOR PP LUMPSUM                                       
//*-------------------------------------------------------------------*         
//STEP03   EXEC PGM=IEBGENER,COND=(0,NE)                                        
//SYSUT1   DD DSN=&&BP13LC01,DISP=(OLD,PASS)                                    
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*-------------------------------------------------------------------*         
//* PRINT REPORT 0N CASH RECEIPT FOR THE MONTH TO FIN DEPT            *         
//*-------------------------------------------------------------------*         
//STEP04   EXEC PGM=IEBGENER,COND=(0,NE)                                        
//SYSUT1   DD DSN=&&BP13LC01,DISP=(OLD,PASS)                                    
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.PRT02.FORMID),DEST=IOM2                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
/*                                                                              
//*-------------------------------------------------------------------*         
//* PRINT REPORT ON VOUCHER/ADJUSTMENT                                          
//*-------------------------------------------------------------------*         
//STEP05   EXEC  SAS,COND=(0,NE)                                                
//BP13LC02 DD DSN=&&BP13LC02,DISP=(,PASS),                                      
//         UNIT=SYSDA,                                                          
//         SPACE=(CYL,(20,10),RLSE),                                            
//         DCB=(RECFM=FA,LRECL=133,BLKSIZE=133)                                 
//BP13F136 DD DSN=&&F136PPTX,DISP=(OLD,PASS)                                    
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13SC02),DISP=SHR                             
//*                                                                             
//*-------------------------------------------------------------------*         
//* REPORT 0N VOUCHER/ADJUSTMENT                                                
//*-------------------------------------------------------------------*         
//STEP06   EXEC PGM=IEBGENER,COND=(0,NE)                                        
//SYSUT1   DD DSN=&&BP13LC02,DISP=(OLD,PASS)                                    
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*-------------------------------------------------------------------*         
//* PRINT REPORT ON CPF PAYMENT FOR PP LUMPSUM                                  
//*-------------------------------------------------------------------*         
//STEP07   EXEC  SAS,COND=(0,NE)                                                
//BP13LC03 DD DSN=&&BP13LC03,DISP=(,PASS),UNIT=SYSDA,                           
//          SPACE=(TRK,(600,50),RLSE),                                          
//          DCB=(RECFM=FA,LRECL=133,BLKSIZE=133)                                
//BP13F136 DD DSN=&&F136PPTX,DISP=(OLD,PASS)                                    
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13SC03),DISP=SHR                             
//*                                                                             
//*-------------------------------------------------------------------*         
//* REPORT 0N CPF PAYMENT FOR THE MONTH ON HARDCOPY                             
//*-------------------------------------------------------------------*         
//STEP08   EXEC PGM=IEBGENER,COND=(0,NE)                                        
//SYSUT1   DD DSN=&&BP13LC03,DISP=(OLD,PASS)                                    
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*-------------------------------------------------------------------*         
//* PRINT REPORT 0N CPF PAYMENT FOR THE MONTH TO FIN DEPT            *          
//*-------------------------------------------------------------------*         
//STEP09   EXEC PGM=IEBGENER,COND=(0,NE)                                        
//SYSUT1   DD DSN=&&BP13LC03,DISP=(OLD,PASS)                                    
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.PRT02.FORMID),DEST=IOM2                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*-------------------------------------------------------------------*         
//*  REPRO VSAM FILE TO SEQUENTIAL FILES                              *         
//*-------------------------------------------------------------------*         
//STEP10   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F136.MTHTRAN.PPPREV,DISP=SHR                             
//OUTPUT1  DD DSN=BP13.F136.MTHTRAN.PPPREV.BKUP,DISP=OLD                        
//*                                                                             
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
//*-------------------------------------------------------------------*         
//* SORT BP13F136 FILE BY REGN NO AND TRANS CDE                                 
//*-------------------------------------------------------------------*         
//STEP11   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F136.MTHTRAN.DBSS,DISP=SHR                               
//SORTOUT  DD DSN=BP13.F136.MTHTRAN.PP,DISP=SHR                                 
//SYSIN    DD *                                                                 
    SORT FIELDS=(5,8,A,130,2,A,1,2,A),FORMAT=CH                                 
    INCLUDE COND=((1,2,CH,NE,C'71'),AND,                                        
                  (99,2,CH,EQ,C'PP',OR,                                         
                   99,3,CH,EQ,C'OPT',OR,                                        
                   99,3,CH,EQ,C'JVP'))                                          
//*-------------------------------------------------------------------*         
//* MERGE PREV MTH WITH CURR MTH                                                
//*-------------------------------------------------------------------*         
//STEP12   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F136.MTHTRAN.PP,DISP=SHR                                 
//         DD DSN=BP13.F136.MTHTRAN.PPPREV,DISP=SHR                             
//SORTOUT  DD DSN=&&F136PP,DISP=(,PASS),                                        
//            UNIT=SYSDA,SPACE=(CYL,(10,5),RLSE),                               
//            DCB=(RECFM=FB,LRECL=150,BLKSIZE=0)                                
//SYSIN    DD *                                                                 
    SORT FIELDS=(5,8,A,130,2,A,1,2,A),FORMAT=CH                                 
    INCLUDE COND=(99,2,CH,EQ,C'PP',OR,                                          
                  99,3,CH,EQ,C'OPT',OR,                                         
                  99,3,CH,EQ,C'JVP')                                            
//*-------------------------------------------------------------------*         
//*  CREATE DIFFERENT FILES FOR EQUAL AND NOT EQUAL AMTS              *         
//*-------------------------------------------------------------------*         
//STEP13   EXEC PGM=BP13CC66,COND=(0,NE)                                        
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//BP13F136 DD DSN=&&F136PP,DISP=(OLD,PASS)                                      
//P13F136A DD DSN=&&F130CLER,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(10,5),RLSE),                               
//            DCB=(RECFM=FB,LRECL=150,BLKSIZE=23400)                            
//P13F136B DD DSN=BP13.F136.MTHTRAN.PPPREV,DISP=OLD                             
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*-------------------------------------------------------------------*         
//* SORT BY REPORT-TAG (A,B,C), TRANS-TY, REGN, DTE-POST, AGING                 
//*-------------------------------------------------------------------*         
//STEP14   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F136.MTHTRAN.PPPREV,DISP=SHR                             
//         DD DSN=&&F130CLER,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F130ALL,DISP=(NEW,PASS),                                    
//         UNIT=SYSDA,SPACE=(CYL,(10,5),RLSE),                                  
//         DCB=(RECFM=FB,LRECL=150,BLKSIZE=0)                                   
//SYSIN    DD *                                                                 
      SORT FIELDS=(149,1,CH,A,5,8,CH,A,130,2,A,91,8,A,21,3,A,                   
                   132,3,CH,A),FORMAT=CH                                        
//*-------------------------------------------------------------------*         
//* PRINT MONTHLY REPORT FOR CLEARED AND OUTSTANDING CASES.                     
//* 1. P13LC34A - CLEARED CASES                                                 
//* 2. P13LC34B - OUTSTANDING CASES AS AT DATE                                  
//*-------------------------------------------------------------------*         
//STEP15   EXEC PGM=BP13CC34,COND=(0,NE)                                        
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//BP13F130 DD DSN=&&F130ALL,DISP=(OLD,PASS)                                     
//P13LC34A DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//P13LC34B DD DSN=&&P13LC34B,DISP=(,PASS),                                      
//         UNIT=SYSDA,                                                          
//         SPACE=(CYL,(20,10),RLSE),                                            
//         DCB=(RECFM=FA,LRECL=133,BLKSIZE=133)                                 
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
/*                                                                              
//*-------------------------------------------------------------------*         
//* REPORT ON O/S PP ( TO MA&B)                                                 
//*-------------------------------------------------------------------*         
//STEP15A  EXEC PGM=IEBGENER,COND=(0,NE)                                        
//SYSUT1   DD DSN=&&P13LC34B,DISP=(OLD,PASS)                                    
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*-------------------------------------------------------------------*         
//* REPORT 0N O/S PP ( TO FIN DEPT)                                             
//*-------------------------------------------------------------------*         
//STEP15B  EXEC PGM=IEBGENER,COND=(0,NE)                                        
//SYSUT1   DD DSN=&&P13LC34B,DISP=(OLD,PASS)                                    
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.PRT02.FORMID),DEST=IOM2                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
/*                                                                              
//*-------------------------------------------------------------------*         
//*  SORT BY MONTH AGE                                                          
//*  INCLUDE ONLY OUTSTANDING CASES                                             
//*-------------------------------------------------------------------*         
//STEP16   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F136.MTHTRAN.PPPREV,DISP=SHR                             
//SORTOUT  DD DSN=&&BP13F13B,DISP=(NEW,PASS),                                   
//         UNIT=SYSDA,SPACE=(CYL,(10,5),RLSE),                                  
//         DCB=(RECFM=FB,LRECL=150,BLKSIZE=0)                                   
//SYSIN    DD *                                                                 
    SORT FIELDS=(132,3,CH,A),FORMAT=CH                                          
    OMIT COND=(149,1,CH,NE,C'B')                                                
//*                                                                             
//*-------------------------------------------------------------------*         
//* AGEING ANALYSIS ON MONTHLY REPORT ON OUTSTANDING CASES                      
//*-------------------------------------------------------------------*         
//STEP17   EXEC  SAS,COND=(0,NE)                                                
//BP13LC08 DD DSN=&&BP13LC08,DISP=(,PASS),UNIT=SYSDA,                           
//         SPACE=(TRK,(600,50),RLSE),                                           
//         DCB=(RECFM=FA,LRECL=133,BLKSIZE=133)                                 
//BP13F130 DD DSN=&&BP13F13B,DISP=(OLD,PASS)                                    
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13SC08),DISP=SHR                             
//*                                                                             
//*-------------------------------------------------------------------*         
//* PRINT AGEING ANALYSIS ON MONTHLY REPORT ON OUTSTANDING CASE(MA&B)           
//*-------------------------------------------------------------------*         
//STEP18   EXEC PGM=IEBGENER,COND=(0,NE)                                        
//SYSUT1   DD DSN=&&BP13LC08,DISP=(OLD,PASS)                                    
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
/*                                                                              
//*-------------------------------------------------------------------*         
//* PRINT AGEING ANALYSIS ON MONTHLY REPORT ON OUTSTANDING CASES (FIN)          
//*-------------------------------------------------------------------*         
//STEP18A  EXEC PGM=IEBGENER,COND=(0,NE)                                        
//SYSUT1   DD DSN=&&BP13LC08,DISP=(OLD,PASS)                                    
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.PRT02.FORMID),DEST=IOM2                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
/*                                                                              
//*-------------------------------------------------------------------*         
//* SORT BP13KD40 PP ORDER FOR SCHEDULE = 01                                    
//*-------------------------------------------------------------------*         
//STEP19   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.KD40.APPLPAY,DISP=SHR                                    
//SORTOUT  DD DSN=&&FD40PP,DISP=(,PASS),                                        
//          UNIT=SYSDA,SPACE=(CYL,(20,5),RLSE),                                 
//          DCB=(BLKSIZE=0,LRECL=1500,RECFM=FB)                                 
//SYSIN     DD  *                                                               
   SORT FIELDS=(9,8,A),FORMAT=CH                                                
   INCLUDE COND=(17,2,CH,EQ,C'01')                                              
//*-------------------------------------------------------------------*         
//* SORT BP13KD45 PP ORDER HISTORY FOR SCHEDULE = 01                            
//*-------------------------------------------------------------------*         
//STEP20   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.KD45.PPAYHIST,DISP=SHR                                   
//SORTOUT  DD DSN=&&FD40PP,DISP=(MOD,PASS),                                     
//          UNIT=SYSDA,SPACE=(CYL,(20,5),RLSE),                                 
//          DCB=(BLKSIZE=0,LRECL=1500,RECFM=FB)                                 
//SYSIN     DD  *                                                               
   SORT FIELDS=(9,8,A),FORMAT=CH                                                
   INCLUDE COND=(17,2,CH,EQ,C'01')                                              
   OUTREC FIELDS=(1,1500)                                                       
//*-------------------------------------------------------------------*         
//STEP21   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&FD40PP,DISP=(OLD,PASS)                                      
//SORTOUT  DD DSN=&&FD40SORT,DISP=(,PASS),                                      
//          UNIT=SYSDA,SPACE=(CYL,(20,5),RLSE),                                 
//          DCB=(BLKSIZE=0,LRECL=1500,RECFM=FB)                                 
//SYSIN     DD  *                                                               
   SORT FIELDS=(9,8,A),FORMAT=CH                                                
//*-------------------------------------------------------------------*         
//* PRINT REPORT ON NEW DBSS CASES FOR THE MONTH                                
//*-------------------------------------------------------------------*         
//STEP22   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K               
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//BP13FD40 DD DSN=&&FD40SORT,DISP=(OLD,PASS)                                    
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR,                                     
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13KD00 DD DSN=BP13.KD00.DBSMAST,DISP=SHR                                    
//BP13LC27 DD SYSOUT=2,OUTPUT=(*.PRT03.FORMID),DEST=IOM2                        
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13CC27) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
/*                                                                              
//*-------------------------------------------------------------------*         
//* SORT BP13FD38 IN REGN/DTE-DUE                                               
//*-------------------------------------------------------------------*         
//STEP23   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD  DSN=BP13.KD38.PPTRANS,DISP=SHR                                   
//SORTOUT  DD DSN=&&FD38NEW,DISP=(,PASS),                                       
//          UNIT=SYSDA,SPACE=(CYL,(20,5),RLSE),                                 
//          DCB=(BLKSIZE=0,LRECL=400,RECFM=FB)                                  
//SYSIN     DD  *                                                               
   SORT FIELDS=(1,8,A,24,8,A),FORMAT=CH                                         
   INCLUDE COND=(9,3,CH,EQ,C'DUE',AND,325,1,CH,EQ,C'P',AND,                     
               327,1,CH,EQ,C'Y')                                                
//*-------------------------------------------------------------------*         
//* SORT BM06F120 IN REGN-NO                                                    
//*-------------------------------------------------------------------*         
//STEP24   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BM06.F120.FLATINV.PIDB,DISP=SHR                               
//SORTOUT  DD DSN=&&BM06F120,DISP=(,PASS),                                      
//          UNIT=SYSDA,SPACE=(CYL,(250,50),RLSE),                               
//          DCB=(BLKSIZE=0,LRECL=700,RECFM=FB)                                  
//SYSIN     DD  *                                                               
   SORT FIELDS=(180,8,A),FORMAT=CH                                              
   INCLUDE COND=(602,2,CH,EQ,C'85')                                             
//*-------------------------------------------------------------------*         
//* UPDATE FLAT-TYPE IN BP13FD38 FOR REPORT IN BP13CC28                         
//*-------------------------------------------------------------------*         
//STEP25 EXEC PGM=BP13CC69,COND=(0,NE)                                          
//BM06F120 DD DSN=&&BM06F120,DISP=(OLD,PASS)                                    
//BP13FD38 DD DSN=&&FD38NEW,DISP=(OLD,PASS)                                     
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*-------------------------------------------------------------------*         
//* SORT BP13FD38 IN REGN/DTE-DUE                                               
//*-------------------------------------------------------------------*         
//STEP26   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&FD38NEW,DISP=(OLD,PASS)                                     
//SORTOUT  DD DSN=&&FD38DUE,DISP=(,PASS),                                       
//          UNIT=SYSDA,SPACE=(CYL,(20,5),RLSE),                                 
//          DCB=(BLKSIZE=0,LRECL=400,RECFM=FB)                                  
//SYSIN     DD  *                                                               
   SORT FIELDS=(323,2,A,1,8,A,24,8,A),FORMAT=CH                                 
//*-------------------------------------------------------------------*         
//* MONTHLY REPORT ON NEW AND ADDITIONAL LOAN GRANTED                           
//* & INTEREST RAISED FOR BOTH CASES.                                           
//*-------------------------------------------------------------------*         
//STEP27   EXEC PGM=BP13CC28,COND=(0,NE)                                        
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//BP13FD38 DD DSN=&&FD38DUE,DISP=(OLD,PASS)                                     
//BP13KD00 DD DSN=BP13.KD00.DBSMAST,DISP=SHR                                    
//BP13KD03 DD DSN=BP13.KD03.DBSHIST,DISP=SHR                                    
//BP13L28A DD DSN=&&P13LC28A,DISP=(,PASS),                                      
//         UNIT=SYSDA,                                                          
//         SPACE=(CYL,(20,10),RLSE),                                            
//         DCB=(RECFM=FA,LRECL=133,BLKSIZE=133)                                 
//BP13L28B DD DSN=&&P13LC28B,DISP=(,PASS),                                      
//         UNIT=SYSDA,                                                          
//         SPACE=(CYL,(20,10),RLSE),                                            
//         DCB=(RECFM=FA,LRECL=133,BLKSIZE=133)                                 
//BP13L28C DD DSN=&&P13LC28C,DISP=(,PASS),                                      
//         UNIT=SYSDA,                                                          
//         SPACE=(CYL,(20,10),RLSE),                                            
//         DCB=(RECFM=FA,LRECL=133,BLKSIZE=133)                                 
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*-------------------------------------------------------------------*         
//* REPORT ON NEW LOAN/ADDTIONAL LOAN TO MA&B                                   
//*-------------------------------------------------------------------*         
//STEP28   EXEC PGM=IEBGENER,COND=(0,NE)                                        
//SYSUT1   DD DSN=&&P13LC28A,DISP=(OLD,PASS)                                    
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.PRT03.FORMID),DEST=IOM2                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*-------------------------------------------------------------------*         
//* REPORT ON NEW LOAN/ADDTIONAL LOAN TO FINANCE DEPT                           
//*-------------------------------------------------------------------*         
//STEP29   EXEC PGM=IEBGENER,COND=(0,NE)                                        
//SYSUT1   DD DSN=&&P13LC28A,DISP=(OLD,PASS)                                    
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.PRT02.FORMID),DEST=IOM2                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
/*                                                                              
//*-------------------------------------------------------------------*         
//* REPORT ON EXISTING LOAN TO MA&B                                             
//*-------------------------------------------------------------------*         
//STEP30   EXEC PGM=IEBGENER,COND=(0,NE)                                        
//SYSUT1   DD DSN=&&P13LC28B,DISP=(OLD,PASS)                                    
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.PRT03.FORMID),DEST=IOM2                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*-------------------------------------------------------------------*         
//* REPORT ON EXISTING LOAN TO FINANCE DEPT                                     
//*-------------------------------------------------------------------*         
//STEP31   EXEC PGM=IEBGENER,COND=(0,NE)                                        
//SYSUT1   DD DSN=&&P13LC28B,DISP=(OLD,PASS)                                    
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.PRT02.FORMID),DEST=IOM2                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
/*                                                                              
//*-------------------------------------------------------------------*         
//* REPORT ON SUMMARY NEW LOAN TO MA&B                                          
//*-------------------------------------------------------------------*         
//STEP32   EXEC PGM=IEBGENER,COND=(0,NE)                                        
//SYSUT1   DD DSN=&&P13LC28C,DISP=(OLD,PASS)                                    
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.PRT03.FORMID),DEST=IOM2                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*-------------------------------------------------------------------*         
//* REPORT ON SUMMARY NEW LOAN TO FINANCE DEPT                                  
//*-------------------------------------------------------------------*         
//STEP33   EXEC PGM=IEBGENER,COND=(0,NE)                                        
//SYSUT1   DD DSN=&&P13LC28C,DISP=(OLD,PASS)                                    
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.PRT02.FORMID),DEST=IOM2                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
/*                                                                              
//*-------------------------------------------------------------------*         
//* SORT BP13FD38 IN REGN/DTE-DUE (NON-CONCESSIONARY LOAN)                      
//* REPEAT STEP 23 TO STEP33 FOR NON-CONCESSIONARY LOAN REPORT LC28             
//*-------------------------------------------------------------------*         
//STEP23A  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.KD38.PPTRANS,DISP=SHR                                    
//SORTOUT  DD DSN=&&FD38NONP,DISP=(,PASS),                                      
//          UNIT=SYSDA,SPACE=(CYL,(20,5),RLSE),                                 
//          DCB=(BLKSIZE=0,LRECL=400,RECFM=FB)                                  
//SYSIN     DD  *                                                               
   SORT FIELDS=(1,8,A,24,8,A),FORMAT=CH                                         
   INCLUDE COND=(9,3,CH,EQ,C'DUE',AND,325,1,CH,NE,C'P',AND,                     
               327,1,CH,EQ,C'Y')                                                
//*-------------------------------------------------------------------*         
//* UDPATE FLAT-TYPE IN BP13FD38 FOR REPORT IN BP13CC28                         
//*-------------------------------------------------------------------*         
//STEP25A EXEC PGM=BP13CC69,COND=(0,NE)                                         
//BM06F120 DD DSN=&&BM06F120,DISP=(OLD,PASS)                                    
//BP13FD38 DD DSN=&&FD38NONP,DISP=(OLD,PASS)                                    
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*-------------------------------------------------------------------*         
//* SORT BP13FD38 IN REGN/DTE-DUE                                               
//*-------------------------------------------------------------------*         
//STEP26A  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&FD38NONP,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&FD38NDUE,DISP=(,PASS),                                      
//          UNIT=SYSDA,SPACE=(CYL,(20,5),RLSE),                                 
//          DCB=(BLKSIZE=0,LRECL=400,RECFM=FB)                                  
//SYSIN     DD  *                                                               
   SORT FIELDS=(323,2,A,1,8,A,24,8,A),FORMAT=CH                                 
//*-------------------------------------------------------------------*         
//* MONTHLY REPORT ON NEW AND ADDITIONAL LOAN GRANTED                           
//* & INTEREST RAISED FOR BOTH CASES.                                           
//*-------------------------------------------------------------------*         
//STEP27A  EXEC PGM=BP13CC28,COND=(0,NE)                                        
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//BP13FD38 DD DSN=&&FD38NDUE,DISP=(OLD,PASS)                                    
//BP13KD00 DD DSN=BP13.KD00.DBSMAST,DISP=SHR                                    
//BP13KD03 DD DSN=BP13.KD03.DBSHIST,DISP=SHR                                    
//BP13L28A DD DSN=&&P13NC28A,DISP=(,PASS),                                      
//         UNIT=SYSDA,                                                          
//         SPACE=(CYL,(20,10),RLSE),                                            
//         DCB=(RECFM=FA,LRECL=133,BLKSIZE=133)                                 
//BP13L28B DD DSN=&&P13NC28B,DISP=(,PASS),                                      
//         UNIT=SYSDA,                                                          
//         SPACE=(CYL,(20,10),RLSE),                                            
//         DCB=(RECFM=FA,LRECL=133,BLKSIZE=133)                                 
//BP13L28C DD DSN=&&P13NC28C,DISP=(,PASS),                                      
//         UNIT=SYSDA,                                                          
//         SPACE=(CYL,(20,10),RLSE),                                            
//         DCB=(RECFM=FA,LRECL=133,BLKSIZE=133)                                 
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*-------------------------------------------------------------------*         
//* REPORT ON NEW LOAN/ADDTIONAL LOAN TO MA&B                                   
//*-------------------------------------------------------------------*         
//STEP28A  EXEC PGM=IEBGENER,COND=(0,NE)                                        
//SYSUT1   DD DSN=&&P13NC28A,DISP=(OLD,PASS)                                    
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.PRT03.FORMID),DEST=IOM2                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*-------------------------------------------------------------------*         
//* REPORT ON NEW LOAN/ADDTIONAL LOAN TO FINANCE DEPT                           
//*-------------------------------------------------------------------*         
//STEP29A  EXEC PGM=IEBGENER,COND=(0,NE)                                        
//SYSUT1   DD DSN=&&P13NC28A,DISP=(OLD,PASS)                                    
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.PRT02.FORMID),DEST=IOM2                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
/*                                                                              
//*-------------------------------------------------------------------*         
//* REPORT ON EXISTING LOAN TO MA&B                                             
//*-------------------------------------------------------------------*         
//STEP30A  EXEC PGM=IEBGENER,COND=(0,NE)                                        
//SYSUT1   DD DSN=&&P13NC28B,DISP=(OLD,PASS)                                    
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.PRT03.FORMID),DEST=IOM2                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*-------------------------------------------------------------------*         
//* REPORT ON EXISTING LOAN TO FINANCE DEPT                                     
//*-------------------------------------------------------------------*         
//STEP31A  EXEC PGM=IEBGENER,COND=(0,NE)                                        
//SYSUT1   DD DSN=&&P13NC28B,DISP=(OLD,PASS)                                    
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.PRT02.FORMID),DEST=IOM2                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
/*                                                                              
//*-------------------------------------------------------------------*         
//* REPORT ON SUMMARY NEW LOAN TO MA&B                                          
//*-------------------------------------------------------------------*         
//STEP32A  EXEC PGM=IEBGENER,COND=(0,NE)                                        
//SYSUT1   DD DSN=&&P13NC28C,DISP=(OLD,PASS)                                    
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.PRT03.FORMID),DEST=IOM2                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*-------------------------------------------------------------------*         
//* REPORT ON SUMMARY NEW LOAN TO FINANCE DEPT                                  
//*-------------------------------------------------------------------*         
//STEP33A  EXEC PGM=IEBGENER,COND=(0,NE)                                        
//SYSUT1   DD DSN=&&P13NC28C,DISP=(OLD,PASS)                                    
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.PRT02.FORMID),DEST=IOM2                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
/*                                                                              
//*-------------------------------------------------------------------*         
//* SORT BP13F136 MONTH TRANSACTION                                   *         
//*-------------------------------------------------------------------*         
//STEP34   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F136.MTHTRAN.DBSS,DISP=SHR                               
//SORTOUT  DD DSN=&&F136FIN,DISP=(,PASS),                                       
//          UNIT=SYSDA,SPACE=(CYL,(20,5),RLSE),                                 
//          DCB=(BLKSIZE=23400,LRECL=150,RECFM=FB)                              
//SYSIN     DD  *                                                               
   SORT FIELDS=(5,8,A),FORMAT=CH                                                
   INCLUDE COND=(99,3,CH,EQ,C'PP ',OR,                                          
                 99,3,CH,EQ,C'INS',OR,                                          
                 99,3,CH,EQ,C'OPT')                                             
//*-------------------------------------------------------------------*         
//* PRINT REPORT ON VOUCHER/ADJUSTMENT                                          
//*-------------------------------------------------------------------*         
//STEP35   EXEC  SAS,COND=(0,NE)                                                
//BP13LC15 DD DSN=&&BP13LC15,DISP=(,PASS),                                      
//         UNIT=SYSDA,                                                          
//         SPACE=(CYL,(20,10),RLSE),                                            
//         DCB=(RECFM=FA,LRECL=133,BLKSIZE=133)                                 
//BP13F136 DD DSN=&&F136FIN,DISP=(OLD,PASS)                                     
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13SC15),DISP=SHR                             
//*                                                                             
//*-------------------------------------------------------------------*         
//* PRINT REPORT 0N VOUCHER/ADJUSTMENT TO FINANCE DEPT                          
//*-------------------------------------------------------------------*         
//STEP36   EXEC PGM=IEBGENER,COND=(0,NE)                                        
//SYSUT1   DD DSN=&&BP13LC15,DISP=(OLD,PASS)                                    
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.PRT02.FORMID),DEST=IOM2                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
/*                                                                              
//*-------------------------------------------------------------------*         
//* PRINT REPORT 0N VOUCHER/ADJUSTMENT TO MA&B DEPT                             
//*-------------------------------------------------------------------*         
//STEP37   EXEC PGM=IEBGENER,COND=(0,NE)                                        
//SYSUT1   DD DSN=&&BP13LC15,DISP=(OLD,PASS)                                    
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
/*                                                                              
//*-------------------------------------------------------------------*         
//* SORT BY REGN-N0/DTE-POST/HISTORY COUNT                                      
//* (CONCESSIONARY)                                                             
//*-------------------------------------------------------------------*         
//STEP38   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F136.MTHTRAN.DBSS,DISP=SHR                               
//SORTOUT  DD DSN=&&F136CON,DISP=(,PASS,DELETE),                                
//          UNIT=SYSDA,SPACE=(CYL,(20,5),RLSE),                                 
//          DCB=(BLKSIZE=23400,LRECL=150,RECFM=FB)                              
//SYSIN     DD  *                                                               
   SORT FIELDS=(5,8,A,13,11,A,1,2,A),FORMAT=CH                                  
   INCLUDE COND=((24,1,CH,EQ,C'P'),AND,                                         
           (99,3,CH,EQ,C'INS',OR,                                               
            99,3,CH,EQ,C'LS ',OR,                                               
            99,3,CH,EQ,C'IT ',OR,                                               
            99,3,CH,EQ,C'LON',OR,                                               
            99,3,CH,EQ,C'JVI',OR,                                               
            99,3,CH,EQ,C'JVL'))                                                 
//*-------------------------------------------------------------------*         
//* SORT BY REGN-N0/DTE-POST/HISTORY COUNT                                      
//* (NON-CONCESSIONARY)                                                         
//*-------------------------------------------------------------------*         
//STEP38A  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F136.MTHTRAN.DBSS,DISP=SHR                               
//SORTOUT  DD DSN=&&F136NCON,DISP=(,PASS,DELETE),                               
//          UNIT=SYSDA,SPACE=(CYL,(20,5),RLSE),                                 
//          DCB=(BLKSIZE=23400,LRECL=150,RECFM=FB)                              
//SYSIN     DD  *                                                               
   SORT FIELDS=(5,8,A,13,11,A,1,2,A),FORMAT=CH                                  
   INCLUDE COND=((24,1,CH,NE,C'P'),AND,                                         
           (99,3,CH,EQ,C'INS',OR,                                               
            99,3,CH,EQ,C'LS ',OR,                                               
            99,3,CH,EQ,C'IT ',OR,                                               
            99,3,CH,EQ,C'LON',OR,                                               
            99,3,CH,EQ,C'JVI',OR,                                               
            99,3,CH,EQ,C'JVL'))                                                 
//*-------------------------------------------------------------------*         
//* PRINT REPORT ON MONTHLY BALANCING STATEMENT FOR LOAN                        
//* (CONCESSIONARY)                                                             
//*-------------------------------------------------------------------*         
//STEP39   EXEC PGM=BP13CC22,COND=(0,NE)                                        
//BP13F136 DD DSN=&&F136CON,DISP=(OLD,PASS)                                     
//BP13KD69 DD DSN=BP13.KD69.OPENSUM,DISP=SHR                                    
//BP13KD60 DD DSN=BP13.KD60.ACCHIST,DISP=SHR                                    
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//BP13LC22 DD DSN=&&P13LC22A,DISP=(,PASS),                                      
//         UNIT=SYSDA,                                                          
//         SPACE=(CYL,(20,10),RLSE),                                            
//         DCB=(RECFM=FA,LRECL=133,BLKSIZE=133)                                 
//BP13LC2A DD SYSOUT=2,OUTPUT=(*.PRT03.FORMID),DEST=IOM2                        
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*-------------------------------------------------------------------*         
//* PRINT REPORT ON MONTHLY BALANCING STATEMENT FOR LOAN                        
//* (NON-CONCESSIONARY)                                                         
//*-------------------------------------------------------------------*         
//STEP39A  EXEC PGM=BP13CC22,COND=(0,NE)                                        
//BP13F136 DD DSN=&&F136NCON,DISP=(OLD,PASS)                                    
//BP13KD69 DD DSN=BP13.KD69.OPENSUM,DISP=SHR                                    
//BP13KD60 DD DSN=BP13.KD60.ACCHIST,DISP=SHR                                    
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//BP13LC22 DD DSN=&&P13LC22B,DISP=(,PASS),                                      
//         UNIT=SYSDA,                                                          
//         SPACE=(CYL,(20,10),RLSE),                                            
//         DCB=(RECFM=FA,LRECL=133,BLKSIZE=133)                                 
//BP13LC2A DD SYSOUT=2,OUTPUT=(*.PRT03.FORMID),DEST=IOM2                        
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*-------------------------------------------------------------------*         
//* PRINT REPORT 0N CASH RECEIPT FOR THE MONTH TO FIN DEPT            *         
//* (CONCESSIONARY)                                                             
//*-------------------------------------------------------------------*         
//STEP41   EXEC PGM=IEBGENER,COND=(0,NE)                                        
//SYSUT1   DD DSN=&&P13LC22A,DISP=(OLD,PASS)                                    
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.PRT02.FORMID),DEST=IOM2                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
/*                                                                              
//*-------------------------------------------------------------------*         
//* PRINT REPORT 0N CASH RECEIPT FOR THE MONTH TO FIN DEPT            *         
//* (NON-CONCESSIONARY)                                                         
//*-------------------------------------------------------------------*         
//STEP41A  EXEC PGM=IEBGENER,COND=(0,NE)                                        
//SYSUT1   DD DSN=&&P13LC22B,DISP=(OLD,PASS)                                    
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.PRT02.FORMID),DEST=IOM2                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
/*                                                                              
//*-------------------------------------------------------------------*         
//* PRINT REPORT 0N CASH RECEIPT FOR THE MONTH TO MA&B                *         
//* (CONCESSIONARY)                                                             
//*-------------------------------------------------------------------*         
//STEP41B  EXEC PGM=IEBGENER,COND=(0,NE)                                        
//SYSUT1   DD DSN=&&P13LC22A,DISP=(OLD,PASS)                                    
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.PRT03.FORMID),DEST=IOM2                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
/*                                                                              
//*-------------------------------------------------------------------*         
//* PRINT REPORT 0N CASH RECEIPT FOR THE MONTH TO MA&B                *         
//* (NON-CONCESSIONARY)                                                         
//*-------------------------------------------------------------------*         
//STEP41C  EXEC PGM=IEBGENER,COND=(0,NE)                                        
//SYSUT1   DD DSN=&&P13LC22B,DISP=(OLD,PASS)                                    
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.PRT03.FORMID),DEST=IOM2                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
/*                                                                              
//*-------------------------------------------------------------------*         
//* SORT BY REGN-N0/DTE-POST/HISTORY COUNT                                      
//*-------------------------------------------------------------------*         
//STEP42   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F136.MTHTRAN.DBSS,DISP=SHR                               
//SORTOUT  DD DSN=&&F136ALL,DISP=(,PASS),                                       
//          UNIT=SYSDA,SPACE=(CYL,(20,5),RLSE),                                 
//          DCB=(BLKSIZE=23400,LRECL=150,RECFM=FB)                              
//SYSIN     DD  *                                                               
   SORT FIELDS=(5,8,A,13,11,A,1,2,A),FORMAT=CH                                  
   INCLUDE COND=((1,2,CH,EQ,C'11',AND,99,3,CH,EQ,C'INS'),OR,                    
                 (1,2,CH,EQ,C'11',AND,99,3,CH,EQ,C'LS '),OR,                    
                 (1,2,CH,EQ,C'12',AND,99,3,CH,EQ,C'INS'),OR,                    
                 (1,2,CH,EQ,C'12',AND,99,3,CH,EQ,C'LS '),OR,                    
                 (1,2,CH,EQ,C'13',AND,99,3,CH,EQ,C'INS'),OR,                    
                 (1,2,CH,EQ,C'14',AND,99,3,CH,EQ,C'INS'),OR,                    
                 (1,2,CH,EQ,C'15',AND,99,3,CH,EQ,C'INS'),OR,                    
                 (1,2,CH,EQ,C'16',AND,99,3,CH,EQ,C'INS'),OR,                    
                 (1,2,CH,EQ,C'62',AND,99,3,CH,EQ,C'IT '),OR,                    
                 (1,2,CH,EQ,C'64',AND,99,3,CH,EQ,C'INS'),OR,                    
                 (1,2,CH,EQ,C'64',AND,99,3,CH,EQ,C'LS '),OR,                    
                 (1,2,CH,EQ,C'66',AND,99,3,CH,EQ,C'LON'),OR,                    
                 (1,2,CH,EQ,C'67',AND,99,3,CH,EQ,C'IT '),OR,                    
                 (1,2,CH,EQ,C'68',AND,99,3,CH,EQ,C'IT '),OR,                    
                 (1,2,CH,EQ,C'69',AND,99,3,CH,EQ,C'JVL'),OR,                    
                 (1,2,CH,EQ,C'69',AND,99,3,CH,EQ,C'JVP'),OR,                    
                 (1,2,CH,EQ,C'69',AND,99,3,CH,EQ,C'JVI'),OR,                    
                 (1,2,CH,EQ,C'70',AND,99,3,CH,EQ,C'INS'))                       
//*-------------------------------------------------------------------*         
//* SORT BY REGN-N0                                                             
//*-------------------------------------------------------------------*         
//STEP40   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.KD60.ACCHIST,DISP=SHR                                    
//SORTOUT  DD DSN=&&BP13FD60,DISP=(,PASS),                                      
//          UNIT=SYSDA,SPACE=(CYL,(50,10),RLSE),                                
//          DCB=(BLKSIZE=0,LRECL=250,RECFM=FB)                                  
//SYSIN     DD  *                                                               
   SORT FIELDS=(1,8,A),FORMAT=CH                                                
   INCLUDE COND=(1,8,CH,NE,C'        ')                                         
//*-------------------------------------------------------------------*         
//* IF NO TRANSACTION IN THE MONTH, OUTPUT A DUMMY TRNX FOR CC23                
//*-------------------------------------------------------------------*         
//STEP41   EXEC PGM=BP13CM23,COND=(0,NE)                                        
//BP13FD60 DD DSN=&&BP13FD60,DISP=(OLD,PASS)                                    
//BP13F136 DD DSN=&&F136ALL,DISP=(OLD,PASS)                                     
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//BP13FOUT DD DSN=&&F136CC23,DISP=(,PASS),                                      
//          UNIT=SYSDA,SPACE=(CYL,(20,10),RLSE),                                
//          DCB=(BLKSIZE=0,LRECL=150,RECFM=FB)                                  
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*-------------------------------------------------------------------*         
//* PRINT REPORT ON DETAIL TRANSACTION POSTING FOR LOAN                         
//*-------------------------------------------------------------------*         
//STEP42   EXEC PGM=BP13CC23,COND=(0,NE)                                        
//BP13F136 DD DSN=&&F136CC23,DISP=(OLD,PASS)                                    
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//BP13KD61 DD DSN=BP13.KD61.ACCHIST,DISP=SHR                                    
//BP13LC23 DD SYSOUT=2,OUTPUT=(*.PRT03.FORMID),DEST=IOM2                        
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*-------------------------------------------------------------------*         
//* SORT BP13KD00 AND INCLUDE WITH LOAN COMMENCEMENT DATE             *         
//*-------------------------------------------------------------------*         
//STEP43   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.KD00.DBSMAST,DISP=SHR,                                   
//            AMP=('BUFND=23')                                                  
//SORTOUT  DD DSN=&&BP13FD00,                                                   
//            DISP=(NEW,PASS),                                                  
//            UNIT=SYSDA,                                                       
//            SPACE=(CYL,(20,5),RLSE),                                          
//            DCB=(RECFM=FB,LRECL=1600,BLKSIZE=0)                               
//SYSIN    DD *                                                                 
      SORT FIELDS=(1,8,CH,A),FORMAT=CH                                          
      INCLUDE COND=(312,8,CH,GT,C'        ')                                    
//*-------------------------------------------------------------------*         
//* PRINT REPORT ON LOAN GRANTED TO  HOUSING FINANCE                  *         
//*-------------------------------------------------------------------*         
//STEP44   EXEC  SAS,COND=(0,NE)                                                
//WORK     DD UNIT=SYSDA,SPACE=(CYL,(60,20))                                    
//BP13FD00 DD DSN=&&BP13FD00,DISP=(OLD,PASS)                                    
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//BP13LC20 DD SYSOUT=2,OUTPUT=(*.PRT04.FORMID),DEST=IOM2                        
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13SC20),DISP=SHR                             
//*                                                                             
//*-----------------------------------------------------------------            
//* INCLUDE DBSS-TOP=Y, DBSS REC PASSED TO SMS                                  
//*-----------------------------------------------------------------            
//STEP45   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F136.MTHTRAN.DBSS,DISP=SHR                               
//SORTOUT  DD DSN=&&F136SMS,DISP=(,PASS),                                       
//        UNIT=SYSDA,DCB=(RECFM=FB,LRECL=150),                                  
//        SPACE=(CYL,(20,10),RLSE)                                              
//SYSIN    DD  *                                                                
  SORT FIELDS=(5,8,A),FORMAT=CH                                                 
  INCLUDE COND=(114,1,CH,EQ,C'Y',AND,                                           
                99,3,CH,EQ,C'INS',AND,                                          
                1,2,CH,EQ,C'63')                                                
//*---------------------------------------------------------------------        
//* MATCH BM06F120 TO GET FLAT TYPE                                             
//*---------------------------------------------------------------------        
//STEP46    EXEC PGM=BP13CCAB,COND=(0,NE)                                       
//BP13F136  DD DSN=&&F136SMS,DISP=(OLD,PASS)                                    
//BM06F120  DD DSN=&&BM06F120,DISP=(OLD,PASS)                                   
//P13F136A  DD DSN=&&F136FT,DISP=(,PASS),                                       
//          UNIT=SYSDA,DCB=(RECFM=FB,LRECL=150),                                
//          SPACE=(CYL,(20,10),RLSE)                                            
//SYSPRINT  DD SYSOUT=*                                                         
//SYSDBG    DD SYSOUT=*                                                         
//SYSDBOUT  DD SYSOUT=*                                                         
//SYSOUT    DD SYSOUT=*                                                         
//*                                                                             
//*---------------------------------------------------------------------        
//* SORT BY FT/REN-NO                                                           
//*---------------------------------------------------------------------        
//STEP47   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F136FT,DISP=(OLD,PASS)                                      
//SORTOUT  DD DSN=&&F136FLAT,DISP=(,PASS),                                      
//        UNIT=SYSDA,DCB=(RECFM=FB,LRECL=150),                                  
//        SPACE=(CYL,(20,10),RLSE)                                              
//SYSIN    DD  *                                                                
  SORT FIELDS=(118,2,A,5,8,A),FORMAT=CH                                         
//*---------------------------------------------------------------------        
//* PRINT REPORT ON VOUCHER USING SMS LOAN ACCOUNT                              
//*---------------------------------------------------------------------        
//STEP48    EXEC PGM=BP13CCAC,COND=(0,NE)                                       
//BP13F136  DD DSN=&&F136FLAT,DISP=(OLD,PASS)                                   
//SY02F001  DD DSN=SY02.F001.DATE,DISP=SHR                                      
//BP13LCAC DD DSN=&&BP13LCAC,DISP=(,PASS),                                      
//         UNIT=SYSDA,                                                          
//         SPACE=(CYL,(20,10),RLSE),                                            
//         DCB=(RECFM=FA,LRECL=133,BLKSIZE=133)                                 
//SYSPRINT  DD SYSOUT=*                                                         
//SYSDBG    DD SYSOUT=*                                                         
//SYSDBOUT  DD SYSOUT=*                                                         
//SYSOUT    DD SYSOUT=*                                                         
//*                                                                             
//*-------------------------------------------------------------------*         
//* PRINT REPORT ON VOUCHER USING SMS LOAN ACCOUNT TO MA&B                      
//*-------------------------------------------------------------------*         
//STEP49   EXEC PGM=IEBGENER,COND=(0,NE)                                        
//SYSUT1   DD DSN=&&BP13LCAC,DISP=(OLD,PASS)                                    
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*-------------------------------------------------------------------*         
//* PRINT REPORT ON VOUCHER USING SMS LOAN ACCOUNT TO FIN DEPT                  
//*-------------------------------------------------------------------*         
//STEP50   EXEC PGM=IEBGENER,COND=(0,NE)                                        
//SYSUT1   DD DSN=&&BP13LCAC,DISP=(OLD,PASS)                                    
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.PRT02.FORMID),DEST=IOM2                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*-------------------------------------------------------------------*         
//* SORT BP13FD38 IN REGN/DTE-DUE ORDER                                         
//*-------------------------------------------------------------------*         
//STEP51   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.KD38.PPTRANS,DISP=SHR                                    
//SORTOUT  DD DSN=&&BP13FD38,DISP=(NEW,PASS),                                   
//          UNIT=SYSDA,SPACE=(CYL,(20,5),RLSE),                                 
//          DCB=(BLKSIZE=0,LRECL=400,RECFM=FB)                                  
//SYSIN     DD  *                                                               
   SORT FIELDS=(1,8,A,24,8,A),FORMAT=CH                                         
//*-------------------------------------------------------------------*         
//* SORT BP13KD39(KD38 HISTORY) IN REGN/DTE-DUE ORDER                           
//*-------------------------------------------------------------------*         
//STEP52   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.KD39.PPTRANS.HISTORY,DISP=SHR,                           
//         AMP=('BUFND=4','BUFNI=8')                                            
//SORTOUT  DD DSN=&&BP13FD38,DISP=(MOD,PASS),                                   
//          UNIT=SYSDA,SPACE=(CYL,(30,5),RLSE),                                 
//          DCB=(BLKSIZE=0,LRECL=400,RECFM=FB)                                  
//SYSIN     DD  *                                                               
   SORT FIELDS=(1,8,A,24,8,A),FORMAT=CH                                         
   OUTREC FIELDS=(1,400)                                                        
//*-------------------------------------------------------------------*         
//* SORT BY REGN_NO                                                             
//*-------------------------------------------------------------------*         
//STEP53   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&BP13FD38,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&P13FD38A,DISP=(NEW,PASS),                                   
//         UNIT=SYSDA,DCB=(RECFM=FB,LRECL=400),                                 
//         SPACE=(CYL,(20,5),RLSE)                                              
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,8,A),FORMAT=CH                                                
//*-------------------------------------------------------------------*         
//* SORT DBSS HISTORY FILE BY REGN-NO                                           
//*-------------------------------------------------------------------*         
//STEP55   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.KD03.DBSHIST,DISP=SHR,                                   
//         AMP=('BUFND=4','BUFNI=8')                                            
//SORTOUT  DD DSN=&&BP13FD03,DISP=(,PASS),                                      
//         UNIT=SYSDA,DCB=(RECFM=FB,LRECL=1600),                                
//         SPACE=(CYL,(40,10),RLSE)                                             
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,8,A),FORMAT=CH                                                
   INCLUDE COND=(312,8,CH,GT,C'        ')                                       
//*-------------------------------------------------------------------*         
//* SORT REGN-NO                                                                
//*-------------------------------------------------------------------*         
//STEP56   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&BP13FD00,DISP=(OLD,PASS)                                    
//         DD DSN=&&BP13FD03,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&P13FD00A,DISP=(NEW,PASS),                                   
//         UNIT=SYSDA,DCB=(RECFM=FB,LRECL=1600),                                
//         SPACE=(CYL,(30,10),RLSE)                                             
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,8,A),FORMAT=CH                                                
   SUM FIELDS=NONE                                                              
//*-------------------------------------------------------------------*         
//* COMPUTE ADDTIONAL AND NEW LOAN REPORTFOR FOR FIN-YEAR                       
//*-------------------------------------------------------------------*         
//STEP57   EXEC PGM=BP13CC35,COND=(0,NE)                                        
//BP13FD38 DD DSN=&&P13FD38A,DISP=(OLD,PASS)                                    
//BP13FD00 DD DSN=&&P13FD00A,DISP=(OLD,PASS)                                    
//BP13KA10 DD DSN=BP13.KA10.PRJCT,DISP=SHR                                      
//P13FD38A DD DSN=&&FD38LOAN,DISP=(,PASS),                                      
//         UNIT=SYSDA,DCB=(RECFM=FB,LRECL=400),                                 
//         SPACE=(CYL,(20,5),RLSE)                                              
//SYSOUT   DD SYSOUT=*                                                          
//*-----------------------------------------------------------------            
//* SORT BY PROJECT NAME & REGN                                                 
//*-----------------------------------------------------------------            
//STEP58   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&FD38LOAN,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&FD38CC3A,DISP=(,PASS),                                      
//        UNIT=SYSDA,DCB=(RECFM=FB,LRECL=400),                                  
//        SPACE=(CYL,(20,10),RLSE)                                              
//SYSIN    DD  *                                                                
  SORT FIELDS=(329,30,A,24,8,A),FORMAT=CH                                       
//*---------------------------------------------------------------------        
//* REPORT ON ADDITIONAL LOAN/NEW LOAN BY PROJECT                               
//*---------------------------------------------------------------------        
//STEP59    EXEC PGM=BP13CC3A,COND=(0,NE)                                       
//BP13FD38  DD DSN=&&FD38CC3A,DISP=(OLD,PASS)                                   
//SY02F001  DD DSN=SY02.F001.DATE,DISP=SHR                                      
//BP13LC3A  DD DSN=&&BP13LC3A,DISP=(,PASS),                                     
//          UNIT=SYSDA,                                                         
//          SPACE=(CYL,(20,10),RLSE),                                           
//          DCB=(RECFM=FA,LRECL=133,BLKSIZE=0)                                  
//SYSPRINT  DD SYSOUT=*                                                         
//SYSOUT    DD SYSOUT=*                                                         
//*-------------------------------------------------------------------*         
//* PRINT REPORT TO MA&B                                                        
//*-------------------------------------------------------------------*         
//STEP60   EXEC PGM=IEBGENER,COND=(0,NE)                                        
//SYSUT1   DD DSN=&&BP13LC3A,DISP=(OLD,PASS)                                    
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*-------------------------------------------------------------------*         
//* PRINT REPORT FOR HAD FIN DEPT                                               
//*-------------------------------------------------------------------*         
//STEP61   EXEC PGM=IEBGENER,COND=(0,NE)                                        
//SYSUT1   DD DSN=&&BP13LC3A,DISP=(OLD,PASS)                                    
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.PRT04.FORMID),DEST=IOM2                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
/*                                                                              
//*-----------------------------------------------------------------            
//* INCLUDE LOAN-SCH=A,M                                                        
//* NON-CONCESSIONARY ACCTS                                                     
//*-----------------------------------------------------------------            
//STEP62   EXEC  SORT,COND=(0,NE)                                               
//SORTIN   DD DSN=BP13.KD00.DBSMAST,DISP=SHR,                                   
//         AMP=('BUFND=4','BUFNI=8')                                            
//SORTOUT  DD DSN=&&FD00SCHA,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,                                                       
//            SPACE=(CYL,(100,50),RLSE),                                        
//            DCB=(BLKSIZE=0,LRECL=1600,RECFM=FB)                               
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,8,A),FORMAT=CH                                                
   INCLUDE COND=(361,1,CH,EQ,C'A',OR,                                           
                 361,1,CH,EQ,C'M')                                              
//*-----------------------------------------------------------------            
//* TO PRINT MONTHLY REPORT ON BREAKDOWN OF MORTGAGE                            
//* LOAN GIVEN TO PERMANENT RESIDENTS AND OWNERS OF                             
//* PRIVATE RESIDENTIAL PROPERTIES.                                             
//*-----------------------------------------------------------------            
//STEP63   EXEC PGM=BP13CY75,COND=(0,NE)                                        
//BP13FD00 DD DSN=&&FD00SCHA,DISP=(OLD,PASS)                                    
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//AB03K050 DD DSN=AB03.K050.INTTABLE,DISP=SHR                                   
//BP13LY75 DD SYSOUT=2,OUTPUT=(*.PRT02.FORMID),DEST=IOM2                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*-----------------------------------------------------------------            
//* SORT BP13KD15 BY PROJECT, BLK, UNIT-NO                                      
//*-----------------------------------------------------------------            
//STEP64   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.KD15.DBSSTP,DISP=SHR                                     
//SORTOUT  DD DSN=&&BP13FD15,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(100,50),RLSE),                             
//            DCB=(LRECL=300,RECFM=FB)                                          
//SYSIN    DD *                                                                 
     SORT FIELDS=(1,17,A),FORMAT=CH                                             
     INCLUDE COND=(90,8,CH,NE,C'        ')                                      
//*  INCLUDE COND=(90,8,CH,NE,C'        ',AND,                                  
//*               (1,3,CH,EQ,C'D03',OR,1,3,CH,EQ,C'D06'))                       
//*--------------------------------------------------------------------         
//* CHECK SMS ON BUYING FIRE INSURANCE AFTER TOP                                
//*--------------------------------------------------------------------         
//STEP65    EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K              
//BP13FD15 DD DSN=&&BP13FD15,DISP=(OLD,PASS)                                    
//AB03K030 DD DSN=AB03.K030.SALEMAST,DISP=SHR,                                  
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13KD00 DD DSN=BP13.KD00.DBSMAST,DISP=SHR,                                   
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13KD03 DD DSN=BP13.KD03.DBSHIST,DISP=SHR,                                   
//         AMP=('BUFND=4','BUFNI=8')                                            
//AB03K700 DD DSN=AB03.K700.CUSTFILE,DISP=SHR,                                  
//         AMP=('BUFND=4','BUFNI=8')                                            
//AB20K050 DD DSN=AB20.K050.PREMIUM,DISP=SHR                                    
//*BP13LB49 DD SYSOUT=2,OUTPUT=(*.PRT05.FORMID),DEST=IOM2                       
//*BP13PB49 DD SYSOUT=2,OUTPUT=(*.PRT06.FORMID),DEST=IOM2                       
//BP13LB49 DD DSN=BP13.LB49.BP13CB49,DISP=SHR                                   
//BP13PB49 DD DUMMY                                                             
//SUMMARY  DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
   DSN SYSTEM(DSN)                                                              
   RUN PROGRAM(BP13CB49) PLAN(BP13PCC) -                                        
       LIB('BP13.BATCH.LOADCOB')                                                
   END                                                                          
//*-------------------------------------------------------------------*         
//* SORT BP13FD00 IN SCHEME ACCOUNT NUMBER                                      
//* INCLUDE LOAN-SCH = P OR A                                                   
//*-------------------------------------------------------------------*         
//STEP66   EXEC  SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=BP13.KD00.DBSMAST,DISP=SHR,                                  
//         AMP=('BUFND=4','BUFNI=8')                                            
//SORTOUT  DD  DSN=&&FD00SCHT,DISP=(,PASS),                                     
//             UNIT=SYSDA,                                                      
//             SPACE=(CYL,(10,8),RLSE),                                         
//             DCB=(BLKSIZE=0,LRECL=1600,RECFM=FB)                              
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  *                                                                
   SORT FIELDS=(11,11,A),FORMAT=CH                                              
   INCLUDE COND=(361,1,CH,EQ,C'P',OR,361,1,CH,EQ,C'A')                          
//*-------------------------------------------------------------------*         
//*- GET MODEL DESIGN/FLAT TYPE                                                 
//*-------------------------------------------------------------------*         
//STEP67    EXEC PGM=BP13CC62,COND=(0,NE)                                       
//BP13FD00  DD DSN=&&FD00SCHT,DISP=(OLD,PASS)                                   
//AB03F089  DD DSN=AB03.F089.PIDB,DISP=SHR                                      
//BP13FD79  DD DSN=&&BP13FD79,DISP=(,PASS),                                     
//             UNIT=SYSDA,                                                      
//             SPACE=(CYL,(6,5),RLSE),                                          
//             DCB=(BLKSIZE=0,LRECL=100,RECFM=FB)                               
//SYSOUT    DD SYSOUT=*                                                         
//*-------------------------------------------------------------------*         
//* AGEING REPORT ON PRINCIPAL LOAN                                             
//*-------------------------------------------------------------------*         
//STEP68    EXEC PGM=BP13CC64,COND=(0,NE)                                       
//BP13FD79  DD DSN=&&BP13FD79,DISP=(OLD,PASS)                                   
//AB03K050  DD DSN=AB03.K050.INTTABLE,DISP=SHR                                  
//P13LC64A DD SYSOUT=2,OUTPUT=(*.PRT02.FORMID),DEST=IOM2                        
//P13LC64B DD SYSOUT=2,OUTPUT=(*.PRT02.FORMID),DEST=IOM2                        
//SYSOUT    DD SYSOUT=*                                                         
//*                                                                             
//*-------------------------------------------------------------------*         
//* AGEING REPORT ON INSTALMENT                                                 
//*-------------------------------------------------------------------*         
//STEP69    EXEC PGM=BP13CC63,COND=(0,NE)                                       
//BP13FD79  DD DSN=&&BP13FD79,DISP=(OLD,PASS)                                   
//P13LC63A DD SYSOUT=2,OUTPUT=(*.PRT02.FORMID),DEST=IOM2                        
//P13LC63B DD SYSOUT=2,OUTPUT=(*.PRT02.FORMID),DEST=IOM2                        
//P13LC63C DD SYSOUT=*                                                          
//P13LC63D  DD SYSOUT=*                                                         
//P13LC63E  DD SYSOUT=*                                                         
//P13LC63F  DD SYSOUT=*                                                         
//P13LC63G  DD SYSOUT=*                                                         
//P13LC63H DD SYSOUT=2,OUTPUT=(*.PRT02.FORMID),DEST=IOM2                        
//P13LC63I DD SYSOUT=2,OUTPUT=(*.PRT02.FORMID),DEST=IOM2                        
//P13LC63J DD SYSOUT=*                                                          
//P13LC63K  DD SYSOUT=*                                                         
//P13LC63L  DD SYSOUT=*                                                         
//P13LC63M  DD SYSOUT=*                                                         
//P13LC63N  DD SYSOUT=*                                                         
//SYSOUT    DD SYSOUT=*                                                         
//*                                                                             
//*-------------------------------------------------------------------*         
//* SAVE LC28A REPORTS TO A PERMANENT DATASET                                   
//*-------------------------------------------------------------------*         
//STEP69   EXEC  SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=&&P13LC28A,DISP=(OLD,PASS)                                   
//         DD  DSN=&&P13NC28A,DISP=(OLD,PASS)                                   
//SORTOUT  DD  DSN=BP13.LC28A.BP13CC28,DISP=OLD                                 
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  *                                                                
  SORT FIELDS=COPY                                                              
//*                                                                             
//*-------------------------------------------------------------------*         
//* SAVE LC28B REPORTS TO A PERMANENT DATASET                                   
//*-------------------------------------------------------------------*         
//STEP70   EXEC  SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=&&P13LC28B,DISP=(OLD,PASS)                                   
//         DD  DSN=&&P13NC28B,DISP=(OLD,PASS)                                   
//SORTOUT  DD  DSN=BP13.LC28B.BP13CC28,DISP=OLD                                 
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  *                                                                
  SORT FIELDS=COPY                                                              
//*                                                                             
//*-------------------------------------------------------------------*         
//* SAVE LC28B REPORTS TO A PERMANENT DATASET                                   
//*-------------------------------------------------------------------*         
//STEP71   EXEC  SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=&&P13LC28C,DISP=(OLD,PASS)                                   
//         DD  DSN=&&P13NC28C,DISP=(OLD,PASS)                                   
//SORTOUT  DD  DSN=BP13.LC28C.BP13CC28,DISP=OLD                                 
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  *                                                                
  SORT FIELDS=COPY                                                              
//*                                                                             
//*-------------------------------------------------------------------*         
//* SAVE LC15A REPORTS TO A PERMANENT DATASET                                   
//*-------------------------------------------------------------------*         
//STEP72   EXEC  SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=&&BP13LC15,DISP=(OLD,PASS)                                   
//SORTOUT  DD  DSN=BP13.LC15.BP13SC15,DISP=OLD                                  
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  *                                                                
  SORT FIELDS=COPY                                                              
//*                                                                             
//*****************************************************************             
//*         AUTO-GENERATE MAIL HEADER PART I                                    
//*         HELO SGPHDBX                                                        
//*         MAIL FROM:<XXXXXXXX@SGPHDBX>                                        
//*****************************************************************             
//STEP73   EXEC PGM=IRXJCL,PARM='SMTPHDR'                                       
//SYSTSPRT DD  SYSOUT=*                                                         
//SYSEXEC  DD  DSN=SYS3.SYSTEM.CLIST,DISP=SHR                                   
//SMTPHDR  DD DSN=&&P13MHDG,DISP=(NEW,PASS),                                    
//         SPACE=(TRK,(1,1)),DCB=(DSORG=PS,LRECL=137,RECFM=VB)                  
//SYSTSIN  DD  DUMMY                                                            
//*                                                                             
//*---------------------------------------------------------------------        
//STEP74   EXEC SAS,COND=(0,NE),OPTIONS='MACRO'                                 
//SYSOUT   DD SYSOUT=*                                                          
//MAILNAME DD DSN=&&MAILNAME,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(2,1),RLSE),                                
//            DCB=(RECFM=VB,LRECL=137)                                          
//MAILRCPT DD DSN=&&MAILRCPT,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(2,1),RLSE),                                
//            DCB=(RECFM=VB,LRECL=137)                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DATA _NULL_;                                                                  
    FILE MAILNAME;                                                              
    PUT @01 '           FILENAME="BP13LB49.TXT"';                               
    PUT @01 ' ';                                                                
  RUN;                                                                          
//         DD DSN=BP13.MAIL.BP13LB49,DISP=SHR                                   
//         DD *                                                                 
    PUT @01 'SUBJECT : DBSS LESSEES W/ OUTSTANDING HDB LOAN BUT YET TO BUY FI'; 
//*---------------------------------------------------------------------        
//STEP75   EXEC PGM=IEBGENER,COND=(0,NE)                                        
//SYSUT1   DD DSN=*.STEP73.SMTPHDR,DISP=(OLD,DELETE)                            
//         DD DSN=&&MAILRCPT,DISP=(OLD,DELETE)                                  
//         DD DSN=AV05.MIME.HEADERS.VB(MIMEHDR),DISP=SHR                        
//         DD DSN=AV05.MIME.HEADERS.VB(MPHDR),DISP=SHR                          
//         DD DSN=AV05.MIME.HEADERS.VB(BOUNDARY),DISP=SHR                       
//         DD DSN=AV05.MIME.HEADERS.VB(TEXTHDR),DISP=SHR                        
//         DD DSN=AV05.MIME.HEADERS.VB(ATCHHDR),DISP=SHR                        
//         DD DSN=&&MAILNAME,DISP=(OLD,DELETE)                                  
//         DD *                                                                 
//         DD DSN=BP13.LB49.BP13CB49,DISP=SHR                                   
//         DD DSN=AV05.MIME.HEADERS.VB(BOUNDARY),DISP=SHR                       
//SYSUT2   DD DSN=BP13.MAILRPT.BP13LB49,DISP=OLD                                
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*                                                                             
//*-------------------------------------------------------------------*         
//*  SEND MAINFRAME EMAIL                                             *         
//*  DETAILS OF THE TRANSACTION CASES (BCP USE)                       *         
//*-------------------------------------------------------------------*         
//*-------------------------------------------------------------------*         
//STEP76   EXEC SENDMAIL,COND=(4,LT)                                            
//INPUT    DD DSN=BP13.MAILRPT.BP13LB49,DISP=SHR                                
//*-------------------------------------------------------------------*         
//*          E N D      O F     J O B                                 *         
//*-------------------------------------------------------------------*         
