//BP13D530 JOB (BP13P),'BP13D530',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//         NOTIFY=CSD0071                                                       
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//*==================================================================           
//* 1. EXTRACT THE CASES FROM BP13KB78 ON AN HOURLY BASIS ON NEW AND            
//*    UPDATED DBSS REQUEST.                                                    
//* 2. THIS JOB WILL RUN AT 9.05AM TO 6.05PM, HOURLY                            
//* 3. BP13D532 WILL ZIP AND FTP THE FILE TO IDEAL SERVER                       
//* 4. THIS JOB WILL ONLY EXTRACT APPLICATION DATA.                             
//*==================================================================           
//* CHG REF  BY   ON       DESCRIPTION                                          
//* -------- ---- -------- -----------                                          
//* BP132886 CKK  010706   NEW JCL FOR FTP FILE TO SIM LIAN                     
//* BP133388 IL5  220708   UNCOMMENT STEP05 FOR PARK CENTRAL LAUNCH             
//* BP133427 IL5  151008   ADD BP13KA30 AS FILES BP13C02E                       
//* BP134109 IL5  030311   CHANGE CLASS FROM I TO S                             
//* BP134211 IL5  010611   CATER FOR APPLICATION PERIOD (D08)                   
//* BP134293 IL5  071011   CATER FOR APPLICATION PERIOD (D09)                   
//* BP134332 IL5  071011   CATER FOR APPLICATION PERIOD (D12)                   
//* BP134363 IL5  071011   CATER FOR APPLICATION PERIOD (D11)                   
//* BP134363 IL5  071011   CATER FOR APPLICATION PERIOD (D11)                   
//* BP134470 IL5  240412   CATER FOR APPLICATION PERIOD (D13)                   
//* BP134470 LJL  270412   TO ADD DATE OF LAUNCH FOR D13.                       
//*==================================================================           
//*-------------------------------------------------------------------*         
//* SORT BP13KB78 RECORD IN REGN NO ORDER *                                     
//*-------------------------------------------------------------------*         
//D530S001 EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.KB78.DBSREQ,DISP=SHR,                                    
//         AMP=('BUFND=4','BUFNI=8')                                            
//SORTOUT  DD DSN=&&BP13FB78,DISP=(NEW,PASS),                                   
//         UNIT=SYSDA,                                                          
//         DCB=(BLKSIZE=0,LRECL=3300,RECFM=FB),                                 
//         SPACE=(CYL,(80,30),RLSE)                                             
//SYSIN    DD *                                                                 
   SORT FIELDS=(6,8,A),FORMAT=CH                                                
   INCLUDE COND=(1,3,CH,EQ,C'D13',AND,3285,8,                                   
                 CH,GE,C'20120427')                                             
//*------------------------------------------------------------------           
//* SORT BP13FB78 NEW AND UPDATED RECORD IN REGN-NO ORDER                       
//*------------------------------------------------------------------           
//D530S02  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&BP13FB78,DISP=(OLD,DELETE)                                  
//SORTOUT  DD DSN=&&FB78ALL,DISP=(NEW,PASS),                                    
//         UNIT=SYSDA,                                                          
//         DCB=(BLKSIZE=0,LRECL=3300,RECFM=FB),                                 
//         SPACE=(CYL,(50,10),RLSE)                                             
//SYSIN    DD *                                                                 
   SORT FIELDS=(6,8,A),FORMAT=CH                                                
//*------------------------------------------------------------------           
//* READ NEW CASES, FORMAT RECORD FOR DEVELOPER FORMAT (BP13FB66)               
//*------------------------------------------------------------------           
//D530S03  EXEC PGM=BP13C02X,COND=(0,NE)                                        
//BP13FB78 DD DSN=&&FB78ALL,DISP=(OLD,DELETE)                                   
//BP13FB66 DD DSN=BP13.FB66.FTPREQ.APPL.DBSS,DISP=OLD                           
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBUG  DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
