//BP13A586 JOB (BP13P),'BP13A506',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//         NOTIFY=CSD0071                                                       
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//******************************************************************            
//* OBJECTIVES - GENERATE GRO EMAILS DATASET FOR SBF EXERCISE                   
//*              AFTER SHORTLISTING                                             
//*=================================================================            
//* BP130652 19990823     EXPAND F520 RECL 300 TO 500                           
//* BP130871 20000609 SSS LISTING FOR EAALSS                                    
//* BP131064 20020131 CKK CHG PGM FROM C517 TO C089                             
//* BP132171 20021028 LSB ADD GRO ALSO SUCC UNDER PA LETTER                     
//* BP132200 20021111 CKK ADD F001 TO BP13C089                                  
//* BP132273 20021230 SSS NEW LETTER FOR BP13C089                               
//* BP132273 20030103 SSS ANNEX FOR BP13PL                                      
//* BP132360 20030612 CKK ADD 2 NEW REPORTS                                     
//* BP132455 20031208 SK  REMOVE REPORTS I & J                                  
//* BP132463 20040128 CKK READ BP13K703 FOR PROGRAM BP13C089                    
//* BP132626 20041210 CKK PRINT SERS LETTERS                                    
//* BP132653 20050215 CKK INCL BTO LETTERS                                      
//* BP132684 20050419 CKK EXCL PORT TAG CASES                                   
//* BP132818 20060126 BA3 CHG REF NO SORTING FROM 6 BYTES TO 8 BYTES            
//* BP132985 20070117 CKK PRINT ONLY UNSUCC CASES                               
//* BP133147 20070919 IL5 CATER FOR JUL 2007 BE                                 
//* BP133142 20071016 SSS CATER FOR AUG 2007 BTO                                
//* BP133220 20080103 IL5 PRINT LETTERS IN REGN NO ORDER. PREV QUEUE            
//* BP133239 20080129 IL5 USE BP13.K825.REQOCCP.PREV                            
//* BP133636 20090715 IL5 CHANGE OF GROUPID                                     
//* BP133796 20100122 IL5 SORT PRINTED RESULT LETTERS BY NT FT QUEUE            
//*                       INSTEAD OF REGN                                       
//* BP133832 20100219 ZDD INCLUDE NEW PRGM TO PRINT LETTER FOR PAIRED           
//*                       REGN, INCLUDE NEW FORMS BP13J0-J4                     
//* BP133838 20100310 IL5 NEW PROGRAM BP13CB88 - GRO LETTERS                    
//* BP133847 20100421 ZDD INCLUDE JDE ON BP13C089                               
//* BP133870 20100517 ZDD INCLUDE JDE ON BP13CB88                               
//* BP133913 20100608 ZDD INCLUDE JDE ON BP13CB88 AND BP13C089                  
//*                       INCLUDE BP13CF10                                      
//* BP134024 20100922 ZDD INCLUDE BP13CF18-BYPASS REC FOUND ON BP13K76D         
//* BP134483 20120419 IL5 EXCLUDE PRINTING FOR MGPS                             
//* BP134510 20120424 ZDD INCLUDE NEW FORM BP13J7                               
//******************************************************************            
//*=================================================================            
//* SORT BY QUEUE NO (OMIT GRO CASES AND PORT TAG CASES)                        
//* GRO AND PORT TAG CASES TO BE SENT BY USER ON THEIR OWN                      
//*-----------------------------------------------------------------            
//STEP01  EXEC SORT,COND=(0,NE)                                                 
//SORTIN  DD DSN=BP13.K740.MATUREBA,DISP=SHR                                    
//SORTOUT DD DSN=&&P13F740,DISP=(NEW,PASS),                                     
//           UNIT=SYSDA,DCB=(RECFM=FB,LRECL=500),                               
//           SPACE=(CYL,(35,5),RLSE)                                            
//SYSIN   DD *                                                                  
    SORT FIELDS=(187,3,A,211,2,A,235,5,A,123,8,A),FORMAT=CH                     
//*-----------------------------------------------------------------*           
//*  TO BYPASS RECORD THAT FOUND ON BP13K76D                        *           
//*  REC NOT FOUND WILL BE PROCESSED ON BP13C089                    *           
//*-----------------------------------------------------------------*           
//STEP02   EXEC PGM=BP13CF18,COND=(0,NE)                                        
//BP13F740 DD DSN=&&P13F740,DISP=(OLD,DELETE)                                   
//BP13K76D DD DSN=BP13.K76D.BALLOT.BLOCKLST,DISP=SHR                            
//P13F740A DD DSN=&&BP13F740,DISP=(NEW,PASS),                                   
//             UNIT=SYSDA,SPACE=(CYL,(05,05),RLSE),                             
//             DCB=(BLKSIZE=27500,LRECL=500,RECFM=FB)                           
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*-----------------------------------------------------------------*           
//*  TO SEPERATE CASES WITH EMAIL ADDRESS                           *           
//*-----------------------------------------------------------------*           
//STEP03   EXEC PGM=BP13CF10,COND=(0,NE)                                        
//BP13F740 DD DSN=&&BP13F740,DISP=(OLD,DELETE)                                  
//BP13K857 DD DSN=BP13.K857.EMAIL,DISP=SHR                                      
//BP13K825 DD DSN=BP13.K825.REQOCCP.PREV,DISP=SHR                               
//BP13K830 DD DSN=BP13.K830.ADDR,DISP=SHR                                       
//BP13K831 DD DSN=BP13.K830.ADDR.PATH1,DISP=SHR                                 
//P13F740A DD DSN=&&F740WO,DISP=(NEW,PASS),                                     
//             UNIT=SYSDA,SPACE=(CYL,(05,05),RLSE),                             
//             DCB=(BLKSIZE=27500,LRECL=500,RECFM=FB)                           
//P13F740B DD DSN=&&F740WITH,DISP=(NEW,PASS),                                   
//             UNIT=SYSDA,SPACE=(CYL,(05,05),RLSE),                             
//             DCB=(BLKSIZE=27500,LRECL=500,RECFM=FB)                           
//P13LCF10 DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*=================================================================            
//* INCLUDE FLAT TYPE = SA                                                      
//*---------------------------------------------------------------------        
//STEP20   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD  DSN=&&F740WITH,DISP=(OLD,PASS)                                   
//SORTOUT  DD  DSN=&&F740SA,DISP=(NEW,PASS),                                    
//             UNIT=SYSDA,SPACE=(CYL,(05,05),RLSE),                             
//             DCB=(BLKSIZE=27500,LRECL=500,RECFM=FB)                           
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,28,A),FORMAT=CH                                                
  INCLUDE COND=(211,2,CH,EQ,C'1A',AND,                                          
                 28,1,CH,NE,C'G',AND,                                           
                373,1,CH,NE,C' ')                                               
//*--------------------------------------------------------------------*        
//* PRINT BTO SHORTLISTED CASES WITH EMAIL ADDRESS (SA)                *        
//*--------------------------------------------------------------------*        
//STEP21   EXEC PGM=BP13CD76,COND=(0,NE)                                        
//BP13F740 DD DSN=&&F740SA,DISP=(OLD,DELETE)                                    
//BP13K857 DD DSN=BP13.K857.EMAIL,DISP=SHR                                      
//BP13K813 DD DSN=BP13.K813.BTOBE,DISP=SHR                                      
//BP13K740 DD DSN=BP13.K740.MATUREBA,DISP=SHR                                   
//P13LD36A DD SYSOUT=*                                                          
//P13LD36B DD SYSOUT=*                                                          
//P13LD36C DD SYSOUT=*                                                          
//P13LD36D DD SYSOUT=*                                                          
//P13F203A DD DSN=BP13.F23A.EMAIL.F110,DISP=SHR                                 
//P13F203B DD DSN=BP13.F23A.EMAIL.F120,DISP=SHR                                 
//P13F203C DD DSN=BP13.F23A.EMAIL.F130,DISP=SHR                                 
//P13F203D DD DSN=BP13.F23A.EMAIL.F140,DISP=SHR                                 
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
//*---------------------------------------------------------------------        
//* INCLUDE FLAT TYPE NOT = SA                                                  
//*---------------------------------------------------------------------        
//STEP22   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD  DSN=&&F740WITH,DISP=(OLD,PASS)                                   
//SORTOUT  DD  DSN=&&F740NOSA,DISP=(NEW,PASS),                                  
//             UNIT=SYSDA,SPACE=(CYL,(05,05),RLSE),                             
//             DCB=(BLKSIZE=27500,LRECL=500,RECFM=FB)                           
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,28,A),FORMAT=CH                                                
  INCLUDE COND=(211,2,CH,NE,C'1A',AND,                                          
                 28,1,CH,NE,C'G',AND,                                           
                373,1,CH,NE,C' ')                                               
//*--------------------------------------------------------------------*        
//* PRINT BTO SHORTLISTED CASES WITH EMAIL ADDRESS (NOT SA)            *        
//*--------------------------------------------------------------------*        
//STEP23   EXEC PGM=BP13CD76,COND=(0,NE)                                        
//BP13F740 DD DSN=&&F740NOSA,DISP=(OLD,DELETE)                                  
//BP13K857 DD DSN=BP13.K857.EMAIL,DISP=SHR                                      
//BP13K813 DD DSN=BP13.K813.BTOBE,DISP=SHR                                      
//BP13K740 DD DSN=BP13.K740.MATUREBA,DISP=SHR                                   
//P13LD36A DD SYSOUT=*                                                          
//P13LD36B DD SYSOUT=*                                                          
//P13LD36C DD SYSOUT=*                                                          
//P13LD36D DD SYSOUT=*                                                          
//P13F203A DD DSN=BP13.F23A.EMAIL.F150,DISP=SHR                                 
//P13F203B DD DSN=BP13.F23A.EMAIL.F160,DISP=SHR                                 
//P13F203C DD DSN=BP13.F23A.EMAIL.F170,DISP=SHR                                 
//P13F203D DD DSN=BP13.F23A.EMAIL.F180,DISP=SHR                                 
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
//*-----------------------------------------------------------------            
