//BP13A800 JOB (BP13P),'BP13A800',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//         NOTIFY=CSD0071                                                       
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//******************************************************************            
//* TO EXTRACT SERS REQUEST FOR BALLOTING                                       
//******************************************************************            
//* CHG REF  BY   ON    - DESCRIPTION                                           
//* ---------------------------------                                           
//* BP130301 LSB 971017 - NEW REPORT TO ERU BP13C691                            
//* BP130652     990826 - EXPAND F500,F520 RECL 300 TO 500                      
//* BP132293 SK  030210 - READ BP13K703 FOR BP13C705                            
//* BP132500 YCH 050404 - CHGE OF GROUP ID                                      
//* BP133201 YCH 121107 - CHGE BP13.F500.NT TO BP13.F500.NT.SERS                
//* BP137724 YCH 270919 - CHGE OUTPUT TO IOM2                                   
//******************************************************************            
//*  SEND DYNAMIC JOB DESCRIPTOR ENTRIES AHEAD OF THE PRINT DATASET             
//*-----------------------------------------------------------------            
//PRT01    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EASSRS1A CP-1',END;                                    
1$DJDE$ JDE=BP13D,JDL=BP13,END;                                                 
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EASSRS1A                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID),DEST=IOM2                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*                                                                             
//******************************************************************            
//*  SEND DYNAMIC JOB DESCRIPTOR ENTRIES AHEAD OF THE PRINT DATASET             
//*-----------------------------------------------------------------            
//PRT02    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAPDER1A CP-1',END;                                    
1$DJDE$ JDE=BP13D,JDL=BP13,END;                                                 
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAPDER1A                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID),DEST=IOM2                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*                                                                             
//*--------------------------------------------------------------------         
//* REPRO MATURE REQUESTS TO SEQUENCIAL FILE                                    
//*---------------------------------------------------------------------        
//STEP01   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP17.K730.SERSREQ,DISP=SHR,                                   
//            AMP=('BUFND=23')                                                  
//SORTOUT  DD DSN=&&F500MNT,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,SPACE=(CYL,(80,10),RLSE),                              
//            DCB=(BLKSIZE=27500,LRECL=500,RECFM=FB)                            
//SYSIN    DD *                                                                 
     SORT FIELDS=(123,8,A),FORMAT=CH                                            
     OMIT COND=(123,8,CH,EQ,C'        ')                                        
//*---------------------------------------------------------------------        
//* BP13.F500.SEQUENCE - ALREADY UPDATED WITH SEQ-REF-NO                        
//* COMPUTE DTE-BALLOT FOR THE QUARTER                                          
//*---------------------------------------------------------------------        
//STEP02   EXEC PGM=BP13C705,COND=(0,NE)                                        
//BP13F500 DD DSN=&&F500MNT,DISP=(OLD,PASS)                                     
//BP13F520 DD DSN=BP13.F500.NT.SERS,DISP=OLD                                    
//BP13K703 DD DSN=BP13.K703.SOCDATE,DISP=SHR                                    
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* SORT REQUEST RECORD BY NT/REF-NO                                            
//*---------------------------------------------------------------------        
//STEP03   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F500.NT.SERS,DISP=SHR                                    
//SORTOUT  DD DSN=&&BP13F500,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(80,10),RLSE),                              
//            DCB=(BLKSIZE=27500,LRECL=500,RECFM=FB)                            
//SYSIN    DD *                                                                 
        SORT FIELDS=(187,3,A,123,8,A),FORMAT=CH                                 
//*---------------------------------------------------------------------        
//* MATURE NT - TO PRINT REPORT ON APPLICANT WHO RESPOND TO                     
//*             OPENING OF NEW TOWN  FOR REGISTRATION                           
//*---------------------------------------------------------------------        
//STEP04   EXEC PGM=BP13C590,COND=(0,NE)                                        
//BP13F500 DD DSN=&&BP13F500,DISP=(OLD,PASS)                                    
//BP13K825 DD DSN=BP17.K825.REQOCCP,DISP=SHR,                                   
//            AMP=('BUFND=23')                                                  
//BP13K830 DD DSN=BP17.K830.ADDR,DISP=SHR,                                      
//            AMP=('BUFND=23')                                                  
//BP13L590 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* REPORT ON SERS APPLN/OCCUP REC PASSED FROM ERU                              
//*---------------------------------------------------------------------        
//STEP05   EXEC  SAS,COND=(0,NE)                                                
//BP13F830 DD DSN=BP17.K830.ADDR,DISP=SHR                                       
//BP13F500 DD DSN=&&BP13F500,DISP=(OLD,PASS)                                    
//BP13K825 DD DSN=BP17.K825.REQOCCP,DISP=SHR,                                   
//            AMP=('BUFND=23')                                                  
//BP13L691 DD SYSOUT=2,OUTPUT=(*.PRT02.FORMID),DEST=IOM2                        
//P13L691A DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//SYSOUT   DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S691),DISP=SHR                             
