//BP13A229 JOB (BP13P),'BP13A229',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//             NOTIFY=CSD0071                                                   
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,DISP=SHR                                  
//*********************************************************************         
//* CHG-NO   BY   DATE     DESCRIPTION                                          
//* -------- ---- -------- --------------------------------------------         
//* BP135171 RJE1 20140210 TO CATER FOR DB2 UPGRADE                             
//* BP135404 EL27 20140711 CHANGE PRINTER FROM L03Z TO X6AI                     
//* BP135404 NST1 20140719 CHANGE PRINTER FROM X6AI TO X6AU(LANDSCAPE)          
//*********************************************************************         
//*--------------------------------------------------------------------         
//*    SORT OUT RECORDS UPDATED THROUGH M198 PANEL                              
//*--------------------------------------------------------------------         
//STEP01   EXEC  SORT                                                           
//SORTIN   DD  DSN=BM06.K190.LOG,                                               
//             DISP=SHR                                                         
//SORTOUT  DD  DSN=&&BM06F190,                                                  
//             DISP=(NEW,PASS),                                                 
//             SPACE=(TRK,(5,5),RLSE),                                          
//             DCB=(RECFM=FB,LRECL=650,BLKSIZE=0)                               
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,16,A),FORMAT=CH                                               
   INCLUDE COND=(637,6,CH,EQ,C'B19600',OR,                                      
                 637,6,CH,EQ,C'B19800')                                         
   SUM FIELDS=NONE                                                              
/*                                                                              
//*--------------------------------------------------------------------         
//* BP13C22N - PRINT REPORT ON UPDATED POD/POF DATES                            
//*--------------------------------------------------------------------         
//STEP02 EXEC    PGM=BP13C22N,COND=(0,NE)                                       
//BM06F190 DD  DSN=&&BM06F190,DISP=(SHR,PASS)                                   
//BM06K100 DD  DSN=BM06.K100.BLOCK,DISP=SHR                                     
//BM06K510 DD  DSN=BM06.K510.ESTCDE,DISP=SHR                                    
//BB14K500 DD  DSN=BB14.K500.BLKLEASE,DISP=SHR                                  
//BP13K275 DD  DSN=BP13.K275.OCSCOST,DISP=SHR                                   
//BP13L22N DD  SYSOUT=A,DEST=X6AU                                               
//SYSOUT   DD  SYSOUT=*                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//*                                                                             
//*--------------------------------------------------------------------         
//* BP13C22P - PRINT REPORT ON RECORDS WITH DIFFERENT SELLING PRICE             
//*--------------------------------------------------------------------         
//STEP03 EXEC    PGM=IKJEFT01,COND=(0,NE),                                      
//             REGION=4096K,                                                    
//             DYNAMNBR=20                                                      
//BM06F190 DD  DSN=&&BM06F190,DISP=(SHR,PASS)                                   
//BM06K110 DD  DSN=BM06.K110.FLATINV,DISP=SHR                                   
//BM06K111 DD  DSN=BM06.K110.FLATINV.PATH2,DISP=SHR                             
//BM06K510 DD  DSN=BM06.K510.ESTCDE,DISP=SHR                                    
//BP13K275 DD  DSN=BP13.K275.OCSCOST,DISP=SHR                                   
//BP13L22P DD  SYSOUT=A,DEST=X6AU                                               
//SYSOUT   DD  SYSOUT=*                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSTSPRT DD  SYSOUT=*                                                         
//SYSTSIN  DD  *                                                                
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C22P) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
/*                                                                              
//*--------------------------------------------------------------------         
//* BP13C22H - PRINT REPORT ON UNITS WITH BALCONY                               
//*--------------------------------------------------------------------         
//STEP04 EXEC    PGM=IKJEFT01,COND=(0,NE),                                      
//             REGION=4096K,                                                    
//             DYNAMNBR=20                                                      
//BM06F190 DD  DSN=&&BM06F190,DISP=(SHR,DELETE)                                 
//BM06K110 DD  DSN=BM06.K110.FLATINV,DISP=SHR                                   
//BM06K111 DD  DSN=BM06.K110.FLATINV.PATH2,DISP=SHR                             
//BM06K510 DD  DSN=BM06.K510.ESTCDE,DISP=SHR                                    
//BP13L22H DD  SYSOUT=A,DEST=X6AU                                               
//SYSOUT   DD  SYSOUT=*                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSTSPRT DD  SYSOUT=*                                                         
//SYSTSIN  DD  *                                                                
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C22H) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
/*                                                                              
//*-----------------------------------------------------------------            
//* END OF BP13A229                                                             
//*-----------------------------------------------------------------            
