//BP13A561 JOB (BP13P),'BP13A561',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//       NOTIFY=CSD0071                                                         
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//******************************************************************            
//* 2ND JOB FOR 3R, WIS SHORTLISTING PROCEDURE                                  
//* EXTRACT WAITING LIST APLLN FOR PIGEONHOLING                                 
//* NOTE: THIS JCL WAS CHANGED FOR 3R, WIA, WIB, WIC                            
//* OBJECTIVE : TO EXTRACT THE CASES FROM BP13K730 AND BP13K757                 
//*             FOR SHORTLISTING                                                
//*             THE NEXT JOB IS BP13A567 - ASSIGN RANDOM NO.                    
//******************************************************************            
//* CHG REF  BY  ON       DESCRIPTION                                           
//* -------- --- ------   -----------                                           
//* BP133002 CKK 150307 - NEW JCL FOR 3R, WIA, WIB AND WIC                      
//* BP133002 CKK 180407 - INCLUDE BP13K757 IN BP13C714                          
//* BP133364 IL5 210708 - INCLUDE STEP TO DUP FT RECORDS FOR QUART              
//* BP133504 IL5 190109 - ADD NEW PROGRAM BP13CH14                              
//* BP133561 IL5 280409 - ADD NEW PROGRAM BP13C54D                              
//* BP134036 IL5 121010 - ADD INPUT FILES FOR BP13CH14                          
//* BP133847 ZDD 180310 - ADD BP13K825 ON BP13CH14                              
//* BP137102 AM2 191218 - SORT OUT NUM-OPTION S6 FOR BP13C54D                   
//* BP138164 AM2 160120 - NEW OUTPUT FILE P13FH14A FOR BP13CH14                 
//**************************************************************                
//*  TO SEND DJDE AHEAD OF THE PRINT DATASET                                    
//*  PRT01                    APPLICATION TEAM                                  
//**************************************************************                
//PRT01    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
$DJDE$ JDE=BP13D,JDL=BP13,END;                                                  
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EASSSS1A                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*                                                                             
//*---------------------------------------------------------------------        
//*  DEFINE TEMP FILE FOR THE BALLOTING EXERCISE                                
//*---------------------------------------------------------------------        
//*  DELETE AND DEFINE BP13K730 - MATURE REQUEST FILE FOR BALLOTING             
//*---------------------------------------------------------------------        
//*STEP01   EXEC PGM=IDCAMS,COND=(0,NE)                                         
//*INPUT    DD DSN=BP13.BLANK.CHAR500,DISP=SHR                                  
//*SYSPRINT DD SYSOUT=*                                                         
//*SYSIN    DD *                                                                
//*         DEL (BP13.K730.MATURERQ.BALLOT) CLUSTER PURGE                       
//*         DEF CL (NAME(BP13.K730.MATURERQ.BALLOT)              -              
//*                 CYL(5 5)                             -                      
//*                 UNIQUE                                -                     
//*                 SPEED                                 -                     
//*                 STORCLAS(PRODRLS)               -                           
//*                 LOG(NONE)                       -                           
//*                 SHR(2 3))                             -                     
//*                 DATA                                  -                     
//*                 (NAME(BP13.K730.MATURERQ.BALLOT.DATA)        -              
//*              KEYS(8 122)                           -                        
//*              RECSZ(500 500)                        -                        
//*              CISZ(4096))                                                    
//*      IF LASTCC = 0 THEN                            -                        
//*        REPRO IFILE(INPUT)                          -                        
//*              ODS(BP13.K730.MATURERQ.BALLOT)                                 
//*---------------------------------------------------------------------        
//* DEFINE SOC OCCUP FILE BP13K825 FOR BALLOTING                        -----   
//*--------------------------------------------------------------------------   
//*STEP02   EXEC PGM=IDCAMS,COND=(0,NE)                                         
//*SYSPRINT DD SYSOUT=*                                                         
//*INPUT    DD DSN=BP13.BLANK.CHAR200,DISP=SHR                                  
//*SYSIN    DD *                                                                
//*  DEL (BP13.K825.REQOCCP.BALLOT) CLUSTER PURGE                       001     
//*  DEF CLUSTER                                          -             001     
//*        (NAME(BP13.K825.REQOCCP.BALLOT)                -               001   
//*        SHR(2,3)                                       -               001   
//*        KEYS(17 0)                                     -               001   
//*        CYL(5 5)                                      -                001   
//*        RECSZ(200 200)                                 -               001   
//*        FREESPACE(30 30)                               -               001   
//*        CISZ(4096)                                     -               001   
//*        STORCLAS(PRODRLS)                              -                     
//*        LOG(NONE)                                      -                     
//*        IXD                                            -               001   
//*        UNQ)                                           -               001   
//*      DATA                                             -                   00
//*        (NAME(BP13.K825.REQOCCP.BALLOT.DATA))          -               001   
//*      INDEX                                            -                   00
//*     (NAME(BP13.K825.REQOCCP.BALLOT.INDEX))                            001   
//*   IF LASTCC = 0 THEN                               -                        
//*     REPRO IFILE(INPUT)                             -                        
//*           ODS(BP13.K825.REQOCCP.BALLOT)                                     
//*------------------------------------------------------------------           
//* DEFINE ADDR FILE FOR BALLOTING                                              
//*------------------------------------------------------------------           
//*STEP03   EXEC PGM=IDCAMS,COND=(0,NE)                                         
//*INPUT    DD DSN=BP13.BLANK.CHAR250,DISP=SHR                                  
//*SYSPRINT DD SYSOUT=*                                                         
//*SYSIN    DD  *                                                               
//*         DEL 'BP13.K830.ADDR.BALLOT' CL PURGE                                
//*         DEF CL (NAME(BP13.K830.ADDR.BALLOT)           -                     
//*                 CYL(5 5)                           -                        
//*                 UNIQUE                                -                     
//*                 SPEED                                 -                     
//*                 STORCLAS(PRODRLS)               -                           
//*                 LOG(NONE)                       -                           
//*                 SHR(2 3))                             -                     
//*                 DATA                                  -                     
//*              (NAME(BP13.K830.ADDR.BALLOT.DATA)          -                   
//*              KEYS(9 0)                             -                        
//*              RECSZ(250 250)                        -                        
//*              FSPC(10 10)                           -                        
//*              CISZ(4096))                                                    
//*      IF LASTCC = 0 THEN                            -                        
//*        REPRO IFILE(INPUT)                          -                        
//*              ODS(BP13.K830.ADDR.BALLOT)                                     
//*-----------------------------------------------------------------            
//* DEFINE EMAIL FILE FOR BALLOTING                                             
//*-----------------------------------------------------------------            
//*STEP04   EXEC PGM=IDCAMS,COND=(0,NE)                                         
//*INPUT1   DD DSN=BP13.BLANK.CHAR200,DISP=SHR                                  
//*SYSPRINT DD SYSOUT=*                                                         
//*SYSIN    DD  *                                                               
//*          DEL 'BP13.K857.EMAIL.BALLOT' CL PURGE                      00810000
//*          DEF CLUSTER                                -               00800000
//*              (NAME(BP13.K857.EMAIL.BALLOT)         -                00810000
//*              CYL(5 5)                           -                   00830000
//*              UNIQUE                                 -               00840000
//*           STORCLAS(PRODRLS)                      -                          
//*           LOG(NONE)                              -                          
//*           SHR(2 3))                              -                  00850000
//*           DATA                                   -                  00860000
//*           (NAME(BP13.K857.EMAIL.BALLOT.DATA)    -                   00870000
//*           KEYS(8 0)                              -                  00880000
//*           RECSZ(200 200)                       -                    00890000
//*           CISZ(4096)                             -                  00900000
//*           FSPC(10 10))                           -                  00910000
//*           INDEX                                  -                  00920000
//*           (NAME(BP13.K857.EMAIL.BALLOT.INDEX) -                     00930000
//*           CISZ(4096))                                               00940000
//*   IF MAXCC = 0  THEN                             -                  00950000
//*      REPRO IFILE(INPUT1)                         -                  00960000
//*           ODS(BP13.K857.EMAIL.BALLOT)                               00720000
//*--------------------------------------------------------------------         
//* SORT OUT THE EXERCISE THAT IS GOING FOR SHORTLISTING.                       
//* TO CHECK COL 1826, NUM-BALLOT.                                              
//* TO REMIND USER TO CHANGE NUM-BALLOT BACK TO 'N' AFTER SHORTLISTING          
//*---------------------------------------------------------------------        
//*STEP05   EXEC SORT,COND=(0,NE)                                               
//*SORTIN   DD DSN=BP13.K764.SALES,DISP=SHR,                                    
//*            AMP=('BUFND=23')                                                 
//*SORTOUT  DD DSN=&&BP13F764,DISP=(NEW,PASS),                                  
//*            UNIT=SYSDA,SPACE=(CYL,(2,1),RLSE),                               
//*            DCB=(LRECL=2000,RECFM=FB)                                        
//*SYSIN    DD *                                                                
//*     SORT FIELDS=(1,3,A),FORMAT=CH                                           
//*     INCLUDE COND=(1826,1,CH,EQ,C'Y')                                        
//*--------------------------------------------------------------------         
//* SORT ALL THE APPLICATION IN ALLOCATION CAT SEQUENCE.                        
//* TO CHECK COL 376, NUM-ALLO-CAT.                                             
//*---------------------------------------------------------------------        
//*STEP06   EXEC SORT,COND=(0,NE)                                               
//*SORTIN   DD DSN=BP13.K730.MATURERQ,DISP=SHR                                  
//*SORTOUT  DD DSN=&&BP13F730,DISP=(NEW,PASS),                                  
//*            UNIT=SYSDA,SPACE=(CYL,(10,8),RLSE),                              
//*            DCB=(LRECL=500,RECFM=FB)                                         
//*SYSIN    DD *                                                                
//*     SORT FIELDS=(376,3,A,123,8,A),FORMAT=CH                                 
//*     INCLUDE COND=(376,3,CH,NE,C'   ')                                       
//*---------------------------------------------------------------------        
//* TO SORT OUT ALL THE CASES FROM BP13K757 WHO APPLIED FROM 8PM TO MN          
//* THESE CASES ARE NOT MOVED TO BP13K730 BECAUSE BP13D500 RUNS AT 8PM          
//*---------------------------------------------------------------------        
//*-------------------------------------------------------------------*         
//* SORT OUT INTERNET APPLN WITH DTE-SOC-UPDATED = BLANK              *         
//* UPDATE DTE-SOC-UPDATED WITH CURRENT DATE                          *         
//*-------------------------------------------------------------------*         
//*STEP07   EXEC PGM=BP13C806,COND=(0,NE)                                       
//*BP13K757 DD DSN=BP13.K757.BTO,DISP=SHR                               00584022
//*BP13F757 DD DSN=BP13.F757.BTO.BALLOT,DISP=OLD                                
//*SYSDBG   DD SYSOUT=*                                                 00585021
//*SYSDBOUT DD SYSOUT=*                                                 00585021
//*SYSOUT   DD SYSOUT=*                                                         
//*                                                                             
//*-------------------------------------------------------------------*         
//* SORT OUT CASES WITH EMPTY REF NO                                            
//*-------------------------------------------------------------------*         
//*STEP08   EXEC SORT,COND=(0,NE)                                               
//*SORTIN   DD DSN=BP13.F757.BTO.BALLOT,DISP=SHR                                
//*SORTOUT  DD DSN=BP13.F757.BTO.BALLOT,DISP=SHR                                
//*SYSIN    DD *                                                                
//*    SORT FIELDS=(1,8,A),FORMAT=CH                                            
//*    INCLUDE COND=(1,8,CH,NE,C'        ',AND,2900,1,CH,EQ,C'Y')               
//*-------------------------------------------------------------------*         
//*  CREATE THE REQUESTS FOR MATURE ESTATE FROM FILE, BP13K757        *         
//*-------------------------------------------------------------------*         
//*STEP09   EXEC PGM=BP13C023,COND=(0,NE)                               00581021
//*BP13F757 DD DSN=BP13.F757.BTO.BALLOT,DISP=SHR                        00583024
//*BP13K730 DD DSN=BP13.K730.MATURERQ.BALLOT,DISP=OLD,                  00584022
//*             AMP=('BUFND=4','BUFNI=8')                                       
//*BP13K830 DD DSN=BP13.K830.ADDR.BALLOT,DISP=OLD,                              
//*             AMP=('BUFND=4','BUFNI=8')                                       
//*BP13K825 DD DSN=BP13.K825.REQOCCP.BALLOT,DISP=OLD,                           
//*             AMP=('BUFND=4','BUFNI=8')                                       
//*BP13K857 DD DSN=BP13.K857.EMAIL.BALLOT,DISP=OLD                              
//*BE01F500 DD DUMMY                                                    00583024
//*BP13L023 DD SYSOUT=*                                                 00585021
//*SYSDBG   DD SYSOUT=*                                                 00585021
//*SYSDBOUT DD SYSOUT=*                                                 00585021
//*SYSOUT   DD SYSOUT=*                                                 00585021
//*--------------------------------------------------------------------         
//* SORT OUT INTERNET CASES CAME IN AFTER 8PM                                   
//* TO CHECK COL 376, NUM-ALLO-CAT.                                             
//*---------------------------------------------------------------------        
//*STEP10   EXEC SORT,COND=(0,NE)                                               
//*SORTIN   DD DSN=BP13.K730.MATURERQ.BALLOT,DISP=SHR                           
//*SORTOUT  DD DSN=&&BP13F730,DISP=(MOD,PASS)                                   
//*SYSIN    DD *                                                                
//*     SORT FIELDS=(376,3,A,123,8,A),FORMAT=CH                                 
//*     INCLUDE COND=(376,3,CH,NE,C'   ')                                       
//*--------------------------------------------------------------------         
//* SORT OUT INTERNET CASES BY SALES MODE/REGN-NO ORDER                         
//*---------------------------------------------------------------------        
//*STEP11   EXEC SORT,COND=(0,NE)                                               
//*SORTIN   DD DSN=&&BP13F730,DISP=(OLD,PASS)                                   
//*SORTOUT  DD DSN=&&F730SORT,DISP=(,PASS),                                     
//*            UNIT=SYSDA,SPACE=(CYL,(10,8),RLSE),                              
//*            DCB=(LRECL=500,RECFM=FB)                                         
//*SYSIN    DD *                                                                
//*     SORT FIELDS=(376,3,A,123,8,A),FORMAT=CH                                 
//*     INCLUDE COND=(376,3,CH,NE,C'   ')                                       
//*---------------------------------------------------------------------        
//* SORT OUT ALL THE CASES THAT'S GOING FOR SHORTLISTING                        
//* MOVE DTE-BALLOT FROM BP13F764 TO F500                                       
//*---------------------------------------------------------------------        
//*STEP12   EXEC PGM=BP13C714,COND=(0,NE)                                       
//*BP13F764 DD DSN=&&BP13F764,DISP=(SHR,DELETE)                                 
//*BP13F730 DD DSN=&&F730SORT,DISP=(SHR,DELETE)                                 
//*BP13K757 DD DSN=BP13.K757.BTO,DISP=SHR                                       
//*P13F730A DD DSN=&&F730BALT,DISP=(NEW,PASS),                                  
//*            UNIT=SYSDA,SPACE=(CYL,(10,8),RLSE),                              
//*            DCB=(LRECL=500,RECFM=FB)                                         
//*SYSPRINT DD SYSOUT=*                                                         
//*SYSDBG   DD SYSOUT=*                                                         
//*SYSDBOUT DD SYSOUT=*                                                         
//*SYSOUT   DD SYSOUT=*                                                         
//*---------------------------------------------------------------------        
//* SORT OUT NUM-OPTION 'S6'                                                    
//*---------------------------------------------------------------------        
//STEPA    EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K205.CTLREC,DISP=SHR                                     
//SORTOUT  DD DSN=&&P13K205,DISP=(NEW,PASS),                                    
//            SPACE=(TRK,(1,1),RLSE),UNIT=SYSDA,                                
//            DCB=(RECFM=FB,LRECL=80,BLKSIZE=0)                                 
//SYSIN    DD *                                                                 
  SORT FIELDS=(1,15,A),FORMAT=CH                                                
  INCLUDE COND=(14,2,CH,EQ,C'S6')                                               
//*=================================================================            
//* EXTRACT CASES FOR BALLOTING BASED ON BP13.K205.CTLREC                       
//*=================================================================            
//STEP02   EXEC PGM=BP13C54D,COND=(0,NE)                                        
//BP13F205 DD DSN=&&P13K205,DISP=(OLD,DELETE)                                   
//BP13K595 DD DSN=BP13.K595.BALLOT.LOG,DISP=SHR                                 
//BP13K757 DD DSN=BP13.K757.BTO,DISP=SHR                                        
//BP13K730 DD DSN=BP13.K730.MATURERQ,DISP=SHR                                   
//BP13F500 DD DSN=&&F730BALT,DISP=(NEW,PASS),                                   
//             UNIT=SYSDA,SPACE=(CYL,(10,8),RLSE),                              
//             DCB=(LRECL=500,RECFM=FB)                                         
//BP13L54D DD SYSOUT=*                                                          
//BP13L54E DD SYSOUT=*                                                          
//BP13L54F DD SYSOUT=*                                                          
//BP13L54G DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBUG  DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* UPDATE BALLOT HOUSEHOLD                                                     
//*---------------------------------------------------------------------        
//STEP03   EXEC PGM=BP13CH14,COND=(0,NE)                                        
//BP13F730 DD DSN=&&F730BALT,DISP=(OLD,DELETE)                                  
//BP13KH10 DD DSN=BP13.KH10.NOTBKCNT,DISP=SHR,                                  
//         AMP=('BUFND=23')                                                     
//BP13KH12 DD DSN=BP13.KH12.NOTBKCNT.HISTORY,DISP=SHR,                          
//         AMP=('BUFND=23')                                                     
//BP13K813 DD DSN=BP13.K813.BTOBE,DISP=SHR,                                     
//         AMP=('BUFND=23')                                                     
//BP13K825 DD DSN=BP13.K825.REQOCCP,DISP=SHR,                                   
//         AMP=('BUFND=23')                                                     
//BP13K826 DD DSN=BP13.K825.REQOCCP.PATH1,DISP=SHR,                             
//         AMP=('BUFND=23')                                                     
//BP13K730 DD DUMMY                                                             
//P13F730A DD DSN=BP13.F500.NT,DISP=OLD                                         
//P13LH14A DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//P13FH14A DD DUMMY                                                             
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*--------------------------------------------------------------------         
//* SORT THE FINAL RESULT IN REGN NO SEQUENCE                                   
//* WRITE TO BP13.F500.NT FOR ASSIGNING OF RANDOM NO IN BP13A567                
//*---------------------------------------------------------------------        
//STEP14   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F500.NT,DISP=SHR                                         
//SORTOUT  DD DSN=BP13.F500.NT,DISP=OLD                                         
//SYSIN    DD *                                                                 
     SORT FIELDS=(123,8,A),FORMAT=CH                                            
     OUTREC FIELDS=(1,28,C'01',31,470)                                          
//*--------------------------------------------------------------------         
//* DUPLICATE RECORDS FOR SHORTLISTING                                          
//* HH = 'H' OR 'T' - 2 RECORDS IN FILE                                         
//* HH = 'G'        - 1 RECORD IN FILE                                          
//*---------------------------------------------------------------------        
//STEP15   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F500.NT,DISP=SHR                                         
//SORTOUT  DD DSN=BP13.F500.NT,DISP=MOD                                         
//SYSIN    DD *                                                                 
     SORT FIELDS=(123,8,A),FORMAT=CH                                            
     INCLUDE COND=((461,1,CH,EQ,C'H',OR,461,1,CH,EQ,C'T'),AND,                  
                   (211,1,CH,NE,C'1'))                                          
     OUTREC FIELDS=(1,28,C'02',31,470)                                          
//*---------------------------------------------------------------------        
//* END BP13A561                                                                
//*---------------------------------------------------------------------        
