//BP13AB01 JOB (BP13P),'BP13AB01',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//       NOTIFY=CSD0071                                                         
//*--------------------------------------------------------------------         
//* BP13KB78                                                                    
//*--------------------------------------------------------------------         
//STEP1    EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.KB78.DBSREQ,                                             
//            DISP=SHR                                                          
//OUTPUT1  DD DSN=BP13.FB78.DBSREQ,                                             
//            DISP=SHR                                                          
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1) REPLACE                             
//*-----------------------------------------------------------------            
//* BP13KB78                                                                    
//*-----------------------------------------------------------------            
//STEP2  EXEC    SORT,COND=(0,NE)                                               
//SORTIN   DD DSN=BP13.KB78.DBSREQ,DISP=SHR                                     
//SORTOUT  DD DSN=&&BP13FB78,DISP=(,PASS),                                      
//            UNIT=(SYSDA,1),DCB=(RECFM=FB,LRECL=3300),                         
//            SPACE=(CYL,(10,5),RLSE)                                           
//SYSIN    DD  *                                                                
    SORT FIELDS=(6,8,A),FORMAT=CH                                               
    OMIT COND=(1,3,CH,EQ,C'D04')                                                
//*-----------------------------------------------------------------            
//* BP13KB78                                                                    
//*-----------------------------------------------------------------            
//STEP3     EXEC PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT  DD SYSOUT=*                                                         
//INPUT1   DD DSN=&&BP13FB78,DISP=(SHR,PASS)                                    
//SYSIN     DD  *                                                               
          DEL 'BP13.KB78.DBSREQ' CLUSTER PURGE                          00800000
          DEF CLUSTER                                -                  00800000
              (NAME(BP13.KB78.DBSREQ)             -                     00810000
              CYL(100 30)                                 -             00830000
              STORCLAS(PRODRLS)                      -                          
              LOG(NONE)                              -                          
              SPEED                                  -                          
              UNIQUE                                 -                  00840000
              SHR(2 3))                              -                  00850000
              DATA                                   -                  00860000
              (NAME(BP13.KB78.DBSREQ.DATA)        -                     00870000
              KEYS(8  5)                            -                   00880000
              RECSZ(3300 3300)                         -                00890000
              CISZ(4096)                             -                  00900000
              FSPC(10 10))                           -                  00910000
              INDEX                                  -                  00920000
              (NAME(BP13.KB78.DBSREQ.INDEX)       -                     00930000
              CISZ(4096))                                               00940000
      IF MAXCC = 0  THEN                             -                  00950000
         REPRO IFILE(INPUT1)                         -                  00960000
              ODS(BP13.KB78.DBSREQ)                                     00720000
      IF MAXCC = 0  THEN                             -                  00970000
           DEF AIX (NAME(BP13.KB78.DBSREQ.ALTX1)  -                     00980000
               REL(BP13.KB78.DBSREQ)              -                     00990000
               REUSE                                 -                  01010000
               KEYS(13 0)                            -                  01020000
               SHR(2 3)                              -                  01040000
               NUNQK)                                -                  01050000
               DATA                                  -                  01060000
               (NAME(BP13.KB78.DBSREQ.ALTX1.DATA) -                     01070000
               CYL(30 10)                              -                01080000
               RECSZ(31 1000)                        -                  01090000
               FSPC(10 10)                           -                  01100000
               CISZ(4096))                           -                  01110000
               INDEX                                 -                  01120000
               (NAME(BP13.KB78.DBSREQ.ALTX1.INDEX) -                    01130000
               CISZ(4096))                                              01140000
         IF MAXCC = 0 THEN                           -                  01150000
           DEF PATH (NAME(BP13.KB78.DBSREQ.PATH1) -                     01160000
               PENT(BP13.KB78.DBSREQ.ALTX1))                            01170000
         IF MAXCC = 0 THEN                                              01180000
           BIX IDS(BP13.KB78.DBSREQ)              -                     01190000
               ODS(BP13.KB78.DBSREQ.ALTX1)                              01200000
      IF MAXCC = 0  THEN                             -                  00970000
           DEF AIX (NAME(BP13.KB78.DBSREQ.ALTX2)  -                     00980000
               REL(BP13.KB78.DBSREQ)              -                     00990000
               REUSE                                 -                  01010000
               KEYS(8 3092)                         -                   01020000
               SHR(2 3)                              -                  01040000
               NUNQK)                                -                  01050000
               DATA                                  -                  01060000
               (NAME(BP13.KB78.DBSREQ.ALTX2.DATA) -                     01070000
               CYL(30 10)                              -                01080000
               RECSZ(51 3000)                        -                  01090000
               FSPC(10 10)                           -                  01100000
               CISZ(4096))                           -                  01110000
               INDEX                                 -                  01120000
               (NAME(BP13.KB78.DBSREQ.ALTX2.INDEX) -                    01130000
               CISZ(4096))                                              01140000
         IF MAXCC = 0 THEN                           -                  01150000
           DEF PATH (NAME(BP13.KB78.DBSREQ.PATH2) -                     01160000
               PENT(BP13.KB78.DBSREQ.ALTX2))                            01170000
         IF MAXCC = 0 THEN                                              01180000
           BIX IDS(BP13.KB78.DBSREQ)              -                     01190000
               ODS(BP13.KB78.DBSREQ.ALTX2)                              01200000
//*-----------------------------------------------------------------            
//* BP13KB86                                                                    
//*-----------------------------------------------------------------            
//STEP4    EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.KB86.DBSUIN,                                             
//            DISP=SHR                                                          
//OUTPUT1  DD DSN=BP13.FB86.DBSUIN,                                             
//            DISP=SHR                                                          
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1) REPLACE                             
//*-----------------------------------------------------------------            
//* BP13KB86                                                                    
//*-----------------------------------------------------------------            
//STEP5  EXEC    SORT,COND=(0,NE)                                               
//SORTIN   DD DSN=BP13.KB86.DBSUIN,DISP=SHR                                     
//SORTOUT  DD DSN=&&BP13FB86,DISP=(,PASS),                                      
//            UNIT=(SYSDA,1),DCB=(RECFM=FB,LRECL=150),                          
//            SPACE=(CYL,(5,2),RLSE)                                            
//SYSIN    DD  *                                                                
    SORT FIELDS=(1,8,A),FORMAT=CH                                               
    OMIT COND=(85,3,CH,EQ,C'D04')                                               
//*-----------------------------------------------------------------            
//* BP13KB86                                                                    
//*-----------------------------------------------------------------            
//STEP6     EXEC PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT  DD SYSOUT=*                                                         
//INPUT1    DD DSN=&&BP13FB86,DISP=(SHR,PASS)                                   
//SYSIN     DD  *                                                               
          DEL (BP13.KB86.DBSUIN) CLUSTER PURGE                                  
          DEF CLUSTER                                -                  00800000
              (NAME(BP13.KB86.DBSUIN)                -                  00810000
              CYL(30  10)                             -                 00830000
              STORCLAS(PRODRLS)                      -                          
              LOG(NONE)                              -                          
              SPEED                                  -                          
              UNIQUE                                 -                  00840000
              SHR(2 3))                              -                  00850000
              DATA                                   -                  00860000
              (NAME(BP13.KB86.DBSUIN.DATA)           -                  00870000
              KEYS(17 0)                             -                  00880000
              RECSZ(150 150)                         -                  00890000
              CISZ(4096)                             -                  00900000
              FSPC(10 10))                           -                  00910000
              INDEX                                  -                  00920000
              (NAME(BP13.KB86.DBSUIN.INDEX)          -                  00930000
              CISZ(4096))                                               00940000
      IF MAXCC = 0  THEN                             -                  00950000
         REPRO IFILE(INPUT1)                         -                  00960000
              ODS(BP13.KB86.DBSUIN)                                     00720000
      IF MAXCC = 0  THEN                             -                  00970000
           DEF AIX (NAME(BP13.KB86.DBSUIN.ALTX1)     -                  00980000
               REL(BP13.KB86.DBSUIN)                 -                  00990000
               REUSE                                 -                  01010000
               KEYS(9 8)                             -                  01020000
               SHR(2 3)                              -                  01040000
               NUNQK)                                -                  01050000
               DATA                                  -                  01060000
               (NAME(BP13.KB86.DBSUIN.ALTX1.DATA)    -                  01070000
               CYL(20 8)                             -                  01080000
               RECSZ(31 6000)                         -                 01090000
               FSPC(10 10)                           -                  01100000
               CISZ(4096))                           -                  01110000
               INDEX                                 -                  01120000
               (NAME(BP13.KB86.DBSUIN.ALTX1.INDEX)   -                  01130000
               CISZ(4096))                                              01140000
         IF MAXCC = 0 THEN                           -                  01150000
           DEF PATH (NAME(BP13.KB86.DBSUIN.PATH1)    -                  01160000
               PENT(BP13.KB86.DBSUIN.ALTX1))                            01170000
         IF MAXCC = 0 THEN                                              01180000
           BIX IDS(BP13.KB86.DBSUIN)                 -                  01190000
               ODS(BP13.KB86.DBSUIN.ALTX1)                              01200000
//*-----------------------------------------------------------------            
//* BP13KB88                                                                    
//*-----------------------------------------------------------------            
//STEP7    EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT    DD DSN=BP13.BLANK.CHAR3500,DISP=SHR                                  
//SYSIN    DD *                                                                 
         DEL (BP13.KB88.DBSLOG) CLUSTER PURGE                                   
         DEF CL (NAME(BP13.KB88.DBSLOG)          -                              
                 CYL(200 100)                      -                            
                 UNIQUE                          -                              
                 SPEED                           -                              
                 STORCLAS(PRODRLS)               -                              
                 LOG(NONE)                       -                              
                 SHR(2 3))                       -                              
                 DATA                            -                              
                 (NAME(BP13.KB88.DBSLOG.DATA)    -                              
                 KEYS(18 0)                      -                              
                 RECSZ(3500 3500)                  -                            
                 FSPC(10 10)                     -                              
                 CISZ(4096))                                                    
         IF LASTCC = 0 THEN                      -                              
           REPRO IFILE(INPUT)                    -                              
                 ODS(BP13.KB88.DBSLOG)                                          
