//BP13Q201 JOB (BP13P),'BP13Q201',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//       NOTIFY=CSD0071                                                         
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//******************************************************************            
//* YEARLY JOB RUN ON END-JAN TO PASS DATA ON BOOKED CASES FOR THE              
//* YEAR WITH ESTIMATED COMPLETION DATE TO MINISTRY OF EDUCATION                
//* PASS THRU IDNET                                                             
//******************************************************************            
//* BP130604 981229 LSB  DATA PASS TO MOE                                       
//* BP130770 991210 LSB  ADD NT TO FILE BP13F216                                
//* BP130876 000615 LSB  CHG BP13Y201 TO BP13Q201 QTRLY JOB                     
//* BP130899 000815 LSB  ADD NEW FILE BP13.F216.MOEPREYR                        
//* BP131014 010528 LSB  EXPAND TEMP FILE IN STEP03                             
//* BP132627 121104 GAN1 CHG F800.APPLN.KEYISSUE TO BP13K893                    
//*                      CHG F820.OCCUP.KEYISSUE TO BP13K895                    
//* BP132801 030406 SSS2 REMOVE REPORT TO EAALPL                                
//* BP132801 120523 LSB1 IF ECD DATE = ZEROS, PACK SPACES TO MOE FILE           
//* BP134782 130228 LSB1 EXPAND TEMP SPACE IN STEP10                            
//* BP135171 140211 RJE1 TO CATER FOR DB2 UPGRADE                               
//* BP135171 140227 NST1 REMOVE THE CALLING OF BM06286F AND                     
//*                      USE BM06.F120.FLATINV.PIDB DIRECTLY                    
//*=================================================================            
//*-----------------------------------------------------------------            
//* INCLUDE ONLY THE BOOKED FLAT CASES                                          
//* INCLUDE KEY-ISSUED > 20120101 CASES                                         
//* SORT BY EST/NEI/CONTR/BLK                                                   
//*-----------------------------------------------------------------            
//STEP01   EXEC SORT,CYL=30,COND=(0,NE)                                         
//SORTIN   DD DSN=BM06.F120.FLATINV.PIDB,DISP=SHR                               
//SORTOUT  DD DSN=&&BM06F120,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=700),                              
//            SPACE=(CYL,(200,30),RLSE)                                         
//SYSIN    DD  *                                                                
  SORT FIELDS=(12,16,A,1,11,A),FORMAT=CH                                        
  OMIT COND=(299,8,CH,EQ,C'00000000',OR,                                        
            (323,8,CH,GT,C'00000000',AND,323,8,CH,LT,C'20120101'))              
//*-----------------------------------------------------------------            
//* USE FIS REC TO RETRIEVE EST-COMPLETION FROM LIS SYSTEM                      
//*-----------------------------------------------------------------            
//STEP02   EXEC PGM=BP13C390,COND=(0,NE)                                        
//BM06F120 DD DSN=&&BM06F120,DISP=(OLD,DELETE)                                  
//BM06K100 DD DSN=BM06.K100.BLOCK,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//BB14K500 DD DSN=BB14.K500.BLKLEASE,DISP=SHR,                                  
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13F216 DD DSN=&&BP13F216,DISP=(,PASS),                                      
//            UNIT=SYSDA,SPACE=(CYL,(50,10),RLSE),                              
//            DCB=(BLKSIZE=0,LRECL=100,RECFM=FB)                                
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*-----------------------------------------------------------------            
//* SORT BP13F216 IN REGN-NO ORDER                                              
//*-----------------------------------------------------------------            
//STEP03   EXEC SORT,CYL=30,COND=(0,NE)                                         
//SORTIN   DD DSN=&&BP13F216,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F216SORT,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=100),                              
//            SPACE=(CYL,(50,10),RLSE)                                          
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,8,A),FORMAT=CH                                                 
//*-----------------------------------------------------------------            
//* SORT APPLN HISTORY BY REGN-NO                                               
//*-----------------------------------------------------------------            
//STEP04A  EXEC SORT,CYL=30,COND=(0,NE)                                         
//SORTIN   DD DSN=BP13.K893.APPLN.HISTORY,DISP=SHR,                             
//            AMP=('BUFND=4','BUFNI=8')                                         
//SORTOUT  DD DSN=&&BP13K893,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=2000),                             
//            SPACE=(CYL,(350,150),RLSE)                                        
//SYSIN    DD  *                                                                
  SORT FIELDS=(4,8,A),FORMAT=CH                                                 
  OMIT COND=(1,1,CH,EQ,C'C',OR,                                                 
          2035,8,CH,LT,C'20120101')                                             
  OUTREC FIELDS=(1,2000)                                                        
  SUM FIELDS=NONE                                                               
//*-----------------------------------------------------------------            
//* OMIT NON FAMILY NUCLEUS ELIGIBILITY SCHEME CASES                            
//* SORT BY REGN-NO                                                             
//*-----------------------------------------------------------------            
//STEP04   EXEC SORT,CYL=30,COND=(0,NE)                                         
//SORTIN   DD DSN=BP13.F800.APPLN,DISP=SHR                                      
//         DD DSN=&&BP13K893,DISP=(OLD,DELETE)                                  
//SORTOUT  DD DSN=&&BP13F800,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=2000),                             
//            SPACE=(CYL,(350,150),RLSE)                                        
//SYSIN    DD  *                                                                
  SORT FIELDS=(4,8,A),FORMAT=CH                                                 
  OMIT COND=(1,1,CH,EQ,C'C')                                                    
  SUM FIELDS=NONE                                                               
//*-----------------------------------------------------------------            
//* MATCH SOC MASTER TO BPYASS ELIG-SCH= ASC, FS, JSS, OR,SS                    
//*-----------------------------------------------------------------            
//STEP05   EXEC PGM=BP13C392,COND=(0,NE)                                        
//BP13F216 DD DSN=&&F216SORT,DISP=(OLD,PASS)                                    
//BP13F800 DD DSN=&&BP13F800,DISP=(OLD,DELETE)                                  
//P13F216A DD DSN=&&F216SOC,DISP=(,PASS),                                       
//            UNIT=SYSDA,SPACE=(CYL,(50,5),RLSE),                               
//            DCB=(BLKSIZE=0,LRECL=100,RECFM=FB)                                
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*-----------------------------------------------------------------            
//* SORT HISTORY OCCUP FILE                                                     
//*-----------------------------------------------------------------            
//STEP06   EXEC SORT,CYL=30,COND=(0,NE)                                         
//SORTIN   DD DSN=BP13.K820.OCCUP,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//SORTOUT  DD DSN=&&BP13F820,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=400),                              
//            SPACE=(CYL,(500,80),RLSE),DATACLAS=MULTIVOL                       
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,17,A),FORMAT=CH                                                
  OMIT COND=(1,8,CH,LT,C'1528585J')                                             
//*-----------------------------------------------------------------            
//* SORT HISTORY OCCUP FILE                                                     
//*-----------------------------------------------------------------            
//STEP07A  EXEC SORT,CYL=30,COND=(0,NE)                                         
//SORTIN   DD DSN=BP13.K895.OCCUP.HISTORY,DISP=SHR,                             
//            AMP=('BUFND=4','BUFNI=8')                                         
//SORTOUT  DD DSN=&&BP13K895,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=400),                              
//            SPACE=(CYL,(500,80),RLSE),DATACLAS=MULTIVOL                       
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,17,A),FORMAT=CH                                                
  OMIT COND=(1,8,CH,LT,C'1528585J')                                             
  OUTREC FIELDS=(1,400)                                                         
  SUM FIELDS=NONE                                                               
//*-----------------------------------------------------------------            
//* REPRO HISTORY OCCUP FILE                                                    
//*-----------------------------------------------------------------            
//STEP07   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=&&BP13K895,DISP=(OLD,DELETE)                                  
//OUTPUT1  DD DSN=&&BP13F820,DISP=(MOD,PASS),                                   
//            UNIT=SYSDA,                                                       
//            SPACE=(CYL,(480,80),RLSE),DATACLAS=MULTIVOL,                      
//            DCB=(BLKSIZE=0,LRECL=400,RECFM=FB)                                
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                     
//*-----------------------------------------------------------------            
//* SORT REGN-NO/NRIC                                                           
//*-----------------------------------------------------------------            
//STEP08   EXEC SORT,CYL=30,COND=(0,NE)                                         
//SORTIN   DD DSN=&&BP13F820,DISP=(OLD,DELETE)                                  
//SORTOUT  DD DSN=&&F820NRIC,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=400),                              
//            SPACE=(CYL,(480,80),RLSE),DATACLAS=MULTIVOL                       
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,17,A),FORMAT=CH                                                
//*-----------------------------------------------------------------            
//* READ SOC OCCUP FILE TO GET UIN                                              
//*-----------------------------------------------------------------            
//STEP09   EXEC PGM=BP13C391,COND=(0,NE)                                        
//BP13F216 DD DSN=&&F216SOC,DISP=(OLD,PASS)                                     
//BP13F820 DD DSN=&&F820NRIC,DISP=(OLD,PASS)                                    
//P13F216A DD DSN=BP13.F216.MOE,DISP=OLD                                        
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*-----------------------------------------------------------------            
//* OUTREC RECORDS TO MOE FOR BOOKED CASES                                      
//*-----------------------------------------------------------------            
//STEP10  EXEC PGM=SORT,COND=(0,NE)                                             
//SYSOUT  DD SYSOUT=*                                                           
//SORTIN  DD DSN=BP13.F216.MOE,DISP=SHR                                         
//SORTOUT DD DSN=BP13.F216.MOEBOOK,DISP=OLD                                     
//SYSIN   DD  *                                                                 
  SORT FIELDS=(1,9,A),FORMAT=CH                                                 
  OUTREC FIELDS=(9,9,37,6,60,3,51,8)                                            
  INCLUDE COND=(59,1,CH,EQ,C'1',AND,51,8,CH,GT,C'00000000')                     
//*-----------------------------------------------------------------            
//* OUTREC RECORDS TO MOE FOR BOOKED CASES                                      
//* IF ECD=ZEROS, OUTREC AS SPACES                                              
//*-----------------------------------------------------------------            
//STEP10A EXEC PGM=SORT,COND=(0,NE)                                             
//SYSOUT  DD SYSOUT=*                                                           
//SORTIN  DD DSN=BP13.F216.MOE,DISP=SHR                                         
//SORTOUT DD DSN=BP13.F216.MOEBOOK,DISP=MOD                                     
//SYSIN   DD  *                                                                 
  SORT FIELDS=(1,9,A),FORMAT=CH                                                 
  OUTREC FIELDS=(9,9,37,6,60,3,C'        ')                                     
  INCLUDE COND=(59,1,CH,EQ,C'1',AND,51,8,CH,LE,C'00000000')                     
//*-----------------------------------------------------------------            
//* OUTREC RECORDS TO MOE FOR KEY ISSUE WITHIN THE YEAR                         
//* AND BOOKED FLAT WITHIN ONE YEAR PERIOD                                      
//*-----------------------------------------------------------------            
//STEP11  EXEC PGM=SORT,COND=(0,NE)                                             
//SYSOUT  DD SYSOUT=*                                                           
//SORTIN  DD DSN=BP13.F216.MOE,DISP=SHR                                         
//SORTOUT DD DSN=BP13.F216.MOEKEY,DISP=OLD                                      
//SYSIN   DD  *                                                                 
  SORT FIELDS=(1,9,A),FORMAT=CH                                                 
  OUTREC FIELDS=(9,9,37,6,60,3,43,8)                                            
  INCLUDE COND=(59,1,CH,EQ,C'2')                                                
//*-----------------------------------------------------------------            
//* OUTREC RECORDS TO MOE FOR KEY ISSUE WOTHIN THE YEAR                         
//* BUT BOOKED FLAT BEFORE ONE YEAR PERIOD                                      
//*-----------------------------------------------------------------            
//STEP12  EXEC PGM=SORT,COND=(0,NE)                                             
//SYSOUT  DD SYSOUT=*                                                           
//SORTIN  DD DSN=BP13.F216.MOE,DISP=SHR                                         
//SORTOUT DD DSN=BP13.F216.MOEPREYR,DISP=OLD                                    
//SYSIN   DD  *                                                                 
  SORT FIELDS=(1,9,A),FORMAT=CH                                                 
  OUTREC FIELDS=(9,9,37,6,60,3,43,8)                                            
  INCLUDE COND=(59,1,CH,EQ,C'3')                                                
