//BP13DFT2 JOB (BP13P),'BP13DFT2',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//         NOTIFY=CSD0071                                                       
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//*===================================================================*         
//* DETERMINE FT-2T                                                             
//*-------------------------                                                    
//* FOR CDE-HOUSEHOLD = G, SYSTEM FURTHER CHECK                                 
//* DETERMINE FT-2T FOR MARRIED COUPLE WHERE HA1=2T, SPOUSE=FT                  
//*                                          HA1=FT, SPOUSE=2T                  
//* SYSTEM TO BYPASS :                                                          
//* NON-CITIZEN SPOUSE,                                                         
//* USE SMS SCH-ACC-NO TO READ RDB TO EXTRACT FAMILY MEMBERS, IF SOC            
//* SPOUSE IS ALSO FOUND IN RDB AS SPOUSE                                       
//* SYSTEM TO TAG NUM-FT2T=Y, DEFAULT=N                                         
//*                                                                             
//* DETERMINE SINGLE SCHEME                                                     
//*-------------------------                                                    
//*===================================================================*         
//* CHG REF  BY  DATE     DESCRIPTION                                           
//* -------- --- ------   -----------                                           
//* BP135002 LSB 220713   DELETE OLD JCL BP13D510                               
//*                       USE THIS JCL TO DETERMINE FT-2T ( COL 475)            
//* BP135002 LSB 120813   OMIT SA                                               
//* BP135028 LSB 280813   INCLUDE DBS                                           
//* BP135148 SMR 281113   RUN BP13CF92 TWICE (FOR BTO THEN SBF)                 
//* BP135254 SMR 100314   OUTPUT REPORT BP13LF92 TO SEPARATE GROUP ID           
//* BP135350 SMR 100714   ENHANCEMENT FOR DETERMINATION OF FT2T                 
//* BP135503 LSB 190914   DETERMINE HALF-IDP                                    
//* BP135344 IL5 290914   UPDATE FT2T DETERMINED FOR EC APPLICATION             
//* BP135921 LSB 120915   ADD ELDERLY SCHEME                                    
//* BP136239 SMR 260516   SORT THE REPORTS FOR BP13LZ2G/LZ2H/LZ2I BY            
//*                       ALLO-CAT AND REGNO INSTEAD OF REGNO ONLY              
//* BP136404 SMR 180816   PRINT HARDCOPY OF THE REPORTS FROM BP13LZ2G,          
//*                       BP13LZ2H & BP13LZ2I / SEPARATE BTO AND SBF            
//*                       REPORTS / BACKUP BP13.LF92.BP13CF92.D510              
//* BP136505 SMR 151116   ADD NEW PROGRAM, BP13CB35                             
//* BP136609 SMR 100317   PRINT 2 COPIES OF THE REPORTS                         
//* BP136629 SMR 270417   ADD NEW PROGRAM, BP13CB37                             
//* BP136762 SMR 240517   PRINT 2 COPIES OF BP13LB37                            
//* BP136852 SMR 230617   CATER FOR SALES-MODE = 'ROF' AND FT = 'RF'            
//* BP137048 SMR 171117   DO NOT PRINT LOG FROM BP13C161                        
//* BP137208 YCH2120218   TO INCLUDE BP17F100 IN STEP18                         
//* BP137179 LSB 080518   FT2T FOR JOINT SINGLE ELIG SCH=JSE                    
//* BP137439 AM2 310818   CORRECT LRECL AND RECFM FOR BP13CF92                  
//*                       TRUNCATION ISSUE                                      
//* BP137783 AM2 090419   OMIT APPLNS HH='G' & FT2T NOT ='Y' FOR LB37           
//* BP138285 AM2 240420   HARDCOPY REPORTS CONVERSION                           
//*              050620   REMOVE DJDE STEPS                                     
//* BP138565 LSB 280121   ADD FT=1F                                             
//* BP139673 AM2 150923   CATER FOR HFE SUBMISSION DATE                         
//* BP139780 AM2 301123   TO STOP SALES BATCH DETERMINATION FOR                 
//*                       FIELDS FROM HFE                                       
//* BP139682 AM2 121223   ADD NEW OUTPUT FILE IN BP13CB35 - P13LB35A            
//*===================================================================*         
//*--------------------------------------------------------------------         
//* DELETE SEQUENTIAL FILE                                                      
//*--------------------------------------------------------------------         
//STEP00   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
     DEL (BP13.CLOUD.BP13DFT2.LB35A)                                            
     IF MAXCC < 12 THEN                                                         
        SET MAXCC = 0                                                           
//*---------------------------------------------------------------------        
//* DAILY FILE USE TO DETERMINE CDE-HOSUEHOLD                                   
//*---------------------------------------------------------------------        
//STEP01   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F730.MATURERQ.DAILY,DISP=SHR                             
//SORTOUT  DD DSN=&&BP13F713,DISP=(,PASS),                                      
//        UNIT=SYSDA,DCB=(RECFM=FB,LRECL=500),                                  
//        SPACE=(CYL,(80,30),RLSE)                                              
//SYSIN   DD *                                                                  
    SORT FIELDS=(1,17,A),FORMAT=CH                                              
    INCLUDE COND=(116,1,CH,EQ,C'G',AND,                                         
                  211,2,CH,NE,C'1A',AND,                                        
                 (376,3,CH,EQ,C'BTO',OR,376,3,CH,EQ,C'SBF',OR,                  
                  376,3,CH,EQ,C'DBS',OR,376,3,CH,EQ,C'EC ',OR,                  
                  376,3,CH,EQ,C'ROF'))                                          
//*---------------------------------------------------------------------        
//* CHECK FOR CASES WITH FT/2T                                                  
//* TAG COL 475 TAG 'Y' FOR FT-2T CASES                                         
//*---------------------------------------------------------------------        
//STEP02   EXEC PGM=BP13CD82,COND=(0,NE)                                        
//BP13F595 DD DSN=&&BP13F713,DISP=(OLD,PASS)                                    
//BP13K558 DD DSN=BP13.K558.BP13DPRE,DISP=SHR,                                  
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K716 DD DSN=BP13.K716.DPREQ750,DISP=SHR,                                  
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K595 DD DSN=BP13.K595.BALLOT.LOG,DISP=SHR,                                
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K591 DD DSN=BP13.K595.BALLOT.LOG.PATH1,DISP=SHR,                          
//         AMP=('BUFND=4','BUFNI=8')                                            
//P13F595A DD DSN=&&F730CD82,DISP=(,PASS),                                      
//        UNIT=SYSDA,DCB=(RECFM=FB,LRECL=500),                                  
//        SPACE=(CYL,(80,30),RLSE)                                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*-------------------------------------------------------------------*         
//* COL 475 = 'Y'/'E', FOR FT-2T CASES, COL 116 = G UPGRADER                    
//*-------------------------------------------------------------------*         
//STEP03   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F730CD82,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=BP13.F730.FT2T,DISP=OLD,                                      
//            SPACE=(CYL,(20,10),RLSE),                                         
//            DCB=(RECFM=FB,LRECL=500)                                          
//SYSIN    DD  *                                                                
   SORT FIELDS=(123,8,A),FORMAT=CH                                              
  INCLUDE COND=(116,1,CH,EQ,C'G',AND,                                           
                475,1,CH,EQ,C'Y')                                               
//*-------------------------------------------------------------------*         
//* COL 475 = 'Y'/'E', FOR FT-2T CASES, COL 116 = G UPGRADER                    
//*-------------------------------------------------------------------*         
//STEP3A   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F730CD82,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=BP13.F730.FT2T.JSE,DISP=OLD,                                  
//            SPACE=(CYL,(20,10),RLSE),                                         
//            DCB=(RECFM=FB,LRECL=500)                                          
//SYSIN    DD  *                                                                
   SORT FIELDS=(123,8,A),FORMAT=CH                                              
  INCLUDE COND=(116,1,CH,EQ,C'G',AND,                                           
                475,1,CH,EQ,C'E')                                               
//*--------------------------------------------------------------------*        
//* BYPASS NON-CITIZEN SPOUSE                                                   
//*--------------------------------------------------------------------*        
//STEP04   EXEC PGM=BP13CY83,COND=(0,NE)                                        
//BP13F595 DD DSN=BP13.F730.FT2T,DISP=SHR                                       
//BP13K828 DD DSN=BP13.K825.REQOCCP,DISP=SHR,                                   
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13LY83 DD DSN=&&BP13LY83,DISP=(,PASS),                                      
//            UNIT=SYSDA,SPACE=(CYL,(20,10),RLSE),                              
//            DCB=(RECFM=FB,LRECL=133)                                          
//P13F595A DD DSN=&&F595NONC,DISP=(,PASS),                                      
//            UNIT=SYSDA,SPACE=(CYL,(50,30),RLSE),                              
//            DCB=(RECFM=FB,LRECL=500)                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
//*--------------------------------------------------------------------*        
//* BYPASS SPOUSE FOUND AS OCCUPIER IN THE DP FLAT                              
//* RDB ROLE 023(LESSEE), 024(CO-LESSEE) 025(OCCUPIER)                          
//*--------------------------------------------------------------------*        
//STEP05   EXEC PGM=BP13CY84,COND=(0,NE)                                        
//BP13F595 DD DSN=&&F595NONC,DISP=(OLD,PASS)                                    
//BP13K828 DD DSN=BP13.K825.REQOCCP,DISP=SHR,                                   
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K716 DD DSN=BP13.K716.DPREQ750,DISP=SHR,                                  
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13LY84 DD DSN=&&BP13LY83,DISP=(MOD,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(20,10),RLSE),                              
//            DCB=(RECFM=FB,LRECL=133)                                          
//P13F595A DD DSN=BP13.F730.FT2T,DISP=OLD                                       
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
//*-----------------------------------------------------------------            
//* PRINT REPORT 0N CASH RECEIPT FOR THE MONTH ON HARDCOPY                      
//*-----------------------------------------------------------------            
//STEP5A   EXEC PGM=IEBGENER,COND=(0,NE)                                        
//SYSUT1   DD DSN=&&BP13LY83,DISP=(OLD,PASS)                                    
//SYSUT2   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
/*                                                                              
//*-------------------------------------------------------------------*         
//* BACKUP BP13F716 TO ACCUM FILE                                               
//*-------------------------------------------------------------------*         
//STEP5B   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=&&BP13LY83,DISP=(OLD,PASS)                                    
//OUTPUT1  DD DSN=BP13.LY83.BP13CY83.D510,DISP=MOD                              
//*                                                                             
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                     
//*-------------------------------------------------------------------*         
//* INCLUDE BTO CASES ONLY - PARENT/SIBLING CASES                               
//*-------------------------------------------------------------------*         
//*STEP06A  EXEC SORT,COND=(0,NE)                                               
//*SORTIN   DD DSN=BP13.F730.FT2T,DISP=SHR                                      
//*SORTOUT  DD DSN=&&F730BTOP,DISP=(NEW,PASS),                                  
//*            SPACE=(CYL,(20,10),RLSE),                                        
//*            DCB=(RECFM=FB,LRECL=500)                                         
//*SYSIN    DD  *                                                               
//*  SORT FIELDS=(123,8,A),FORMAT=CH                                            
//*  INCLUDE COND=(376,3,CH,EQ,C'BTO',AND,                                      
//*               (500,1,CH,EQ,C'P',OR,500,1,CH,EQ,C'S'))                       
//*---------------------------------------------------------------------        
//* GENERATE FT2T REPORT SHOW SMS, RSL, TRF, MAM & SLS INFOR                    
//* UPDATE K730-NUM-FT2T = Y                                                    
//*---------------------------------------------------------------------        
//*STEP06B  EXEC PGM=BP13CF92,COND=(0,NE)                                       
//*BP13F205 DD DSN=BP13.F205.FT2T,DISP=SHR                                      
//*BP13F730 DD DSN=&&F730BTOP,DISP=(OLD,DELETE)                                 
//*BP13K558 DD DSN=BP13.K558.BP13DPRE,DISP=SHR,                                 
//*            AMP=('BUFND=4','BUFNI=8')                                        
//*BP13K730 DD DSN=BP13.K730.MATURERQ,DISP=SHR,                                 
//*            AMP=('BUFND=4','BUFNI=8')                                        
//*BP13LF92 DD DSN=&&BP13LF92,DISP=(NEW,PASS),                                  
//*            SPACE=(CYL,(20,10),RLSE),                                        
//*            DCB=(RECFM=FBA,LRECL=133)                                        
//*SYSIN    DD *                                                                
//*_BTO                                                                         
//*SYSPRINT DD SYSOUT=*                                                         
//*SYSDBG   DD SYSOUT=*                                                         
//*SYSDBOUT DD SYSOUT=*                                                         
//*SYSOUT   DD SYSOUT=*                                                         
//*-----------------------------------------------------------------            
//* PRINT FT2T REPORT                                                           
//*-----------------------------------------------------------------            
//*STEP06C  EXEC PGM=IEBGENER,COND=(0,NE)                                       
//*SYSUT1   DD DSN=&&BP13LF92,DISP=(OLD,PASS)                                   
//*SYSUT2   DD SYSOUT=8,DEST=IOM8                                               
//*SYSPRINT DD SYSOUT=*                                                         
//*SYSIN    DD DUMMY                                                            
//*-------------------------------------------------------------------*         
//* BACKUP REPORT TO BP13LF92                                                   
//*-------------------------------------------------------------------*         
//*STEP06D  EXEC PGM=IDCAMS,COND=(0,NE)                                         
//*SYSPRINT DD SYSOUT=*                                                         
//*INPUT1   DD DSN=&&BP13LF92,DISP=(OLD,DELETE)                                 
//*OUTPUT1  DD DSN=BP13.LF92.BP13CF92.D510,DISP=OLD                             
//*                                                                             
//*SYSIN    DD *                                                                
//*     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                  
//*-------------------------------------------------------------------*         
//* INCLUDE BTO CASES ONLY - NORMAL CASES                                       
//*-------------------------------------------------------------------*         
//*STEP06E  EXEC SORT,COND=(0,NE)                                               
//*SORTIN   DD DSN=BP13.F730.FT2T,DISP=SHR                                      
//*SORTOUT  DD DSN=&&F730BTON,DISP=(NEW,PASS),                                  
//*            SPACE=(CYL,(20,10),RLSE),                                        
//*            DCB=(RECFM=FB,LRECL=500)                                         
//*SYSIN    DD  *                                                               
//*  SORT FIELDS=(123,8,A),FORMAT=CH                                            
//*  INCLUDE COND=(376,3,CH,EQ,C'BTO',AND,                                      
//*               (500,1,CH,NE,C'P',AND,500,1,CH,NE,C'S'))                      
//*---------------------------------------------------------------------        
//* GENERATE FT2T REPORT SHOW SMS, RSL, TRF, MAM & SLS INFOR                    
//* UPDATE K730-NUM-FT2T = Y                                                    
//*---------------------------------------------------------------------        
//*STEP06F  EXEC PGM=BP13CF92,COND=(0,NE)                                       
//*BP13F205 DD DSN=BP13.F205.FT2T,DISP=SHR                                      
//*BP13F730 DD DSN=&&F730BTON,DISP=(OLD,DELETE)                                 
//*BP13K558 DD DSN=BP13.K558.BP13DPRE,DISP=SHR,                                 
//*            AMP=('BUFND=4','BUFNI=8')                                        
//*BP13K730 DD DSN=BP13.K730.MATURERQ,DISP=SHR,                                 
//*            AMP=('BUFND=4','BUFNI=8')                                        
//*BP13LF92 DD DSN=&&BP13LF92,DISP=(NEW,PASS),                                  
//*            SPACE=(CYL,(20,10),RLSE),                                        
//*            DCB=(RECFM=FBA,LRECL=133)                                        
//*SYSIN    DD *                                                                
//*_BTO                                                                         
//*SYSPRINT DD SYSOUT=*                                                         
//*SYSDBG   DD SYSOUT=*                                                         
//*SYSDBOUT DD SYSOUT=*                                                         
//*SYSOUT   DD SYSOUT=*                                                         
//*-----------------------------------------------------------------            
//* PRINT FT2T REPORT                                                           
//*-----------------------------------------------------------------            
//*STEP06G  EXEC PGM=IEBGENER,COND=(0,NE)                                       
//*SYSUT1   DD DSN=&&BP13LF92,DISP=(OLD,PASS)                                   
//*SYSUT2   DD SYSOUT=8,DEST=IOM8                                               
//*SYSPRINT DD SYSOUT=*                                                         
//*SYSIN    DD DUMMY                                                            
//*-------------------------------------------------------------------*         
//* BACKUP REPORT TO BP13LF92                                                   
//*-------------------------------------------------------------------*         
//*STEP06H  EXEC PGM=IDCAMS,COND=(0,NE)                                         
//*SYSPRINT DD SYSOUT=*                                                         
//*INPUT1   DD DSN=&&BP13LF92,DISP=(OLD,DELETE)                                 
//*OUTPUT1  DD DSN=BP13.LF92.BP13CF92.D510,DISP=MOD                             
//*                                                                             
//*SYSIN    DD *                                                                
//*     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                  
//*-------------------------------------------------------------------*         
//* INCLUDE SBF CASES ONLY - PARENT/SIBLING CASES                               
//*-------------------------------------------------------------------*         
//*STEP07A  EXEC SORT,COND=(0,NE)                                               
//*SORTIN   DD DSN=BP13.F730.FT2T,DISP=SHR                                      
//*SORTOUT  DD DSN=&&F730SBFP,DISP=(NEW,PASS),                                  
//*            SPACE=(CYL,(20,10),RLSE),                                        
//*            DCB=(RECFM=FB,LRECL=500)                                         
//*SYSIN    DD  *                                                               
//*  SORT FIELDS=(123,8,A),FORMAT=CH                                            
//*  INCLUDE COND=(376,3,CH,EQ,C'SBF',AND,                                      
//*               (500,1,CH,EQ,C'P',OR,500,1,CH,EQ,C'S'))                       
//*---------------------------------------------------------------------        
//* GENERATE FT2T REPORT SHOW SMS, RSL, TRF, MAM & SLS INFOR                    
//* UPDATE K730-NUM-FT2T = Y                                                    
//*---------------------------------------------------------------------        
//*STEP07B  EXEC PGM=BP13CF92,COND=(0,NE)                                       
//*BP13F205 DD DSN=BP13.F205.FT2T,DISP=SHR                                      
//*BP13F730 DD DSN=&&F730SBFP,DISP=(OLD,DELETE)                                 
//*BP13K558 DD DSN=BP13.K558.BP13DPRE,DISP=SHR,                                 
//*            AMP=('BUFND=4','BUFNI=8')                                        
//*BP13K730 DD DSN=BP13.K730.MATURERQ,DISP=SHR,                                 
//*            AMP=('BUFND=4','BUFNI=8')                                        
//*BP13LF92 DD DSN=&&BP13LF92,DISP=(NEW,PASS),                                  
//*            SPACE=(CYL,(20,10),RLSE),                                        
//*            DCB=(RECFM=FBA,LRECL=133)                                        
//*SYSIN    DD *                                                                
//*_SBF                                                                         
//*SYSPRINT DD SYSOUT=*                                                         
//*SYSDBG   DD SYSOUT=*                                                         
//*SYSDBOUT DD SYSOUT=*                                                         
//*SYSOUT   DD SYSOUT=*                                                         
//*-----------------------------------------------------------------            
//* PRINT FT2T REPORT                                                           
//*-----------------------------------------------------------------            
//*STEP07C  EXEC PGM=IEBGENER,COND=(0,NE)                                       
//*SYSUT1   DD DSN=&&BP13LF92,DISP=(OLD,PASS)                                   
//*SYSUT2   DD SYSOUT=8,DEST=IOM8                                               
//*SYSPRINT DD SYSOUT=*                                                         
//*SYSIN    DD DUMMY                                                            
//*-------------------------------------------------------------------*         
//* BACKUP REPORT TO BP13LF92                                                   
//*-------------------------------------------------------------------*         
//*STEP07D  EXEC PGM=IDCAMS,COND=(0,NE)                                         
//*SYSPRINT DD SYSOUT=*                                                         
//*INPUT1   DD DSN=&&BP13LF92,DISP=(OLD,DELETE)                                 
//*OUTPUT1  DD DSN=BP13.LF92.BP13CF92.D510,DISP=MOD                             
//*                                                                             
//*SYSIN    DD *                                                                
//*     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                  
//*-------------------------------------------------------------------*         
//* INCLUDE SBF CASES ONLY - NORMAL CASES                                       
//*-------------------------------------------------------------------*         
//*STEP07E  EXEC SORT,COND=(0,NE)                                               
//*SORTIN   DD DSN=BP13.F730.FT2T,DISP=SHR                                      
//*SORTOUT  DD DSN=&&F730SBFN,DISP=(NEW,PASS),                                  
//*            SPACE=(CYL,(20,10),RLSE),                                        
//*            DCB=(RECFM=FB,LRECL=500)                                         
//*SYSIN    DD  *                                                               
//*  SORT FIELDS=(123,8,A),FORMAT=CH                                            
//*  INCLUDE COND=(376,3,CH,EQ,C'SBF',AND,                                      
//*               (500,1,CH,NE,C'P',AND,500,1,CH,NE,C'S'))                      
//*---------------------------------------------------------------------        
//* GENERATE FT2T REPORT SHOW SMS, RSL, TRF, MAM & SLS INFOR                    
//* UPDATE K730-NUM-FT2T = Y                                                    
//*---------------------------------------------------------------------        
//*STEP07F  EXEC PGM=BP13CF92,COND=(0,NE)                                       
//*BP13F205 DD DSN=BP13.F205.FT2T,DISP=SHR                                      
//*BP13F730 DD DSN=&&F730SBFN,DISP=(OLD,DELETE)                                 
//*BP13K558 DD DSN=BP13.K558.BP13DPRE,DISP=SHR,                                 
//*            AMP=('BUFND=4','BUFNI=8')                                        
//*BP13K730 DD DSN=BP13.K730.MATURERQ,DISP=SHR,                                 
//*            AMP=('BUFND=4','BUFNI=8')                                        
//*BP13LF92 DD DSN=&&BP13LF92,DISP=(NEW,PASS),                                  
//*            SPACE=(CYL,(20,10),RLSE),                                        
//*            DCB=(RECFM=FBA,LRECL=133)                                        
//*SYSIN    DD *                                                                
//*_SBF                                                                         
//*SYSPRINT DD SYSOUT=*                                                         
//*SYSDBG   DD SYSOUT=*                                                         
//*SYSDBOUT DD SYSOUT=*                                                         
//*SYSOUT   DD SYSOUT=*                                                         
//*-----------------------------------------------------------------            
//* PRINT FT2T REPORT                                                           
//*-----------------------------------------------------------------            
//*STEP07G  EXEC PGM=IEBGENER,COND=(0,NE)                                       
//*SYSUT1   DD DSN=&&BP13LF92,DISP=(OLD,PASS)                                   
//*SYSUT2   DD SYSOUT=8,DEST=IOM8                                               
//*SYSPRINT DD SYSOUT=*                                                         
//*SYSIN    DD DUMMY                                                            
//*-------------------------------------------------------------------*         
//* BACKUP REPORT TO BP13LF92                                                   
//*-------------------------------------------------------------------*         
//*STEP07H  EXEC PGM=IDCAMS,COND=(0,NE)                                         
//*SYSPRINT DD SYSOUT=*                                                         
//*INPUT1   DD DSN=&&BP13LF92,DISP=(OLD,DELETE)                                 
//*OUTPUT1  DD DSN=BP13.LF92.BP13CF92.D510,DISP=MOD                             
//*                                                                             
//*SYSIN    DD *                                                                
//*  REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                     
//*-------------------------------------------------------------------*         
//* INCLUDE ROF CASES ONLY - PARENT/SIBLING CASES                               
//*-------------------------------------------------------------------*         
//*STEP08A  EXEC SORT,COND=(0,NE)                                               
//*SORTIN   DD DSN=BP13.F730.FT2T,DISP=SHR                                      
//*SORTOUT  DD DSN=&&F730ROFP,DISP=(NEW,PASS),                                  
//*            SPACE=(CYL,(20,10),RLSE),                                        
//*            DCB=(RECFM=FB,LRECL=500)                                         
//*SYSIN    DD  *                                                               
//*  SORT FIELDS=(123,8,A),FORMAT=CH                                            
//*  INCLUDE COND=(376,3,CH,EQ,C'ROF',AND,                                      
//*               (500,1,CH,EQ,C'P',OR,500,1,CH,EQ,C'S'))                       
//*---------------------------------------------------------------------        
//* GENERATE FT2T REPORT SHOW SMS, RSL, TRF, MAM & SLS INFOR                    
//* UPDATE K730-NUM-FT2T = Y                                                    
//*---------------------------------------------------------------------        
//*STEP08B  EXEC PGM=BP13CF92,COND=(0,NE)                                       
//*BP13F205 DD DSN=BP13.F205.FT2T,DISP=SHR                                      
//*BP13F730 DD DSN=&&F730ROFP,DISP=(OLD,DELETE)                                 
//*BP13K558 DD DSN=BP13.K558.BP13DPRE,DISP=SHR,                                 
//*            AMP=('BUFND=4','BUFNI=8')                                        
//*BP13K730 DD DSN=BP13.K730.MATURERQ,DISP=SHR,                                 
//*            AMP=('BUFND=4','BUFNI=8')                                        
//*BP13LF92 DD DSN=&&BP13LF92,DISP=(NEW,PASS),                                  
//*            SPACE=(CYL,(20,10),RLSE),                                        
//*            DCB=(RECFM=FBA,LRECL=133)                                        
//*SYSIN    DD *                                                                
//*_ROF                                                                         
//*SYSPRINT DD SYSOUT=*                                                         
//*SYSDBG   DD SYSOUT=*                                                         
//*SYSDBOUT DD SYSOUT=*                                                         
//*SYSOUT   DD SYSOUT=*                                                         
//*-----------------------------------------------------------------            
//* PRINT FT2T REPORT                                                           
//*-----------------------------------------------------------------            
//*STEP08C  EXEC PGM=IEBGENER,COND=(0,NE)                                       
//*SYSUT1   DD DSN=&&BP13LF92,DISP=(OLD,PASS)                                   
//*SYSUT2   DD SYSOUT=*                                                         
//*SYSPRINT DD SYSOUT=*                                                         
//*SYSIN    DD DUMMY                                                            
//*-------------------------------------------------------------------*         
//* BACKUP REPORT TO BP13LF92                                                   
//*-------------------------------------------------------------------*         
//*STEP08D  EXEC PGM=IDCAMS,COND=(0,NE)                                         
//*SYSPRINT DD SYSOUT=*                                                         
//*INPUT1   DD DSN=&&BP13LF92,DISP=(OLD,DELETE)                                 
//*OUTPUT1  DD DSN=BP13.LF92.BP13CF92.D510,DISP=MOD                             
//*                                                                             
//*SYSIN    DD *                                                                
//*     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                  
//*-------------------------------------------------------------------*         
//* INCLUDE ROF CASES ONLY - NORMAL CASES                                       
//*-------------------------------------------------------------------*         
//*STEP08E  EXEC SORT,COND=(0,NE)                                               
//*SORTIN   DD DSN=BP13.F730.FT2T,DISP=SHR                                      
//*SORTOUT  DD DSN=&&F730ROFN,DISP=(NEW,PASS),                                  
//*            SPACE=(CYL,(20,10),RLSE),                                        
//*            DCB=(RECFM=FB,LRECL=500)                                         
//*SYSIN    DD  *                                                               
//*  SORT FIELDS=(123,8,A),FORMAT=CH                                            
//*  INCLUDE COND=(376,3,CH,EQ,C'ROF',AND,                                      
//*               (500,1,CH,NE,C'P',AND,500,1,CH,NE,C'S'))                      
//*---------------------------------------------------------------------        
//* GENERATE FT2T REPORT SHOW SMS, RSL, TRF, MAM & SLS INFOR                    
//* UPDATE K730-NUM-FT2T = Y                                                    
//*---------------------------------------------------------------------        
//*STEP08F  EXEC PGM=BP13CF92,COND=(0,NE)                                       
//*BP13F205 DD DSN=BP13.F205.FT2T,DISP=SHR                                      
//*BP13F730 DD DSN=&&F730ROFN,DISP=(OLD,DELETE)                                 
//*BP13K558 DD DSN=BP13.K558.BP13DPRE,DISP=SHR,                                 
//*            AMP=('BUFND=4','BUFNI=8')                                        
//*BP13K730 DD DSN=BP13.K730.MATURERQ,DISP=SHR,                                 
//*            AMP=('BUFND=4','BUFNI=8')                                        
//*BP13LF92 DD DSN=&&BP13LF92,DISP=(NEW,PASS),                                  
//*            SPACE=(CYL,(20,10),RLSE),                                        
//*            DCB=(RECFM=FBA,LRECL=133)                                        
//*SYSIN    DD *                                                                
//*_ROF                                                                         
//*SYSPRINT DD SYSOUT=*                                                         
//*SYSDBG   DD SYSOUT=*                                                         
//*SYSDBOUT DD SYSOUT=*                                                         
//*SYSOUT   DD SYSOUT=*                                                         
//*-----------------------------------------------------------------            
//* PRINT FT2T REPORT                                                           
//*-----------------------------------------------------------------            
//*STEP08G  EXEC PGM=IEBGENER,COND=(0,NE)                                       
//*SYSUT1   DD DSN=&&BP13LF92,DISP=(OLD,PASS)                                   
//*SYSUT2   DD SYSOUT=*                                                         
//*SYSPRINT DD SYSOUT=*                                                         
//*SYSIN    DD DUMMY                                                            
//*-------------------------------------------------------------------*         
//* BACKUP REPORT TO BP13LF92                                                   
//*-------------------------------------------------------------------*         
//*STEP08H  EXEC PGM=IDCAMS,COND=(0,NE)                                         
//*SYSPRINT DD SYSOUT=*                                                         
//*INPUT1   DD DSN=&&BP13LF92,DISP=(OLD,DELETE)                                 
//*OUTPUT1  DD DSN=BP13.LF92.BP13CF92.D510,DISP=MOD                             
//*                                                                             
//*SYSIN    DD *                                                                
//*     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                  
//*-------------------------------------------------------------------*         
//* BACKUP BP13F716/F730 TO ACCUM FILE                                          
//*-------------------------------------------------------------------*         
//STEP12   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F716.DPREQ750,DISP=SHR                                   
//OUTPUT1  DD DSN=BP13.F716.DPREQ750.ACCUM,DISP=MOD                             
//*                                                                             
//INPUT2   DD DSN=BP13.F716.DPREQ747,DISP=SHR                                   
//OUTPUT2  DD DSN=BP13.F716.DPREQ747.ACCUM,DISP=MOD                             
//*                                                                             
//INPUT3   DD DSN=BP13.F716.DPREQ749,DISP=SHR                                   
//OUTPUT3  DD DSN=BP13.F716.DPREQ749.ACCUM,DISP=MOD                             
//*                                                                             
//INPUT4   DD DSN=BP13.F730.FT2T,DISP=SHR                                       
//OUTPUT4  DD DSN=BP13.F730.FT2T.ELIG,DISP=MOD                                  
//*                                                                             
//INPUT5   DD DSN=BP13.F730.FT2T.JSE,DISP=SHR                                   
//OUTPUT5  DD DSN=BP13.F730.FT2T.ELIG,DISP=MOD                                  
//*                                                                             
//INPUT6   DD DSN=BP13.LF92.BP13CF92.D510,DISP=SHR                              
//OUTPUT6  DD DSN=BP13.LF92.BP13CF92.D510.BKUP,DISP=MOD                         
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                     
     REPRO INFILE(INPUT2)  OUTFILE(OUTPUT2)                                     
     REPRO INFILE(INPUT3)  OUTFILE(OUTPUT3)                                     
     REPRO INFILE(INPUT4)  OUTFILE(OUTPUT4)                                     
     REPRO INFILE(INPUT5)  OUTFILE(OUTPUT5)                                     
     REPRO INFILE(INPUT6)  OUTFILE(OUTPUT6)                                     
//*-------------------------------------------------------------------*         
//* INCLUDE EC CASES ONLY - UPDATE FOR FT2T IN REQUEST FILE                     
//*-------------------------------------------------------------------*         
//*STEP13   EXEC SORT,COND=(0,NE)                                               
//*SORTIN   DD DSN=BP13.F730.FT2T,DISP=SHR                                      
//*SORTOUT  DD DSN=&&F730SBFN,DISP=(NEW,PASS),                                  
//*            SPACE=(CYL,(20,10),RLSE),                                        
//*            DCB=(RECFM=FB,LRECL=500)                                         
//*SYSIN    DD  *                                                               
//*  SORT FIELDS=(123,8,A),FORMAT=CH                                            
//*  INCLUDE COND=(376,3,CH,EQ,C'EC ')                                          
//*---------------------------------------------------------------------        
//* GENERATE FT2T REPORT SHOW SMS, RSL, TRF, MAM & SLS INFOR                    
//* UPDATE K730-NUM-FT2T = Y                                                    
//*---------------------------------------------------------------------        
//*STEP14   EXEC PGM=BP13CF92,COND=(0,NE)                                       
//*BP13F205 DD DSN=BP13.F205.FT2T,DISP=SHR                                      
//*BP13F730 DD DSN=&&F730SBFN,DISP=(OLD,DELETE)                                 
//*BP13K558 DD DSN=BP13.K558.BP13DPRE,DISP=SHR,                                 
//*            AMP=('BUFND=4','BUFNI=8')                                        
//*BP13K730 DD DSN=BP13.K730.MATURERQ,DISP=SHR,                                 
//*            AMP=('BUFND=4','BUFNI=8')                                        
//*BP13LF92 DD DUMMY                                                            
//*SYSIN    DD *                                                                
//*SYSPRINT DD SYSOUT=*                                                         
//*SYSDBG   DD SYSOUT=*                                                         
//*SYSDBOUT DD SYSOUT=*                                                         
//*SYSOUT   DD SYSOUT=*                                                         
//*====================================================================         
//*-----------------------------------------------------------------            
//* INCLUDE 2-ROOM FLEXI CASES                                                  
//*-----------------------------------------------------------------            
//STEP15   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F730.MATURERQ.DAILY,DISP=SHR                             
//SORTOUT  DD DSN=&&F730ALL,DISP=(,PASS),                                       
//        UNIT=SYSDA,DCB=(RECFM=FB,LRECL=500,BLKSIZE=0),                        
//        SPACE=(CYL,(80,30),RLSE)                                              
//SYSIN   DD *                                                                  
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
//*-------------------------------------------------------------------*         
//* UPDATE BP13K730 NUM-PPO=A(CURR),B(EX-PPO),C(CURR AND EX-PPO)                
//*-------------------------------------------------------------------*         
//STEP16   EXEC PGM=BP13CD86,COND=(0,NE)                                        
//BP13F595  DD DSN=&&F730ALL,DISP=(OLD,PASS)                                    
//BR10K010 DD DSN=BR10.K010.PTEPPTY,DISP=SHR,                                   
//            AMP=('BUFND=4','BUFNI=8')                                         
//BR10K080 DD DSN=BR10.K080.PTEPPTY.HIST,DISP=SHR,                              
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K730 DD DSN=BP13.K730.MATURERQ,DISP=SHR,                                  
//            AMP=('BUFNI=8','BUFND=4')                                         
//P13F595F DD DSN=BP13.F730.PPOTAG,DISP=OLD                                     
//P13F595N DD DSN=&&F595NOPO,DISP=(,PASS),                                      
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500),                                         
//            SPACE=(CYL,(50,20),RLSE)                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*-----------------------------------------------------------------            
//* INCLUDE 2-ROOM FLEXI & RF CASES                                             
//*-----------------------------------------------------------------            
//STEP17   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F730.MATURERQ.DAILY,DISP=SHR                             
//SORTOUT  DD DSN=&&F730RM2,DISP=(,PASS),                                       
//        UNIT=SYSDA,DCB=(RECFM=FB,LRECL=500,BLKSIZE=0),                        
//        SPACE=(CYL,(80,30),RLSE)                                              
//SYSIN   DD *                                                                  
    SORT FIELDS=(376,3,A,123,8,A),FORMAT=CH                                     
    INCLUDE COND=(211,2,CH,EQ,C'2F',OR,211,2,CH,EQ,C'RF',OR,                    
                  211,2,CH,EQ,C'1F')                                            
//*---------------------------------------------------------------------        
//* REPLACE SALES APPLICATION DATE BY HFE SUBMISSION DATE                       
//* -MATCHED RECORDS   = REPLACED DATE                                          
//* -UNMATCHED RECORDS = ORIGINAL DATE                                          
//*---------------------------------------------------------------------        
//STEP18A  EXEC PGM=SORT,COND=(0,NE)                                            
//SORTJNF1 DD DSN=&&F730RM2,DISP=(OLD,DELETE)                                   
//SORTJNF2 DD DSN=BP13.FECA.HFE,DISP=SHR                                        
//MATCH    DD DSN=&&F73018A1,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(80,30),RLSE),                              
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=0)                                
//UNMATCH  DD DSN=&&F73018A2,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(80,30),RLSE),                              
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=0)                                
//SYSIN DD *                                                                    
   JOINKEYS FILE=F1,FIELDS=(123,8,A)                                            
   JOINKEYS FILE=F2,FIELDS=(1,8,A)                                              
   JOIN UNPAIRED,F1,F2                                                          
   REFORMAT FIELDS=(?,F1:1,500,F2:21,8)                                         
   OPTION COPY                                                                  
   OUTFILE FNAMES=MATCH,INCLUDE=(1,1,CH,EQ,C'B'),                               
             BUILD=(1:2,260,502,8,270,232)                                      
   OUTFILE FNAMES=UNMATCH,INCLUDE=(1,1,CH,EQ,C'1'),                             
             BUILD=(1:2,500)                                                    
/*                                                                              
//SYSUDUMP DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* MERGE BACK ALL RECORDS                                                      
//*---------------------------------------------------------------------        
//STEP18B  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F73018A1,DISP=(OLD,DELETE)                                  
//         DD DSN=&&F73018A2,DISP=(OLD,DELETE)                                  
//SORTOUT  DD DSN=&&F73018B,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,SPACE=(CYL,(80,30),RLSE),                              
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=0)                                
//SYSIN    DD *                                                                 
    SORT FIELDS=(376,3,A,123,8,A),FORMAT=CH                                     
//*------------------------------------------------------------------           
//* VALIDATE ELDERLY SCHEME                                                     
//* UPDATE K730-ELDERLY-TAG( COL 210) = F (FAMILY), S (SINGLE), N (NO)          
//* OUTPUT BP13F740 IS FROM BP13K730                                            
//* - UPDATED WITH PPO, ELDERLY-TAG, FT2T-TAG                                   
//*------------------------------------------------------------------           
//STEP18C  EXEC PGM=BP13CZ2G,COND=(0,NE)                                        
//BP13F730 DD DSN=&&F73018B,DISP=(OLD,DELETE)                                   
//BP17F100 DD DUMMY                                                             
//BP13K825 DD DSN=BP13.K825.REQOCCP,DISP=SHR,                                   
//            AMP=('BUFNI=8','BUFND=4')                                         
//BP13K813 DD DSN=BP13.K813.BTOBE,DISP=SHR,                                     
//            AMP=('BUFNI=8','BUFND=4')                                         
//BP13K730 DD DSN=BP13.K730.MATURERQ,DISP=SHR,                                  
//            AMP=('BUFNI=8','BUFND=4')                                         
//BP13F740 DD DSN=&&F730ELD,DISP=(,PASS),                                       
//        UNIT=SYSDA,DCB=(RECFM=FB,LRECL=500),                                  
//        SPACE=(CYL,(80,30),RLSE)                                              
//P13LZ2GA DD DSN=BP13.LZ2G.SINGLE.BTO,DISP=OLD                                 
//P13LZ2GB DD DSN=BP13.LZ2G.FAMILY.BTO,DISP=OLD                                 
//P13LZ2GC DD DSN=BP13.LZ2G.EXCPTN.BTO,DISP=OLD                                 
//P13LZ2GD DD DSN=BP13.LZ2G.SINGLE.SBF,DISP=OLD                                 
//P13LZ2GE DD DSN=BP13.LZ2G.FAMILY.SBF,DISP=OLD                                 
//P13LZ2GF DD DSN=BP13.LZ2G.EXCPTN.SBF,DISP=OLD                                 
//P13LZ2GG DD DSN=BP13.LZ2G.SINGLE.ROF,DISP=OLD                                 
//P13LZ2GH DD DSN=BP13.LZ2G.FAMILY.ROF,DISP=OLD                                 
//P13LZ2GI DD DSN=BP13.LZ2G.EXCPTN.ROF,DISP=OLD                                 
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*-----------------------------------------------------------------            
//* PRINT SINGLE ELIGIBLE REPORT - BTO                                          
//*-----------------------------------------------------------------            
//STEP18A  EXEC PGM=IEBGENER,COND=(0,NE)                                        
//SYSUT1   DD DSN=BP13.LZ2G.SINGLE.BTO,DISP=SHR                                 
//SYSUT2   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
/*                                                                              
//*-----------------------------------------------------------------            
//* PRINT FAMILY ELIGIBLE REPORT - BTO                                          
//*-----------------------------------------------------------------            
//STEP18B  EXEC PGM=IEBGENER,COND=(0,NE)                                        
//SYSUT1   DD DSN=BP13.LZ2G.FAMILY.BTO,DISP=SHR                                 
//SYSUT2   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
/*                                                                              
//*-----------------------------------------------------------------            
//* PRINT EXCEPTIONAL CASES REPORT - BTO                                        
//*-----------------------------------------------------------------            
//STEP18C  EXEC PGM=IEBGENER,COND=(0,NE)                                        
//SYSUT1   DD DSN=BP13.LZ2G.EXCPTN.BTO,DISP=SHR                                 
//SYSUT2   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
/*                                                                              
//*-----------------------------------------------------------------            
//* PRINT SINGLE ELIGIBLE REPORT - SBF                                          
//*-----------------------------------------------------------------            
//STEP18D  EXEC PGM=IEBGENER,COND=(0,NE)                                        
//SYSUT1   DD DSN=BP13.LZ2G.SINGLE.SBF,DISP=SHR                                 
//SYSUT2   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
/*                                                                              
//*-----------------------------------------------------------------            
//* PRINT FAMILY ELIGIBLE REPORT - SBF                                          
//*-----------------------------------------------------------------            
//STEP18E  EXEC PGM=IEBGENER,COND=(0,NE)                                        
//SYSUT1   DD DSN=BP13.LZ2G.FAMILY.SBF,DISP=SHR                                 
//SYSUT2   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
/*                                                                              
//*-----------------------------------------------------------------            
//* PRINT EXCEPTIONAL CASES REPORT - SBF                                        
//*-----------------------------------------------------------------            
//STEP18F  EXEC PGM=IEBGENER,COND=(0,NE)                                        
//SYSUT1   DD DSN=BP13.LZ2G.EXCPTN.SBF,DISP=SHR                                 
//SYSUT2   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
/*                                                                              
//*-----------------------------------------------------------------            
//* PRINT SINGLE ELIGIBLE REPORT - ROF                                          
//*-----------------------------------------------------------------            
//STEP18G  EXEC PGM=IEBGENER,COND=(0,NE)                                        
//SYSUT1   DD DSN=BP13.LZ2G.SINGLE.ROF,DISP=SHR                                 
//SYSUT2   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
/*                                                                              
//*-----------------------------------------------------------------            
//* PRINT FAMILY ELIGIBLE REPORT - ROF                                          
//*-----------------------------------------------------------------            
//STEP18H  EXEC PGM=IEBGENER,COND=(0,NE)                                        
//SYSUT1   DD DSN=BP13.LZ2G.FAMILY.ROF,DISP=SHR                                 
//SYSUT2   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
/*                                                                              
//*-----------------------------------------------------------------            
//* PRINT EXCEPTIONAL CASES REPORT - ROF                                        
//*-----------------------------------------------------------------            
//STEP18I  EXEC PGM=IEBGENER,COND=(0,NE)                                        
//SYSUT1   DD DSN=BP13.LZ2G.EXCPTN.ROF,DISP=SHR                                 
//SYSUT2   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
/*                                                                              
//*-------------------------------------------------------------------*         
//* BACKUP SINGLE, FAMILY ELIGIBLE & EXCEPTIONAL REPORT TO ACCUM FILE           
//*-------------------------------------------------------------------*         
//STEP18J  EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1A  DD DSN=BP13.LZ2G.SINGLE.BTO,DISP=SHR                                 
//INPUT1B  DD DSN=BP13.LZ2G.SINGLE.SBF,DISP=SHR                                 
//INPUT1C  DD DSN=BP13.LZ2G.SINGLE.ROF,DISP=SHR                                 
//OUTPUT1  DD DSN=BP13.LZ2G.SINGLE,DISP=MOD                                     
//INPUT2A  DD DSN=BP13.LZ2G.FAMILY.BTO,DISP=SHR                                 
//INPUT2B  DD DSN=BP13.LZ2G.FAMILY.SBF,DISP=SHR                                 
//INPUT2C  DD DSN=BP13.LZ2G.FAMILY.ROF,DISP=SHR                                 
//OUTPUT2  DD DSN=BP13.LZ2G.FAMILY,DISP=MOD                                     
//INPUT3A  DD DSN=BP13.LZ2G.EXCPTN.BTO,DISP=SHR                                 
//INPUT3B  DD DSN=BP13.LZ2G.EXCPTN.SBF,DISP=SHR                                 
//INPUT3C  DD DSN=BP13.LZ2G.EXCPTN.ROF,DISP=SHR                                 
//OUTPUT3  DD DSN=BP13.LZ2G.EXCPTN,DISP=MOD                                     
//*                                                                             
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1A)  OUTFILE(OUTPUT1)                                    
     REPRO INFILE(INPUT1B)  OUTFILE(OUTPUT1)                                    
     REPRO INFILE(INPUT1C)  OUTFILE(OUTPUT1)                                    
     REPRO INFILE(INPUT2A)  OUTFILE(OUTPUT2)                                    
     REPRO INFILE(INPUT2B)  OUTFILE(OUTPUT2)                                    
     REPRO INFILE(INPUT2C)  OUTFILE(OUTPUT2)                                    
     REPRO INFILE(INPUT3A)  OUTFILE(OUTPUT3)                                    
     REPRO INFILE(INPUT3B)  OUTFILE(OUTPUT3)                                    
     REPRO INFILE(INPUT3C)  OUTFILE(OUTPUT3)                                    
//*-----------------------------------------------------------------            
//* INCLUDE ELDERLY-TAG ( COL 210) = F (FAMILY), S (SINGLE)                     
//*-----------------------------------------------------------------            
//STEP19   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F730ELD,DISP=(OLD,PASS)                                     
//SORTOUT  DD DSN=BP13.F730.ELDERLY,DISP=OLD                                    
//SYSIN   DD *                                                                  
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
    INCLUDE COND=(210,1,CH,EQ,C'F',OR,                                          
                  210,1,CH,EQ,C'S')                                             
//*---------------------------------------------------------------------        
//* BP13F558 - AFTER MACTHED WITH SMS/RSL/TRF/DEBARMENT                         
//*---------------------------------------------------------------------        
//STEP20   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F558.UPGOCCP,DISP=SHR                                    
//SORTOUT  DD DSN=&&F558MRGE,DISP=(,PASS),                                      
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600),                           
//            UNIT=SYSDA,SPACE=(CYL,(20,30),RLSE)                               
//SYSIN     DD  *                                                               
   SORT FIELDS=(1,17,A),FORMAT=CH                                               
//*-----------------------------------------------------------------            
//* INCLUDE ELDERLY-TAG ( COL 210) = F (FAMILY), S (SINGLE)                     
//* INCLUDE HHTY=G, FT2T NOT = Y                                                
//*-----------------------------------------------------------------            
//STEP21   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F730.ELDERLY,DISP=SHR                                    
//SORTOUT  DD DSN=&&F730ST,DISP=(,PASS),                                        
//        UNIT=SYSDA,DCB=(RECFM=FB,LRECL=500),                                  
//        SPACE=(CYL,(80,30),RLSE)                                              
//SYSIN   DD *                                                                  
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
    INCLUDE COND=(116,1,CH,EQ,C'G',AND,                                         
                  475,1,CH,NE,C'Y')                                             
//*---------------------------------------------------------------------        
//* DETERMINE N-TIMER                                                           
//* DEBARMENT CODE 33 OR > 2 DP FLATS                                           
//* UPDATE N-TIMER = Y/N TO BP13K730                                            
//*---------------------------------------------------------------------        
//STEP22   EXEC PGM=BP13CZ2H,COND=(0,NE)                                        
//BP13F730 DD DSN=&&F730ST,DISP=(OLD,PASS)                                      
//BP13F558 DD DSN=&&F558MRGE,DISP=(OLD,PASS)                                    
//BP13K558 DD DSN=BP13.K558.BP13DPRE,DISP=SHR                                   
//P13F558O DD DSN=BP13.F558.UPGOCCP,DISP=OLD,                                   
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600),                           
//            SPACE=(CYL,(20,30),RLSE)                                          
//BP13TMP  DD DSN=BP13.F558.NTIMER.TEMP,DISP=OLD,                               
//            DCB=(RECFM=FB,LRECL=50,BLKSIZE=0),                                
//            SPACE=(CYL,(20,30),RLSE)                                          
//P13LZ2HA DD DSN=BP13.LZ2H.NTIMER.BTO,DISP=OLD                                 
//P13LZ2HB DD DSN=BP13.LZ2H.INVALID.BTO,DISP=OLD                                
//P13LZ2HC DD DSN=BP13.LZ2H.NTIMER.SBF,DISP=OLD                                 
//P13LZ2HD DD DSN=BP13.LZ2H.INVALID.SBF,DISP=OLD                                
//P13LZ2HE DD DSN=BP13.LZ2H.NTIMER.ROF,DISP=OLD                                 
//P13LZ2HF DD DSN=BP13.LZ2H.INVALID.ROF,DISP=OLD                                
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*-------------------------------------------------------------------*         
//* BACKUP VALID AND INVALID NTIMER REPORT TO ACCUM FILE                        
//*-------------------------------------------------------------------*         
//STEP22G  EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1A  DD DSN=BP13.LZ2H.NTIMER.BTO,DISP=SHR                                 
//INPUT1B  DD DSN=BP13.LZ2H.NTIMER.SBF,DISP=SHR                                 
//INPUT1C  DD DSN=BP13.LZ2H.NTIMER.ROF,DISP=SHR                                 
//OUTPUT1  DD DSN=BP13.LZ2H.NTIMER,DISP=MOD                                     
//INPUT2A  DD DSN=BP13.LZ2H.INVALID.BTO,DISP=SHR                                
//INPUT2B  DD DSN=BP13.LZ2H.INVALID.SBF,DISP=SHR                                
//INPUT2C  DD DSN=BP13.LZ2H.INVALID.ROF,DISP=SHR                                
//OUTPUT2  DD DSN=BP13.LZ2H.INVALID,DISP=MOD                                    
//*                                                                             
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1A)  OUTFILE(OUTPUT1)                                    
     REPRO INFILE(INPUT1B)  OUTFILE(OUTPUT1)                                    
     REPRO INFILE(INPUT1C)  OUTFILE(OUTPUT1)                                    
     REPRO INFILE(INPUT2A)  OUTFILE(OUTPUT2)                                    
     REPRO INFILE(INPUT2B)  OUTFILE(OUTPUT2)                                    
     REPRO INFILE(INPUT2C)  OUTFILE(OUTPUT2)                                    
//*---------------------------------------------------------------------        
//* BP13F558 - AFTER MACTHED WITH SMS/RSL/TRF/DEBARMENT                         
//*---------------------------------------------------------------------        
//STEP23   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F558.NTIMER.TEMP,DISP=SHR                                
//SORTOUT  DD DSN=&&BP13TEMP,DISP=(,PASS),                                      
//            DCB=(RECFM=FB,LRECL=50,BLKSIZE=0),                                
//            UNIT=SYSDA,SPACE=(CYL,(20,30),RLSE)                               
//SYSIN     DD  *                                                               
   SORT FIELDS=(18,3,A,1,8,A),FORMAT=CH                                         
   SUM FIELDS=NONE                                                              
//*---------------------------------------------------------------------        
//* UPDATE N-TIMER TO BP13K730                                                  
//*---------------------------------------------------------------------        
//*STEP24   EXEC PGM=BP13CZ2I,COND=(0,NE)                                       
//*BP13TMP  DD DSN=&&BP13TEMP,DISP=(OLD,PASS)                                   
//*BP13K558 DD DSN=BP13.K558.BP13DPRE,DISP=SHR,                                 
//*            AMP=('BUFNI=8','BUFND=4')                                        
//*BP13K730 DD DSN=BP13.K730.MATURERQ,DISP=SHR,                                 
//*            AMP=('BUFNI=8','BUFND=4')                                        
//*P13LZ2IA DD DSN=BP13.LZ2I.NTIMER.BTO,DISP=OLD                                
//*P13LZ2IB DD DSN=BP13.LZ2I.INVALID.BTO,DISP=OLD                               
//*P13LZ2IC DD DSN=BP13.LZ2I.NTIMER.SBF,DISP=OLD                                
//*P13LZ2ID DD DSN=BP13.LZ2I.INVALID.SBF,DISP=OLD                               
//*P13LZ2IE DD DSN=BP13.LZ2I.NTIMER.ROF,DISP=OLD                                
//*P13LZ2IF DD DSN=BP13.LZ2I.INVALID.ROF,DISP=OLD                               
//*SYSPRINT DD SYSOUT=*                                                         
//*SYSDBG   DD SYSOUT=*                                                         
//*SYSDBOUT DD SYSOUT=*                                                         
//*SYSOUT   DD SYSOUT=*                                                         
//*-----------------------------------------------------------------            
//* PRINT VALID NTIMERS CASES REPORT - BTO                                      
//*-----------------------------------------------------------------            
//*STEP24A  EXEC PGM=IEBGENER,COND=(0,NE)                                       
//*SYSUT1   DD DSN=BP13.LZ2I.NTIMER.BTO,DISP=SHR                                
//*SYSUT2   DD SYSOUT=8,DEST=IOM8                                               
//*SYSPRINT DD SYSOUT=*                                                         
//*SYSIN    DD DUMMY                                                            
//*                                                                             
//*-----------------------------------------------------------------            
//* PRINT INVALID CASES REPORT - BTO                                            
//*-----------------------------------------------------------------            
//*STEP24B  EXEC PGM=IEBGENER,COND=(0,NE)                                       
//*SYSUT1   DD DSN=BP13.LZ2I.INVALID.BTO,DISP=SHR                               
//*SYSUT2   DD SYSOUT=8,DEST=IOM8                                               
//*SYSPRINT DD SYSOUT=*                                                         
//*SYSIN    DD DUMMY                                                            
//*                                                                             
//*-----------------------------------------------------------------            
//* PRINT VALID NTIMERS CASES REPORT - SBF                                      
//*-----------------------------------------------------------------            
//*STEP24C  EXEC PGM=IEBGENER,COND=(0,NE)                                       
//*SYSUT1   DD DSN=BP13.LZ2I.NTIMER.SBF,DISP=SHR                                
//*SYSUT2   DD SYSOUT=8,DEST=IOM8                                               
//*SYSPRINT DD SYSOUT=*                                                         
//*SYSIN    DD DUMMY                                                            
//*                                                                             
//*-----------------------------------------------------------------            
//* PRINT INVALID CASES REPORT - SBF                                            
//*-----------------------------------------------------------------            
//*STEP24D  EXEC PGM=IEBGENER,COND=(0,NE)                                       
//*SYSUT1   DD DSN=BP13.LZ2I.INVALID.SBF,DISP=SHR                               
//*SYSUT2   DD SYSOUT=8,DEST=IOM8                                               
//*SYSPRINT DD SYSOUT=*                                                         
//*SYSIN    DD DUMMY                                                            
//*                                                                             
//*-----------------------------------------------------------------            
//* PRINT VALID NTIMERS CASES REPORT - ROF                                      
//*-----------------------------------------------------------------            
//*STEP24E  EXEC PGM=IEBGENER,COND=(0,NE)                                       
//*SYSUT1   DD DSN=BP13.LZ2I.NTIMER.ROF,DISP=SHR                                
//*SYSUT2   DD SYSOUT=*                                                         
//*SYSPRINT DD SYSOUT=*                                                         
//*SYSIN    DD DUMMY                                                            
//*                                                                             
//*-----------------------------------------------------------------            
//* PRINT INVALID CASES REPORT - ROF                                            
//*-----------------------------------------------------------------            
//*STEP24F  EXEC PGM=IEBGENER,COND=(0,NE)                                       
//*SYSUT1   DD DSN=BP13.LZ2I.INVALID.ROF,DISP=SHR                               
//*SYSUT2   DD SYSOUT=*                                                         
//*SYSPRINT DD SYSOUT=*                                                         
//*SYSIN    DD DUMMY                                                            
//*                                                                             
//*-------------------------------------------------------------------*         
//* BACKUP VALID AND INVALID NTIMER REPORT TO ACCUM FILE                        
//*-------------------------------------------------------------------*         
//*STEP24G  EXEC PGM=IDCAMS,COND=(0,NE)                                         
//*SYSPRINT DD SYSOUT=*                                                         
//*INPUT1A  DD DSN=BP13.LZ2I.NTIMER.BTO,DISP=SHR                                
//*INPUT1B  DD DSN=BP13.LZ2I.NTIMER.SBF,DISP=SHR                                
//*INPUT1C  DD DSN=BP13.LZ2I.NTIMER.ROF,DISP=SHR                                
//*OUTPUT1  DD DSN=BP13.LZ2I.NTIMER,DISP=MOD                                    
//*INPUT2A  DD DSN=BP13.LZ2I.INVALID.BTO,DISP=SHR                               
//*INPUT2B  DD DSN=BP13.LZ2I.INVALID.SBF,DISP=SHR                               
//*INPUT2C  DD DSN=BP13.LZ2I.INVALID.ROF,DISP=SHR                               
//*OUTPUT2  DD DSN=BP13.LZ2I.INVALID,DISP=MOD                                   
//*                                                                             
//*SYSIN    DD *                                                                
//*     REPRO INFILE(INPUT1A)  OUTFILE(OUTPUT1)                                 
//*     REPRO INFILE(INPUT1B)  OUTFILE(OUTPUT1)                                 
//*     REPRO INFILE(INPUT1C)  OUTFILE(OUTPUT1)                                 
//*     REPRO INFILE(INPUT2A)  OUTFILE(OUTPUT2)                                 
//*     REPRO INFILE(INPUT2B)  OUTFILE(OUTPUT2)                                 
//*     REPRO INFILE(INPUT2C)  OUTFILE(OUTPUT2)                                 
//*--------------------------------------------------------------------         
//* ACCUM CASES UPDATED AS ELDERLY                                              
//*--------------------------------------------------------------------         
//STEP25   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F730.ELDERLY,DISP=SHR                                    
//OUTPUT1  DD DSN=BP13.F730.ELDERLY.ACCUM,DISP=MOD                              
//INPUT2   DD DSN=BP13.F558.NTIMER.TEMP,DISP=SHR                                
//OUTPUT2  DD DSN=BP13.F558.NTIMER.ACCUM,DISP=MOD                               
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
   REPRO INFILE(INPUT2)  OUTFILE(OUTPUT2)                                       
//*===================================================================*         
//* DETERMINE FTS - PREVIOUSLY RUN UNDER BP13DFT2                               
//* DETERMINE SINGLE SCHEME                                                     
//*===================================================================*         
//*---------------------------------------------------------------------        
//* COMPARE THE DAILY FILE WITH THE ACCUMULATED VSAM FILE.                      
//* SORT OUT ONLY CASES IN THE DAILY FILE                                       
//*---------------------------------------------------------------------        
//STEP26   EXEC PGM=BP13C161,COND=(0,NE)                                        
//BP13F500 DD DSN=BP13.F730.MATURERQ.DAILY,DISP=SHR                             
//BP13K730 DD DSN=BP13.K730.MATURERQ,DISP=SHR,                                  
//            AMP=('BUFNI=8','BUFND=4')                                         
//BP13F730 DD DSN=&&BP13F730,DISP=(,PASS),                                      
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            SPACE=(CYL,(60,20),RLSE)                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*------------------------------------------------------------------           
//* SORT OUT FTS                                                                
//*------------------------------------------------------------------           
//STEP27   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&BP13F730,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F730SIGL,DISP=(,PASS),                                      
//        UNIT=SYSDA,DCB=(RECFM=FB,LRECL=500),                                  
//        SPACE=(CYL,(80,30),RLSE)                                              
//SYSIN   DD *                                                                  
    SORT FIELDS=(376,3,A,123,8,A),FORMAT=CH                                     
    INCLUDE COND=(213,3,CH,EQ,C'FTS')                                           
//*---------------------------------------------------------------------        
//* REPLACE SALES APPLICATION DATE BY HFE SUBMISSION DATE                       
//* -MATCHED RECORDS   = REPLACED DATE                                          
//* -UNMATCHED RECORDS = ORIGINAL DATE                                          
//*---------------------------------------------------------------------        
//STEP28A  EXEC PGM=SORT,COND=(0,NE)                                            
//SORTJNF1 DD DSN=&&F730SIGL,DISP=(OLD,PASS)                                    
//SORTJNF2 DD DSN=BP13.FECA.HFE,DISP=SHR                                        
//MATCH    DD DSN=&&F73028A1,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(80,30),RLSE),                              
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=0)                                
//UNMATCH  DD DSN=&&F73028A2,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(80,30),RLSE),                              
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=0)                                
//SYSIN DD *                                                                    
   JOINKEYS FILE=F1,FIELDS=(123,8,A)                                            
   JOINKEYS FILE=F2,FIELDS=(1,8,A)                                              
   JOIN UNPAIRED,F1,F2                                                          
   REFORMAT FIELDS=(?,F1:1,500,F2:21,8)                                         
   OPTION COPY                                                                  
   OUTFILE FNAMES=MATCH,INCLUDE=(1,1,CH,EQ,C'B'),                               
             BUILD=(1:2,260,502,8,270,232)                                      
   OUTFILE FNAMES=UNMATCH,INCLUDE=(1,1,CH,EQ,C'1'),                             
             BUILD=(1:2,500)                                                    
/*                                                                              
//SYSUDUMP DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* MERGE BACK ALL RECORDS                                                      
//*---------------------------------------------------------------------        
//STEP28B  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F73028A1,DISP=(OLD,DELETE)                                  
//         DD DSN=&&F73028A2,DISP=(OLD,DELETE)                                  
//SORTOUT  DD DSN=&&F73028B,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,SPACE=(CYL,(80,30),RLSE),                              
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=0)                                
//SYSIN    DD *                                                                 
    SORT FIELDS=(376,3,A,123,8,A),FORMAT=CH                                     
//*------------------------------------------------------------------           
//* VALIDATE SINGLE SCHEME                                                      
//*------------------------------------------------------------------           
//STEP28C  EXEC PGM=BP13CZ2F,COND=(0,NE)                                        
//BP13F730 DD DSN=&&F73028B,DISP=(OLD,DELETE)                                   
//BP13K825 DD DSN=BP13.K825.REQOCCP,DISP=SHR,                                   
//            AMP=('BUFNI=8','BUFND=4')                                         
//BP13K813 DD DSN=BP13.K813.BTOBE,DISP=SHR,                                     
//            AMP=('BUFNI=8','BUFND=4')                                         
//BP13LCZA DD DSN=&&LZ2FELIG,DISP=(,PASS),                                      
//        UNIT=SYSDA,DCB=(RECFM=FBA,LRECL=133),                                 
//        SPACE=(CYL,(20,10),RLSE)                                              
//BP13LCZB DD DSN=&&LZ2FNONE,DISP=(,PASS),                                      
//        UNIT=SYSDA,DCB=(RECFM=FBA,LRECL=133),                                 
//        SPACE=(CYL,(20,10),RLSE)                                              
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*-----------------------------------------------------------------            
//* PRINT SINGLE ELIGIBLE REPORT                                                
//*-----------------------------------------------------------------            
//STEP29   EXEC PGM=IEBGENER,COND=(0,NE)                                        
//SYSUT1   DD DSN=&&LZ2FELIG,DISP=(OLD,PASS)                                    
//SYSUT2   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
/*                                                                              
//*-----------------------------------------------------------------            
//* PRINT SINGLE NOR ELIGIBLE REPORT                                            
//*-----------------------------------------------------------------            
//STEP30   EXEC PGM=IEBGENER,COND=(0,NE)                                        
//SYSUT1   DD DSN=&&LZ2FNONE,DISP=(OLD,PASS)                                    
//SYSUT2   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
/*                                                                              
//*-------------------------------------------------------------------*         
//* BACKUP SINGLE ELIG/NOT ELIGIBLE REPORT TO ACCUM FILE                        
//*-------------------------------------------------------------------*         
//STEP31   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=&&LZ2FELIG,DISP=(OLD,PASS)                                    
//         DD DSN=&&LZ2FNONE,DISP=(OLD,PASS)                                    
//OUTPUT1  DD DSN=BP13.LZ2F.ELIG,DISP=MOD                                       
//*                                                                             
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                     
//*-------------------------------------------------------------------*         
//* OMIT ROF CASES FOR HALF-IDP                                                 
//*-------------------------------------------------------------------*         
//STEP32A  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F730.MATURERQ.DAILY,DISP=SHR                             
//SORTOUT  DD DSN=&&F730NROF,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            SPACE=(CYL,(60,20),RLSE)                                          
//SYSIN    DD *                                                                 
  SORT FIELDS=(123,8,A),FORMAT=CH                                               
  OMIT COND=(376,3,CH,EQ,C'ROF')                                                
//*---------------------------------------------------------------------        
//* COMPARE THE DAILY FILE WITH THE ACCUMULATED VSAM FILE.                      
//* SORT OUT ONLY CASES IN THE DAILY FILE                                       
//*---------------------------------------------------------------------        
//STEP32B  EXEC PGM=BP13C161,COND=(0,NE)                                        
//BP13F500 DD DSN=&&F730NROF,DISP=(OLD,DELETE)                                  
//BP13K730 DD DSN=BP13.K730.MATURERQ,DISP=SHR                                   
//BP13F730 DD DSN=&&F730HIDP,DISP=(,PASS),                                      
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            SPACE=(CYL,(60,20),RLSE)                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* REPLACE SALES APPLICATION DATE BY HFE SUBMISSION DATE                       
//* -MATCHED RECORDS   = REPLACED DATE                                          
//* -UNMATCHED RECORDS = ORIGINAL DATE                                          
//*---------------------------------------------------------------------        
//STEP33A  EXEC PGM=SORT,COND=(0,NE)                                            
//SORTJNF1 DD DSN=&&F730HIDP,DISP=(OLD,DELETE)                                  
//SORTJNF2 DD DSN=BP13.FECA.HFE,DISP=SHR                                        
//MATCH    DD DSN=&&F73033A1,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(60,20),RLSE),                              
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=0)                                
//UNMATCH  DD DSN=&&F73033A2,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(60,20),RLSE),                              
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=0)                                
//SYSIN DD *                                                                    
   JOINKEYS FILE=F1,FIELDS=(123,8,A)                                            
   JOINKEYS FILE=F2,FIELDS=(1,8,A)                                              
   JOIN UNPAIRED,F1,F2                                                          
   REFORMAT FIELDS=(?,F1:1,500,F2:21,8)                                         
   OPTION COPY                                                                  
   OUTFILE FNAMES=MATCH,INCLUDE=(1,1,CH,EQ,C'B'),                               
             BUILD=(1:2,260,502,8,270,232)                                      
   OUTFILE FNAMES=UNMATCH,INCLUDE=(1,1,CH,EQ,C'1'),                             
             BUILD=(1:2,500)                                                    
/*                                                                              
//SYSUDUMP DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* MERGE BACK ALL RECORDS                                                      
//*---------------------------------------------------------------------        
//STEP33B  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F73033A1,DISP=(OLD,DELETE)                                  
//         DD DSN=&&F73033A2,DISP=(OLD,DELETE)                                  
//SORTOUT  DD DSN=&&F73033B,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,SPACE=(CYL,(60,20),RLSE),                              
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=0)                                
//SYSIN    DD *                                                                 
   SORT FIELDS=(123,8,A),FORMAT=CH                                              
//*-----------------------------------------------------------------            
//* DETERMINE HALF-IDP (S/R),COPY HALF-IDP='S' FROM BP13C528                    
//*---------------------------------------------------------------------        
//STEP33C  EXEC PGM=BP13CZ29,COND=(0,NE)                                        
//BP13F730 DD DSN=&&F73033B,DISP=(OLD,DELETE)                                   
//BP13K80A DD DSN=BP13.K80A.FLATINFO,DISP=SHR,                                  
//           AMP=('BUFND=8','BUFNI=4')                                          
//BP13K730 DD DSN=BP13.K730.MATURERQ,DISP=SHR,                                  
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13K825 DD DSN=BP13.K825.REQOCCP,DISP=SHR,                                   
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13K813 DD DSN=BP13.K813.BTOBE,DISP=SHR,                                     
//            AMP=('BUFND=8','BUFNI=4')                                         
//AB03K030 DD DSN=AB03.K030.SALEMAST,DISP=SHR,                                  
//            AMP=('BUFND=8','BUFNI=4')                                         
//AB03K080 DD DSN=AB03.K080.UINACC,DISP=SHR,                                    
//            AMP=('BUFND=8','BUFNI=4')                                         
//AB03K081 DD DSN=AB03.K080.PATH1,DISP=SHR,                                     
//            AMP=('BUFND=8','BUFNI=4')                                         
//AB03K700 DD DSN=AB03.K700.CUSTFILE,DISP=SHR,                                  
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13LZ19 DD DSN=BP13.LZ29.BP13CZ29,DISP=MOD                                   
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*--------------------------------------------------------------------         
//* SORT BY SALES MODE, BALLOT QTR, REGNO, NRIC                                 
//*--------------------------------------------------------------------         
//STEP34A  EXEC SORT,COND=(0,NE)                                                
//SYSOUT   DD SYSOUT=*                                                          
//SORTIN   DD DSN=BP13.L506.DECEASED,DISP=SHR                                   
//SORTOUT  DD DSN=&&BP13L506,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(10,5),RLSE),                               
//            DCB=(BLKSIZE=0,LRECL=50,RECFM=FB)                                 
//SYSIN    DD *                                                                 
    SORT FIELDS=(18,9,A,1,17,A),FORMAT=CH                                       
//*---------------------------------------------------------------------        
//* GENERATE REPORT HIGHLIGHTING APPLICATIONS CONTAINING NRICS                  
//* BELONGING TO DECEASED PERSON(S)                                             
//*--------------------------------------------------------------------         
//STEP34B  EXEC PGM=BP13CB35,COND=(0,NE)                                        
//BP13L506 DD DSN=&&BP13L506,DISP=(OLD,DELETE)                                  
//BP13K730 DD DSN=BP13.K730.MATURERQ,DISP=SHR,                                  
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13LB35 DD SYSOUT=8,DEST=IOM8                                                
//P13LB35A DD DSN=BP13.CLOUD.BP13DFT2.LB35A,DISP=(NEW,CATLG),                   
//            DCB=(BLKSIZE=0,LRECL=500,RECFM=FB),                               
//            SPACE=(CYL,(50,50),RLSE),DATACLAS=MULTIVOL                        
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* SORT BY ALLO CAT, DTE BALLOT, NT, FT AND REGNO                              
//* OMIT APPLICATIONS WITH HOUSEHOLD = 'G' AND FT2T NOT = 'Y'                   
//*---------------------------------------------------------------------        
//STEP35   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F730.MATURERQ.DAILY,DISP=SHR                             
//SORTOUT  DD DSN=&&F730CB37,DISP=(NEW,PASS),                                   
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            SPACE=(CYL,(10,5),RLSE)                                           
//SYSIN    DD *                                                                 
    SORT FIELDS=(376,3,A,334,6,A,187,3,A,211,2,A,123,8,A),FORMAT=CH             
    OMIT COND=(116,1,CH,EQ,C'G',&,475,1,CH,NE,C'Y')                             
//*---------------------------------------------------------------------        
//* GENERATE REPORT ON SPOUSE OF WIDOWED PERSON IN SALES APPLICATION            
//*---------------------------------------------------------------------        
//STEP36   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE)                            
//BP13F730 DD DSN=&&F730CB37,DISP=(OLD,DELETE)                                  
//BP13K825 DD DSN=BP13.K825.REQOCCP,DISP=SHR,                                   
//            AMP=('BUFNI=8','BUFND=4')                                         
//BE01F371 DD DSN=BE01.F371.MRGENQRY.PRCS.BP13,DISP=OLD,                        
//            SPACE=(1,(30,5)),AVGREC=M,DSORG=PS,                               
//            RECFM=FB,LRECL=3550,BLKSIZE=0                                     
//BE01F372 DD DSN=BE01.F372.MRGENQRY.INV.BP13,DISP=OLD,                         
//            SPACE=(1,(30,5)),AVGREC=M,DSORG=PS,                               
//            RECFM=FB,LRECL=3550,BLKSIZE=0                                     
//BE01F373 DD DSN=BE01.F373.MRGENQRY.LOG.BP13,DISP=OLD,                         
//            SPACE=(1,(60,10)),AVGREC=M,DSORG=PS,                              
//            RECFM=FB,LRECL=3800,BLKSIZE=0                                     
//BP13LB37 DD SYSOUT=8,DEST=IOM8                                                
//SYSPRINT DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
 DSN SYSTEM(DSN)                                                                
 RUN PROGRAM(BP13CB37) PLAN(BP13PCC) -                                          
     LIB('BP13.BATCH.LOADCOB')                                                  
 END                                                                            
/*                                                                              
//*---------------------------------------------------------------------        
//* DETERMINE FT2T FOR JOINT SINGLE, ELIG-SCH=JSE                               
//*-------------------------------------------------------------------*         
//* INCLUDE BTO CASES ONLY - PARENT/SIBLING CASES                               
//*-------------------------------------------------------------------*         
//*STEP37   EXEC SORT,COND=(0,NE)                                               
//*SORTIN   DD DSN=BP13.F730.FT2T.JSE,DISP=SHR                                  
//*SORTOUT  DD DSN=&&F730BJSE,DISP=(NEW,PASS),                                  
//*            SPACE=(CYL,(20,10),RLSE),                                        
//*            DCB=(RECFM=FB,LRECL=500)                                         
//*SYSIN    DD  *                                                               
//*  SORT FIELDS=(123,8,A),FORMAT=CH                                            
//*  INCLUDE COND=(500,1,CH,EQ,C'P',OR,500,1,CH,EQ,C'S')                        
//*---------------------------------------------------------------------        
//* GENERATE FT2T REPORT SHOW SMS, RSL, TRF, MAM & SLS INFOR                    
//* UPDATE K730-NUM-FT2T = E FOR JOINT SINGLE                                   
//*---------------------------------------------------------------------        
//*STEP38   EXEC PGM=BP13CF92,COND=(0,NE)                                       
//*BP13F205 DD DSN=BP13.F205.FT2T,DISP=SHR                                      
//*BP13F730 DD DSN=&&F730BJSE,DISP=(OLD,DELETE)                                 
//*BP13K558 DD DSN=BP13.K558.BP13DPRE,DISP=SHR,                                 
//*            AMP=('BUFND=4','BUFNI=8')                                        
//*BP13K730 DD DSN=BP13.K730.MATURERQ,DISP=SHR,                                 
//*            AMP=('BUFND=4','BUFNI=8')                                        
//*BP13LF92 DD DSN=&&LF92JSE,DISP=(NEW,PASS),                                   
//*            SPACE=(CYL,(20,10),RLSE),                                        
//*            DCB=(RECFM=FBA,LRECL=133)                                        
//*SYSIN    DD *                                                                
//*SYSPRINT DD SYSOUT=*                                                         
//*SYSDBG   DD SYSOUT=*                                                         
//*SYSDBOUT DD SYSOUT=*                                                         
//*SYSOUT   DD SYSOUT=*                                                         
//*-----------------------------------------------------------------            
//* PRINT FT2T REPORT                                                           
//*-----------------------------------------------------------------            
//*STEP39   EXEC PGM=IEBGENER,COND=(0,NE)                                       
//*SYSUT1   DD DSN=&&LF92JSE,DISP=(OLD,PASS)                                    
//*SYSUT2   DD SYSOUT=*                                                         
//*SYSPRINT DD SYSOUT=*                                                         
//*SYSIN    DD DUMMY                                                            
//*-------------------------------------------------------------------*         
//* BACKUP REPORT TO BP13LF92                                                   
//*-------------------------------------------------------------------*         
//*STEP40   EXEC PGM=IDCAMS,COND=(0,NE)                                         
//*SYSPRINT DD SYSOUT=*                                                         
//*INPUT1   DD DSN=&&LF92JSE,DISP=(OLD,DELETE)                                  
//*OUTPUT1  DD DSN=BP13.LF92.BP13CF92.JSE,DISP=MOD                              
//*                                                                             
//*SYSIN    DD *                                                                
//*     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                  
