//BP13A516 JOB (BP13P),'BP13A516',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//       NOTIFY=CSD0071,TYPRUN=HOLD                                             
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//******************************************************************            
//* CHG REF  BY   DATE     DESCRIPTION                                          
//* -------- ---- -------- -----------                                          
//* BP130652 NOR  19990824 EXPAND F500,F510,F520,K520 RECL 300-500              
//* BP130857 SSS  20000626 ADD GROUPID                                          
//* BP132317 ROM  20030318 JB FOR BTO DEL BP13U738, ASSIGN SEQNO                
//* BP132546 YCH  11062004 INCLUDE STORCLAS(PRODRLS) & LOG(NONE)                
//* BP132818 BA3  26012006 TO CHANGE SORTING OF REF NO FROM 6 BYTES             
//*                        TO 8 BYTES.                                          
//******************************************************************            
//*  SEND DYNAMIC JOB DESCRIPTOR ENTRIES AHEAD OF THE PRINT DATASET             
//*-----------------------------------------------------------------            
//PRT01    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
$DJDE$ JDE=BP13D,JDL=BP13,END;                                                  
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALAP1A                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*---------------------------------------------------------------------        
//* SORT THE BALLOT FILE IN RANDOM NUMBER ORDER                                 
//*---------------------------------------------------------------------        
//STEP00   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K510.RANQUEUE,DISP=SHR,                                  
//            AMP=('BUFND=8','BUFNI=4')                                         
//SORTOUT  DD DSN=&&P13F510,DISP=(,PASS),                                       
//         UNIT=(SYSDA,3),SPACE=(CYL,(80,10),RLSE),                             
//         DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                               
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD  *                                                                
   SORT FIELDS=(123,8,A),FORMAT=CH                                              
//*---------------------------------------------------------------------        
//* TO CREATE THE BALLOT FILE & TO ENSURE THAT NO DUPLICATE RANDOM NO           
//* BY USINF DEFINE VSAM BALLOT FILE                                            
//*---------------------------------------------------------------------        
//STEP01   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT    DD DSN=&&P13F510,DISP=(OLD,PASS)                                     
//SYSIN    DD *                                                                 
         DEL (BP13.K520.BALLOT) CL PURGE                                        
         DEF CL (NAME(BP13.K520.BALLOT)          -                              
                 CYL(80 10)                       -                             
                 UNIQUE                          -                              
                 SPEED                           -                              
                 STORCLAS(PRODRLS)               -                              
                 LOG(NONE)                       -                              
                 SHR(2 3))                       -                              
                 DATA                            -                              
                 (NAME(BP13.K520.BALLOT.DATA)    -                              
                 KEYS(8 122)                     -                              
                 RECSZ(500 500)                  -                              
                 FSPC(10 10)                     -                              
                 CISZ(4096))                                                    
         IF LASTCC = 0 THEN                      -                              
           REPRO IFILE(INPUT)                    -                              
                 ODS(BP13.K520.BALLOT)                                          
//*---------------------------------------------------------------------        
//*  REPRO VSAM FILE TO SEQUENTIAL FILES                                        
//*--------------------------------------------------------------------         
//STEP02   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT2   DD DSN=BP13.K520.BALLOT,DISP=SHR,                                    
//            AMP=('BUFND=8','BUFNI=4')                                         
//OUTPUT2  DD DSN=BP13.F520.BALLOT,DISP=OLD                                     
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT2)  OUTFILE(OUTPUT2)                                       
//*---------------------------------------------------------------------        
//* SORT OUT THE JB CASES                                                       
//*---------------------------------------------------------------------        
//STEP03   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K520.BALLOT,DISP=SHR,                                    
//            AMP=('BUFND=8','BUFNI=4')                                         
//SORTOUT  DD DSN=&&F520JB,DISP=(,PASS),                                        
//            UNIT=SYSDA,SPACE=(CYL,(16,2),RLSE),                               
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                            
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD  *                                                                
   SORT FIELDS=(123,8,A),FORMAT=CH                                              
   INCLUDE COND=(213,2,CH,EQ,C'JB')                                             
//*---------------------------------------------------------------------        
//* TO UPDATE THE JB GROUP WITH SMALLEST RANDOM NO                              
//*---------------------------------------------------------------------        
//STEP04   EXEC PGM=BP13C711,COND=(0,NE)                                        
//SYSPRINT DD SYSOUT=*                                                          
//BP13F520 DD DSN=&&F520JB,DISP=(OLD,PASS)                                      
//BP13K520 DD DSN=BP13.K520.BALLOT,DISP=SHR,                                    
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13F510 DD DSN=&&F520MIN,DISP=(,PASS),                                       
//            UNIT=SYSDA,SPACE=(CYL,(5,2),RLSE),                                
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                            
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*---------------------------------------------------------------------        
//* SORT BY RANDOM NUMBER                                                       
//*---------------------------------------------------------------------        
//STEP05   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F520MIN,DISP=(OLD,PASS)                                     
//SORTOUT  DD DSN=&&F520SORT,DISP=(,PASS),                                      
//            UNIT=SYSDA,SPACE=(CYL,(5,2),RLSE),                                
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                            
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,28,A),FORMAT=CH                                               
//*---------------------------------------------------------------------        
//* UPDATE SERIES NUMBER TO 28TH BYTE FOR JB GROUP                              
//*---------------------------------------------------------------------        
//STEP06   EXEC PGM=BP13C728,COND=(0,NE)                                        
//SYSPRINT DD SYSOUT=*                                                          
//BP13F500 DD DSN=&&F520SORT,DISP=(OLD,PASS)                                    
//BP13F510 DD DSN=&&F52JBALL,DISP=(,PASS),                                      
//            UNIT=SYSDA,SPACE=(CYL,(5,2),RLSE),                                
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                            
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*---------------------------------------------------------------------        
//* PRINT JB REPORT TO SHOW THE UPDATE OF SMALLEST RANDOM NO                    
//*---------------------------------------------------------------              
//STEP08   EXEC  PGM=BP13C709,COND=(0,NE)                                       
//P13K520  DD DSN=BP13.K520.BALLOT,DISP=SHR                                     
//BP13F520 DD DSN=&&F52JBALL,DISP=(OLD,PASS)                                    
//BP13L709 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* SORT OUT THE NON-JB CASES                                                   
//*---------------------------------------------------------------------        
//STEP09   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K520.BALLOT,DISP=SHR,                                    
//   AMP=('BUFND=8','BUFNI=4')                                                  
//SORTOUT  DD DSN=&&F52NONJB,DISP=(,PASS),                                      
//         UNIT=SYSDA,SPACE=(CYL,(80,10),RLSE),                                 
//         DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                               
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD  *                                                                
   SORT FIELDS=(123,8,A),FORMAT=CH                                              
   OMIT COND=(213,2,CH,EQ,C'JB')                                                
//*---------------------------------------------------------------------        
//* SORT ALL REQUEST IN RANDOM NUMBER ORDER                                     
//*---------------------------------------------------------------------        
//STEP10   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F52JBALL,DISP=(OLD,PASS)                                    
//         DD DSN=&&F52NONJB,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=BP13.F520.PIGEON,DISP=SHR                                     
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD  *                                                                
   SORT FIELDS=(123,8,A),FORMAT=CH                                              
//*---------------------------------------------------------------------        
//* TO RE-CREATE THE BALLOT FILE, FOR JB BASED ON SMALLEST RANDOM NO            
//*---------------------------------------------------------------------        
//STEP11   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT    DD DSN=BP13.F520.PIGEON,DISP=SHR                                     
//SYSIN    DD *                                                                 
         DEL (BP13.K520.BALLOT) CL PURGE                                        
         DEF CL (NAME(BP13.K520.BALLOT)          -                              
                 CYL(72 5)                       -                              
                 UNIQUE                          -                              
                 SPEED                           -                              
                 STORCLAS(PRODRLS)               -                              
                 LOG(NONE)                       -                              
                 SHR(2 3))                       -                              
                 DATA                            -                              
                 (NAME(BP13.K520.BALLOT.DATA)    -                              
                 KEYS(8 122)                     -                              
                 RECSZ(500 500)                  -                              
                 FSPC(10 10)                     -                              
                 CISZ(4096))                                                    
         IF LASTCC = 0 THEN                      -                              
           REPRO IFILE(INPUT)                    -                              
                 ODS(BP13.K520.BALLOT)                                          
