//BP13AHN3 JOB (BP13P),'BP13AHN3',CLASS=I,MSGCLASS=N,                           
//           MSGLEVEL=(1,1),NOTIFY=CSD0071                                      
//JOBLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                    
//**************************************************************                
//*  THIS JOB IS TO REDEFINE HNR FILE WITH THE LATEST FROM                      
//*  BP13K740 (PREV KNOWN AS BP13A748)                                          
//* ----------------------------------------------------------                  
//* CHG-NO   BY   ON     DESCRIPTION                                            
//* ----------------------------------------------------------                  
//*BP133432 IL5 020808 - NEW JCL (PREV KNOWN AS BP13A748)                       
//*BP134602 SMR 150313 - REMOVE BP13CF13                                        
//*BP135170 IL5 140114 - USE BALLOT HOUSEHOLD INSTEAD OF HOUSEHOLD              
//*BP135255 SMR 100314 - OMIT GRO AND MGP CASES IN BP13K745                     
//*BP135255 SMR 180314 - ADD NEW FIELD NUM-WAIT-TIME IN BP13K745                
//*BP136259 SMR 290616 - INCLUDE NUM-ELDERLY IN BP13K745                        
//*BP136519 IL5 211216 - ADD BP13S710                                           
//*BP136970 SMR 230817 - INCLUDE NUM-ALLO-CAT & NUM-PPO IN BP13K745             
//*BP138301 AM2 140520 - HARDCOPY REPORTS CONVERSION                            
//*BP139670 AM2 250823 - CATER FOR FT(PMC)                                      
//******************************************************************            
//*      VERIFY FILES BEFORE JOB RUN                                            
//******************************************************************            
//STEP0A   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//INPUT1   DD DSN=BP13.K745.HNR.SUCCREGN,DISP=OLD                               
//INPUT2   DD DSN=BP13.K725.HNR.RANDOM,DISP=OLD                                 
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
          VFY FILE(INPUT1)                                                      
          VFY FILE(INPUT2)                                                      
//*---------------------------------------------------------------------        
//* SORT OUT SUCC CASES BY DTE-BALLOT/NT/FT/COHORT/REQ-STATUS/RANDOM19          
//* OMIT GRO AND MGP CASES                                                      
//*---------------------------------------------------------------------        
//STEP01   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K740.MATUREBA,DISP=SHR                                   
//SORTOUT  DD DSN=&&K745,DISP=(NEW,PASS),                                       
//            UNIT=SYSDA,                                                       
//            DCB=(BLKSIZE=0,LRECL=500,RECFM=FB),                               
//            SPACE=(CYL,(100,80),RLSE)                                         
//SYSIN   DD *                                                                  
     SORT FIELDS=(334,6,A,187,3,A,211,2,A,80,2,A,260,1,A,                       
                  10,19,A),FORMAT=CH                                            
     INCLUDE COND=(226,3,CH,NE,C'   ',AND,213,3,CH,NE,C'GRO',AND,               
                   245,1,CH,EQ,C' ')                                            
     OUTREC FIELDS=(334,6,187,3,211,2,80,2,260,1,10,19,                         
                    29,2,213,3,461,1,123,8,225,1,226,3,                         
                    118,1,243,1,244,1,253,1,420,3,114,2,                        
                    210,1,376,3,347,1,269,1,434X)                               
//*---------------------------------------------------------------------        
//* SORT OUT SUCC CASES BY DTE-BALLOT/NT/FT/COHORT/REQ-STATUS/RANDOM19          
//*---------------------------------------------------------------------        
//STEP02   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K745.HNR.SUCCREGN,DISP=SHR                               
//SORTOUT  DD DSN=BP13.F745.HNR.SUCCREGN.BKUP,DISP=(NEW,CATLG),                 
//            UNIT=SYSDA,                                                       
//            DCB=(BLKSIZE=0,LRECL=500,RECFM=FB),                               
//            SPACE=(CYL,(100,80),RLSE)                                         
//SYSIN   DD *                                                                  
     SORT FIELDS=(1,33,A),FORMAT=CH                                             
//*---------------------------------------------------------------------        
//* SORT OUT SUCC CASES BY DTE-BALLOT/NT/FT/COHORT/REQ-STATUS/RANDOM19          
//*---------------------------------------------------------------------        
//STEP03   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&K745,DISP=(OLD,DELETE)                                      
//         DD DSN=BP13.F745.HNR.SUCCREGN.BKUP,DISP=SHR                          
//SORTOUT  DD DSN=&&K745END,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,                                                       
//            DCB=(BLKSIZE=0,LRECL=500,RECFM=FB),                               
//            SPACE=(CYL,(150,100),RLSE)                                        
//SYSIN   DD *                                                                  
     SORT FIELDS=(1,33,A),FORMAT=CH                                             
     INCLUDE COND=(49,3,CH,NE,C'   ')                                           
     SUM FIELDS=NONE                                                            
//*---------------------------------------------------------------------        
//*  DELETE AND DEFINE BP13K745 - HNR FILE                                      
//*      DEL (BP13.K745.HNR.SUCCREGN) CLUSTER PURGE                             
//*---------------------------------------------------------------------        
//STEP04    EXEC PGM=IDCAMS,COND=(0,NE)                                         
//INPUT     DD DSN=&&K745END,DISP=(OLD,DELETE)                                  
//SYSPRINT  DD SYSOUT=*                                                         
//SYSIN    DD *                                                                 
         DEL (BP13.K745.HNR.SUCCREGN) CLUSTER PURGE                             
         DEF CL (NAME(BP13.K745.HNR.SUCCREGN)            -                      
                 CYL(150 100)                            -                      
                 UNIQUE                                  -                      
                 SPEED                                   -                      
                 STORCLAS(PRODRLS)                       -                      
                 LOG(NONE)                               -                      
                 SHR(2 3))                               -                      
                 DATA                                    -                      
                 (NAME(BP13.K745.HNR.SUCCREGN.DATA)      -                      
                 KEYS(33 0)                              -                      
                 RECSZ(500 500)                          -                      
                 FSPC(10 10)                             -                      
                 CISZ(4096))                                                    
         IF LASTCC = 0 THEN                              -                      
           REPRO IFILE(INPUT)                            -                      
                 ODS(BP13.K745.HNR.SUCCREGN)                                    
           DEF AIX (NAME(BP13.K745.HNR.SUCCREGN.ALTX1)   -                      
               REL(BP13.K745.HNR.SUCCREGN)               -                      
               CYL(150 100)                              -                      
               UNIQUE                                    -                      
               SHR(2 3))                                 -                      
               DATA                                      -                      
               (NAME(BP13.K745.HNR.SUCCREGN.ALTX1.DATA)  -                      
               KEYS(8 39)                                -                      
               CISZ(4096)                                -                      
               RECSZ(33 354)                             -                      
               NUNQK)                                                           
         IF MAXCC = 0 THEN                               -                      
           DEF PATH(NAME(BP13.K745.HNR.SUCCREGN.PATH1)   -                      
               PENT(BP13.K745.HNR.SUCCREGN.ALTX1))                              
         IF MAXCC = 0 THEN                               -                      
           BIX IDS(BP13.K745.HNR.SUCCREGN)               -                      
               ODS(BP13.K745.HNR.SUCCREGN.ALTX1)                                
//*-------------------------------------------------------------------*         
//* UPDATE K745-NUM-NT-CLASSIFY                                                 
//*-------------------------------------------------------------------*         
//STEP04A  EXEC PGM=BP13C52D,COND=(0,NE)                                        
//BP13K745 DD DSN=BP13.K745.HNR.SUCCREGN,DISP=SHR                               
//BP13K813 DD DSN=BP13.K813.BTOBE,DISP=SHR,                                     
//            AMP=('BUFNI=8','BUFND=4')                                         
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*-------------------------------------------------------------------*         
//* TO DELETE SEQ. DATASETS                                                     
//*-------------------------------------------------------------------*         
//STEP05   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD   SYSOUT=*                                                        
//SYSIN    DD   *                                                               
     DEL ('BP13.F745.HNR.SUCCREGN.BKUP')                                        
     IF MAXCC < 12 THEN                                                         
        SET MAXCC = 0                                                           
//*---------------------------------------------------------------------        
//* SORT OUT ALL THE CASES IN 10TH BYTE FORMAT FOR HNR CHECKING                 
//*---------------------------------------------------------------------        
//STEP06   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F740.MATUREBA.ATTEMPT.TAPE(0),DISP=SHR                   
//SORTOUT  DD DSN=&&K725,DISP=(NEW,PASS),                                       
//            UNIT=SYSDA,                                                       
//            DCB=(BLKSIZE=0,LRECL=150,RECFM=FB),                               
//            SPACE=(CYL,(80,50),RLSE)                                          
//SYSIN   DD *                                                                  
     SORT FIELDS=(123,8,A,29,2,A),FORMAT=CH                                     
     OUTREC FIELDS=(123,8,29,2,1,28,187,3,461,1,211,2,225,1,334,6,99X)          
//*---------------------------------------------------------------------        
//* SORT OUT ALL THE CASES IN 10TH BYTE FORMAT FOR HNR CHECKING                 
//*---------------------------------------------------------------------        
//STEP08   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K725.HNR.RANDOM,DISP=SHR                                 
//SORTOUT  DD DSN=BP13.F725.HNR.RANDOM.BKUP,DISP=(NEW,CATLG),                   
//            UNIT=SYSDA,                                                       
//            DCB=(BLKSIZE=0,LRECL=150,RECFM=FB),                               
//            SPACE=(CYL,(80,50),RLSE)                                          
//SYSIN   DD *                                                                  
     SORT FIELDS=(1,10,A),FORMAT=CH                                             
//*---------------------------------------------------------------------        
//* SORT OUT ALL THE CASES IN 10TH BYTE FORMAT FOR HNR CHECKING                 
//*---------------------------------------------------------------------        
//STEP09   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&K725,DISP=(OLD,DELETE)                                      
//         DD DSN=BP13.F725.HNR.RANDOM.BKUP,DISP=SHR                            
//SORTOUT  DD DSN=&&K725END,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,                                                       
//            DCB=(BLKSIZE=0,LRECL=150,RECFM=FB),                               
//            SPACE=(CYL,(100,80),RLSE)                                         
//SYSIN   DD *                                                                  
     SORT FIELDS=(1,10,A),FORMAT=CH                                             
     SUM FIELDS=NONE                                                            
//*---------------------------------------------------------------------        
//*  DELETE AND DEFINE BP13K725 - HNR FILE                                      
//*      DEL (BP13.K725.HNR.RANDOM) CLUSTER PURGE                               
//*---------------------------------------------------------------------        
//STEP10    EXEC PGM=IDCAMS,COND=(0,NE)                                         
//INPUT     DD DSN=&&K725END,DISP=(OLD,DELETE)                                  
//SYSPRINT  DD SYSOUT=*                                                         
//SYSIN    DD *                                                                 
         DEL (BP13.K725.HNR.RANDOM) CLUSTER PURGE                               
         DEF CL (NAME(BP13.K725.HNR.RANDOM)              -                      
                 CYL(100 80)                             -                      
                 UNIQUE                                  -                      
                 SPEED                                   -                      
                 STORCLAS(PRODRLS)                       -                      
                 LOG(NONE)                               -                      
                 SHR(2 3))                               -                      
                 DATA                                    -                      
                 (NAME(BP13.K725.HNR.RANDOM.DATA)        -                      
                 KEYS(10 0)                              -                      
                 RECSZ(150 150)                          -                      
                 FSPC(10 10)                             -                      
                 CISZ(4096))                                                    
         IF LASTCC = 0 THEN                              -                      
           REPRO IFILE(INPUT)                            -                      
                 ODS(BP13.K725.HNR.RANDOM)                                      
           DEF AIX (NAME(BP13.K725.HNR.RANDOM.ALTX1)     -                      
               REL(BP13.K725.HNR.RANDOM)                 -                      
               CYL(100 80)                               -                      
               UNIQUE                                    -                      
               SHR(2 3))                                 -                      
               DATA                                      -                      
               (NAME(BP13.K725.HNR.RANDOM.ALTX1.DATA)    -                      
               KEYS(8 0)                                 -                      
               CISZ(4096)                                -                      
               RECSZ(18 213)                             -                      
               NUNQK)                                                           
         IF MAXCC = 0 THEN                               -                      
           DEF PATH(NAME(BP13.K725.HNR.RANDOM.PATH1)     -                      
               PENT(BP13.K725.HNR.RANDOM.ALTX1))                                
         IF MAXCC = 0 THEN                               -                      
           BIX IDS(BP13.K725.HNR.RANDOM)                 -                      
               ODS(BP13.K725.HNR.RANDOM.ALTX1)                                  
//*-------------------------------------------------------------------*         
//* TO DELETE SEQ. DATASETS                                                     
//*-------------------------------------------------------------------*         
//STEP11   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD   SYSOUT=*                                                        
//SYSIN    DD   *                                                               
     DEL ('BP13.F725.HNR.RANDOM.BKUP')                                          
     IF MAXCC < 12 THEN                                                         
        SET MAXCC = 0                                                           
/*                                                                              
//*------------------------------------------------------------------*          
//* EXTRACT LATEST HNR RECORDS FROM BP13K747                         *          
//*------------------------------------------------------------------*          
//STEP12   EXEC PGM=SORT                                                        
//SORTJNF1 DD DSN=BP13.F747.HNR.RANGE,DISP=SHR                                  
//SORTJNF2 DD DSN=BP13.K747.HNR.RANGE,DISP=SHR                                  
//MATCH    DD DSN=&&F747SCH,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,                                                       
//            SPACE=(CYL,(50,20),RLSE),                                         
//            DCB=(RECFM=FB,LRECL=150)                                          
//SYSIN DD *                                                                    
   JOINKEYS FILE=F1,FIELDS=(1,20,A)                                             
   JOINKEYS FILE=F2,FIELDS=(1,20,A)                                             
   REFORMAT FIELDS=(F2:1,150)                                                   
   OUTFILE FNAMES=MATCH                                                         
   OPTION COPY                                                                  
/*                                                                              
//SYSUDUMP DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* SAS PROGRAM TO PRINT THE RANGE OF SUCCESSFUL RANDOM NO                      
//*---------------------------------------------------------------------        
//STEP13   EXEC SAS,COND=(0,NE)                                                 
//WORK     DD UNIT=SYSDA,SPACE=(CYL,(60,20))                                    
//BP13F713 DD DSN=BP13.BLANK.CHAR50,DISP=SHR                                    
//BP13K747 DD DSN=&&F747SCH,DISP=(OLD,DELETE)                                   
//BP13L710 DD SYSOUT=8,DEST=IOM8                                                
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S710),DISP=SHR                             
