//BP13REV7  JOB (BP13P),'BP13REV7',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),           
//      NOTIFY=CSD0071,TYPRUN=HOLD                                              
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//*********************************************************************         
//* BP130487 SSS 980507 - CHG UNIT=3480 TO UNIT=CART                            
//* BP132546 YCH 110604 - INCLUDE STORCLAS(PRODRLS) & LOG(NONE)                 
//*********************************************************************         
//*  RECOVERY FOR BP13K830 ADDRESS FILE                                         
//*********************************************************************         
//*  REPRO BALLOT FILE TO CARTRIDGE                                             
//*---------------------------------------------------------------------        
//STEP01   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F830.ADDR.QTR(0),DISP=OLD,                               
//            UNIT=CART,LABEL=(1,SL),                                           
//            DCB=(RECFM=FB,LRECL=250,BLKSIZE=23250)                            
//OUTPUT1  DD DSN=&&F830ADDR,DISP=(NEW,PASS),                                   
//            UNIT=(SYSDA,2),SPACE=(CYL,(150,10),RLSE),                         
//            DCB=(RECFM=FB,LRECL=250,BLKSIZE=23250)                            
//*                                                                             
//SYSIN     DD  *                                                               
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
//*--------------------------------------------------------------------         
//*  RE-DEFINE CORR ADDRESS FILE BP13K830                                       
//*--------------------------------------------------------------------         
//STEP06  EXEC PGM=IDCAMS,COND=(0,NE)                                           
//INPUT     DD DSN=&&F830ADDR,DISP=(OLD,PASS)                                   
//SYSPRINT  DD SYSOUT=*                                                         
//SYSIN     DD  *                                                               
         DEL (BP13.K830.ADDR) CL PURGE                                          
         DEF CL (NAME(BP13.K830.ADDR)                  -                        
                 CYL(180 30)                           -                        
                 UNIQUE                                -                        
                 SPEED                                 -                        
                 STORCLAS(PRODRLS)                     -                        
                 LOG(NONE)                             -                        
                 SHR(2 3))                             -                        
                 DATA                                  -                        
                 (NAME(BP13.K830.ADDR.DATA)            -                        
                 KEYS(9 0)                             -                        
                 RECSZ(250 250)                        -                        
                 FSPC(10 10)                           -                        
                 CISZ(4096))                                                    
         IF LASTCC = 0 THEN                            -                        
           REPRO IFILE(INPUT)                          -                        
                 ODS(BP13.K830.ADDR)                                            
           DEF AIX (NAME(BP13.K830.ADDR.ALTX1)         -                        
               REL(BP13.K830.ADDR)                     -                        
               CYL(20 8)                               -                        
               UNIQUE                                  -                        
               SHR(2 3))                               -                        
               DATA                                    -                        
               (NAME(BP13.K830.ADDR.ALTX1.DATA)        -                        
               KEYS(8 19)                              -                        
               CISZ(4096)                              -                        
               RECSZ(60 3000)                          -                        
               NUNQK)                                                           
         IF MAXCC = 0 THEN                             -                        
           DEF PATH(NAME(BP13.K830.ADDR.PATH1)         -                        
               PENT(BP13.K830.ADDR.ALTX1))                                      
         IF MAXCC = 0 THEN                             -                        
           BIX IDS(BP13.K830.ADDR)                     -                        
               ODS(BP13.K830.ADDR.ALTX1)                                        
