//BP13A274 JOB (BP13P),'BP13A274',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//         NOTIFY=CSD0071                                                       
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,                                          
//             DISP=SHR                                                         
//******************************************************************            
//*  TO SEND DYNAMIC JOB DESCRIPTOR ENTRIES AHEAD OF THE PRINT                  
//*  DATASET, SINGLE COPY                                                       
//*-----------------------------------------------------------------            
//PRT01  EXEC    PGM=IEBGENER,COND=(0,NE)                                       
//SYSUT1   DD  *                                                                
$DJDE$ JDE=BP13D,JDL=BP13,END;                                                  
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAAL1A                                     
//SYSUT2   DD  SYSOUT=2,OUTPUT=(*.FORMID)                                       
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//*-----------------------------------------------------------------            
//* SORT OUT THE CONTROL REC FOR THIS OPTION                                    
//*-----------------------------------------------------------------            
//STEP00 EXEC    SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=BP13.K205.CTLREC,                                            
//             DISP=SHR                                                         
//SORTOUT  DD  DSN=&&BP13F205,                                                  
//             DISP=(,PASS),                                                    
//             UNIT=(SYSDA,1),                                                  
//             SPACE=(TRK,(1,1),RLSE),                                          
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=0)                                
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,15,A),FORMAT=CH                                               
   INCLUDE COND=(14,2,CH,EQ,C'TP')                                              
/*                                                                              
//*-----------------------------------------------------------------            
//*   SORT OUT DATA FROM BP13                                                   
//*-----------------------------------------------------------------            
//STEP01   EXEC  SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=BP13.K223.APPMT,                                             
//             DISP=SHR                                                         
//SORTOUT  DD  DSN=&&BP13F223,                                                  
//             DISP=(,PASS),                                                    
//             UNIT=(SYSDA,1),                                                  
//             SPACE=(CYL,(10,5),RLSE),                                         
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=0)                                
//SYSIN    DD  *                                                                
    SORT FIELDS=(1,5,A),FORMAT=CH                                               
    INCLUDE COND=(1,3,CH,EQ,C'DBS')                                             
//*---------------------------------------------------------------------00003350
//STEP02 EXEC    PGM=IDCAMS,COND=(0,NE)                                 00003360
//INPUT1   DD  DSN=&&BP13F223,DISP=(SHR,PASS)                           00003370
//SYSPRINT DD  SYSOUT=*                                                 00003390
//SYSIN    DD  *                                                        00003400
          DEL 'BP13.K223.APPMT.TP' CLUSTER PURGE                                
          DEF CLUSTER                                -                          
              (NAME(BP13.K223.APPMT.TP)        -                                
              CYL(2  1)                              -                          
              UNIQUE                                 -                          
              SHR(2 3))                              -                          
              DATA                                   -                          
              (NAME(BP13.K223.APPMT.TP.DATA) -                                  
              KEYS(15 0)                             -                          
              RECSZ(80 80)                           -                          
              CISZ(4096)                             -                          
              FSPC(10 10))                           -                          
              INDEX                                  -                          
              (NAME(BP13.K223.APPMT.TP.INDEX) -                                 
              CISZ(4096))                                                       
      IF MAXCC = 0  THEN                             -                          
      REPRO IFILE(INPUT1)                            -                          
            ODS(BP13.K223.APPMT.TP)            -                                
            REUSE                                                               
//*--------------------------------------------------------------------*00000820
//* TO CREATE BP13K225 - BOOKING APPOINTMENT FILE                      *00000830
//*--------------------------------------------------------------------*00000850
//STEP03   EXEC  PGM=BP13C522,COND=(0,NE)                                       
//BP13K223 DD  DSN=BP13.K223.APPMT.TP,                                          
//             DISP=SHR                                                         
//BP13K225 DD  DSN=BP13.K225.QUEUE,                                             
//             DISP=OLD                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//*--------------------------------------------------------------------*00000820
//* TO CREATE BP13F200 - BOOKING APPOINTMENT FILE                      *00000830
//*--------------------------------------------------------------------*00000850
//STEP04   EXEC  PGM=BP13C529,COND=(0,NE)                                       
//BP13F205 DD  DSN=&&BP13F205,                                                  
//             DISP=(SHR,PASS)                                                  
//BP13KD15 DD  DSN=BP13.KD15.DBSSTP,                                            
//             DISP=SHR                                                         
//BP13F200 DD  DSN=BP13.F200.APPOINT.DBSS,                                      
//             DISP=SHR                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//*--------------------------------------------------------------------         
//* TO UPDATE BP13K800 WITH APPT DATE/TIME                                      
//*---------------------------------------------------------------------        
//STEP05    EXEC PGM=BP13C523,COND=(0,NE)                                       
//BP13F200  DD DSN=BP13.F200.APPOINT.DBSS,DISP=SHR                              
//BP13K225  DD DSN=BP13.K225.QUEUE,DISP=SHR                                     
//BP13K221  DD DSN=BP13.K225.QUEUE.PATH1,DISP=SHR                               
//BP13K800  DD DSN=BP13.K800.APPLN,DISP=SHR,                                    
//          AMP=('BUFNI=8','BUFND=4')                                           
//BP13K820  DD DSN=BP13.K820.OCCUP,DISP=SHR,                                    
//          AMP=('BUFNI=8','BUFND=4')                                           
//BP13KD15  DD DSN=BP13.KD15.DBSSTP,DISP=SHR,                                   
//          AMP=('BUFNI=8','BUFND=4')                                           
//BP13KD11  DD DSN=BP13.KD15.DBSSTP.PATH1,DISP=SHR,                             
//          AMP=('BUFNI=8','BUFND=4')                                           
//BP13FD15  DD DSN=BP13.FD15.DBSSTP.APPT,DISP=SHR                               
//SYSPRINT  DD SYSOUT=*                                                         
//SYSOUT    DD SYSOUT=*                                                         
//SYSDBOUT  DD SYSOUT=*                                                         
//*---------------------------------------------------------------------        
//* PRINT REPORT ON TP APPOINTMENT DATE AND TIME UPDATED                        
//*---------------------------------------------------------------------        
//STEP06 EXEC SAS,COND=(0,NE)                                                   
//WORK     DD UNIT=SYSDA,SPACE=(CYL,(10,10),,,ROUND)                            
//INDATA DD DSN=BP13.FD15.DBSSTP.APPT,DISP=SHR                                  
//FT42F001 DD  SYSOUT=2,                                                        
//             OUTPUT=(*.PRT01.FORMID)                                          
//SYSIN    DD  DSN=BP13.BATCH.SRC(BP13S222),                                    
//             DISP=SHR                                                         
//*--------------------------------------------------------------------         
//* END JOB BP13A274                                                            
//*---------------------------------------------------------------------        
