//BP13A244 JOB (BP13P),'BP13A244',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//             NOTIFY=CSD0071                                                   
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,                                          
//             DISP=SHR                                                         
//* ====================================================================        
//* CHG-NO   BY    ON        DESCRIPTION                                        
//* ======== === ==========  ===========                                        
//* BP132485 JF4 10/02/2004  UPDATE SELECTION TYPE                              
//* BP134621 ESA115/09/2012  CATER FOR NEW BP13K247 LAYOUT                      
//*--------------------------------------------------------------------         
//*      VERIFY FILES BEFORE DAILY PRODUCTION RUN                               
//*--------------------------------------------------------------------         
//STEP00  EXEC PGM=IDCAMS,COND=(0,NE)                                           
//INPUT1   DD DSN=BM06.K110.FLATINV,DISP=OLD                                    
//INPUT2   DD DSN=BP13.K230.FLATLIST,DISP=OLD                                   
//INPUT3   DD DSN=BP13.K240.HEADFLAT,DISP=OLD                                   
//INPUT4   DD DSN=BP13.K270.BOOKPGM,DISP=OLD                                    
//INPUT5   DD DSN=BP13.K247.SUMMARY,DISP=OLD                                    
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN   DD *                                                                  
          VFY FILE(INPUT1)                                                      
          VFY FILE(INPUT2)                                                      
          VFY FILE(INPUT3)                                                      
          VFY FILE(INPUT4)                                                      
          VFY FILE(INPUT5)                                                      
/*                                                                              
//*---------------------------------------------------------------------        
//* CTRL REC FOR OPTION 11 IN BP13B289 - UPDATE SELECTION TYPE                  
//*--------------------------------------------------------------------         
//STEP00   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K205.CTLREC,DISP=SHR                                     
//SORTOUT  DD  DSN=&&BP13F205,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=SYSDA,                                                      
//             SPACE=(TRK,(1,1),RLSE),                                          
//             DCB=(BLKSIZE=0,LRECL=80,RECFM=FB)                                
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,15,A),FORMAT=CH                                               
   INCLUDE COND=(14,2,CH,EQ,C'ST')                                              
//*---------------------------------------------------------------------        
//* UPDATE SEL-TYPE IN BP13K230, BP13K240, BP13K270, BM06K110, BM06F800         
//*---------------------------------------------------------------------        
//STEP01 EXEC    PGM=BP13C22A,COND=(0,NE)                                       
//BP13F205 DD  DSN=&&BP13F205,                                                  
//             DISP=(SHR,PASS)                                                  
//BM06F800 DD  DSN=BM06.F800.ALLOUNIT,                                          
//             DISP=SHR                                                         
//BM06K110 DD  DSN=BM06.K110.FLATINV,                                           
//             DISP=SHR                                                         
//BP13K230 DD  DSN=BP13.K230.FLATLIST,                                          
//             DISP=SHR                                                         
//BP13K240 DD  DSN=BP13.K240.HEADFLAT,                                          
//             DISP=SHR                                                         
//BP13K270 DD  DSN=BP13.K270.BOOKPGM,                                           
//             DISP=SHR                                                         
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//SYSPRINT DD  SYSOUT=*                                                         
/*                                                                              
//*--------------------------------------------------------------------         
//* BACKUP FIS LOG FILE                                                         
//*--------------------------------------------------------------------         
//STEP02   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K240.HEADFLAT,DISP=SHR                                   
//SORTOUT  DD  DSN=&&BP13F247,                                                  
//             DISP=(,PASS),                                                    
//             UNIT=(SYSDA,1),                                                  
//             SPACE=(CYL,(10,5),RLSE),                                         
//             DCB=(RECFM=FB,LRECL=100,BLKSIZE=0)                               
//SYSIN    DD  *                                                                
  SORT FIELDS=(131,42,A,7,8,A),FORMAT=CH                                        
  INCLUDE COND=(5,2,CH,EQ,C'01')                                                
  OUTREC FIELDS=(131,42,7,8,117,6,356,1,43X)                                    
  SUM FIELDS=NONE                                                               
//*---------------------------------------------------------------------        
//* DEFINE LMS VSAM FILE                                                        
//*---------------------------------------------------------------------        
//STEP97 EXEC    PGM=IDCAMS                                                     
//INPUT1   DD  DSN=&&BP13F247,DISP=(SHR,PASS)                                   
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  *                                                                
          DEL 'BP13.K247.SUMMARY' CLUSTER PURGE                                 
          DEF CLUSTER                                -                          
              (NAME(BP13.K247.SUMMARY)               -                          
              TRK(10 5)                              -                          
              STORCLAS(PRODRLS)                      -                          
              LOG(NONE)                              -                          
              UNIQUE                                 -                          
              SHR(2 3))                              -                          
              DATA                                   -                          
              (NAME(BP13.K247.SUMMARY.DATA) -                                   
              KEYS(56 0)                             -                          
              RECSZ(100 100)                         -                          
              CISZ(4096)                             -                          
              FSPC(10 10))                           -                          
              INDEX                                  -                          
              (NAME(BP13.K247.SUMMARY.INDEX) -                                  
              CISZ(4096))                                                       
      IF MAXCC = 0  THEN                             -                          
      REPRO IFILE(INPUT1)                            -                          
            ODS(BP13.K247.SUMMARY)                                              
/*                                                                              
//*--------------------------------------------------------------------         
//*                      END OF BP13A244                                        
//*--------------------------------------------------------------------         
