//BP13A624 JOB (BP13P),'BP13A624',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//         NOTIFY=CSD0071                                                       
//*==================================================================           
//* 1. THIS JOB WILL WRITE DATA TO BP13.F100.AMRUNIT.RANDOM FOR SOU7            
//*==================================================================           
//* CHG REF  BY   ON       DESCRIPTION                                          
//* -------- ---- -------- -----------                                          
//* BP133668 IL5  100809   NEW JCL                                              
//* BP138301 IL5  260820   INCREASE SIZE OF DATASET                             
//*                        FMS FB-2020-02904                                    
//*==================================================================           
//*-------------------------------------------------------------------*         
//* STEP1  :  TO DELETE SEQ. DATASETS                                           
//*-------------------------------------------------------------------*         
//A624S001 EXEC PGM=IDCAMS                                                      
//SYSPRINT DD   SYSOUT=*                                                        
//SYSIN    DD   *                                                               
     DEL ('BP13.F100.AMRUNIT.RANDOM')                                           
     IF MAXCC < 12 THEN                                                         
        SET MAXCC = 0                                                           
/*                                                                              
//*---------------------------------------------------------------------        
//* SORT BP13F100                                                               
//*---------------------------------------------------------------------        
//STEP06 EXEC  SORT,COND=(0,NE)                                                 
//SYSPRINT DD  SYSOUT=*                                                         
//SORTIN   DD  DSN=BP13.K100.CONDUNIT,DISP=SHR                                  
//SORTOUT  DD  DSN=BP13.F100.AMRUNIT.RANDOM,                                    
//             DISP=(NEW,CATLG),                                                
//             SPACE=(CYL,(10,5),RLSE),DATACLAS=MULTIVOL,                       
//             DCB=(RECFM=FB,LRECL=800,BLKSIZE=0)                               
//SYSIN    DD *                                                                 
    SORT FIELDS=(67,7,A,108,2,A,19,28,A),FORMAT=CH                              
/*                                                                              
