//BP13AY0G JOB (BP13P),'BP13AY0G',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//         NOTIFY=CSD0071                                                       
//JOBLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                    
//*====================================================================         
//*-----------------------------------------------------------------    00170000
//* CHG-NO   BY   ON    - DESCRIPTION                                   00170000
//*--------------------------------------------------                   00170000
//* BP134598 LSB 120812 - ADD BP13K895 TO BP13CY90                      00170000
//* BP134930 LSB 280513 - ADD K595 PATH1 TO CY90, DELETE CALL C913      00170000
//*-----------------------------------------------------------------    00170000
//* ACCEPT CASES                                                        00180000
//*-----------------------------------------------------------------    00210000
//STEP01   EXEC PGM=BP13CY90,COND=(0,NE)                                        
//BP13F007 DD  DSN=BP13.F007.AY0G.INPUT,DISP=SHR                        00230001
//SY02F001 DD  DSN=SY02.F001.DATE,DISP=SHR                              00240000
//BP13K060 DD  DSN=BP13.K060.CODETAB,DISP=SHR,                          00250000
//             AMP=('BUFND=4','BUFNI=8')                                00260000
//BP13K813 DD  DSN=BP13.K813.BTOBE,DISP=SHR,                            00270000
//             AMP=('BUFND=4','BUFNI=8')                                00280000
//BP13K585 DD  DSN=BP13.K585.HARDLUCK,DISP=SHR,                         00270000
//             AMP=('BUFND=4','BUFNI=8')                                00280000
//BP13K828 DD  DSN=BP13.K828.HISTOCCP,DISP=SHR,                         00330002
//             AMP=('BUFND=4','BUFNI=8')                                00340000
//BP13K820 DD  DSN=BP13.K820.OCCUP,DISP=SHR,                            00350002
//             AMP=('BUFND=4','BUFNI=8')                                00360002
//BP13K895 DD  DSN=BP13.K895.OCCUP.HISTORY,DISP=SHR,                    00350002
//             AMP=('BUFND=4','BUFNI=8')                                00360002
//BP13K593 DD  DSN=BP13.K593.UNSUCCNT,DISP=SHR,                         00370008
//             AMP=('BUFND=4','BUFNI=8')                                00380006
//BP13K595 DD  DSN=BP13.K595.BALLOT.LOG,DISP=SHR,                               
//             AMP=('BUFND=4','BUFNI=8')                                        
//BP13K591 DD  DSN=BP13.K595.BALLOT.LOG.PATH1,DISP=SHR,                         
//             AMP=('BUFND=4','BUFNI=8')                                        
//BM06K110 DD  DSN=BM06.K110.FLATINV,DISP=SHR,                                  
//             AMP=('BUFND=4','BUFNI=8')                                        
//BM06K111 DD  DSN=BM06.K110.FLATINV.PATH2,DISP=SHR,                            
//             AMP=('BUFND=4','BUFNI=8')                                        
//BP13F008 DD  DSN=BP13.F008.AY0G.OUTPUT,DISP=OLD                       00450005
//SUMMARY   DD SYSOUT=*                                                         
//SYSDBG    DD SYSOUT=*                                                         
//SYSABOUT  DD SYSOUT=*                                                         
//SYSDBOUT  DD SYSOUT=*                                                         
//SYSTSPRT  DD SYSOUT=*                                                         
//SYSPRINT  DD SYSOUT=*                                                         
//SYSOUT    DD SYSOUT=*                                                         
//SYSTSIN   DD *                                                                
/*                                                                              
