//BP13D202 JOB (BP13P),'BP13D202',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//             NOTIFY=CSD0071                                                   
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,                                          
//             DISP=SHR                                                         
//*=================================================================            
//* CHG REF  DATE     BY   DESCRIPTION                                          
//* -------- -------- ---  -----------                                          
//* BP132077 20020115 JAM1 CREATE BP13F202                                      
//* BP132501 20040330 LMS1 CATER FOR WIS APPOINTMENT.                           
//* BP132876 20061122 LMS1 BYPASS DBSS APPOINTMENT.                             
//* BP133446 20081113 LMS1 TO CREATE NEW FILE BP13K290.                         
//* BP133724 20091019 DW5  TO FTP TO EQMS SERVER.                               
//* BP133851 20100326 ESD1 CATER FOR PAIRED UNIT                                
//* BP133859 20100521 DW5  TO REMOVE FTP TO OLD EQMS SERVER                     
//* BP133859 20100525 ESA1 TO REMOVE BP13C221                                   
//*                        TO CHANGE BP13F202 TO BP13F206                       
//* BP133859 20100601 DW5  TO INCLUDE 3 DAYS APPT IN BP13K290 BY                
//*                        REMOVING BP13C21U                                    
//* BP134400 20111110 DW5  INCREASE SIZE OF BP13K800 TEMP DATASET               
//* BP134516 20120507 ESA1 CATER FOR MGPS                                       
//* BP134681 20121003 ESA1 TO ADD BP13F290 IN BP13C229                          
//* BP134727 20130115 CCC5 TO INCLUDE BLANK RECORD IN STEP06                    
//* BP135533 20141127 ESA1 TO ADD CLEARING OF BP13.K238.HOLD.INFO               
//* BP135695 20150408 ESA1 TO ADD BP13C25T TO CREATE HLE TRANS FILE             
//* BP135905 20150826 ESA1 TO ADD BM06K110 IN BP13C25T                          
//* BP136192 20160427 ESA1 TO ADD BP13C25X TO UPDATE K203-NUM-STATUS            
//* BP136814 20170601 KAM4 CATER FOR PRE-AHGSHG EMAIL NOTIFICATION              
//* BP137145 20180113 ESA1 TO ADD BP13C25C TO UPDATE BP13KL00 FOR EMAIL         
//* BP137632 20190923 KTM3 TO ADD HQMS FOR AGR COUNTER                          
//* BP138002 20191018 KAC1 TO ADD BP13K454 IN STEP32 AND ADDED BP13K480         
//* BP137583 20191021 EL27 ADDED C221 FOR BK HQMS, TO REPLACE F290 WHEN         
//*                        WE DROP EQMS, IT IS POINTED TO DUMMY FOR NOW         
//* BP137583 20200110 KTM3 COMMENTED OUT INTERFACE TO EQMS                      
//* BP13XXXX 20200326 EL27 EXCLUDE OBF FOR SLN CASES TO HQMS                    
//*=================================================================            
//*--------------------------------------------------------------------         
//*      VERIFY FILES BEFORE DAILY PRODUCTION RUN                               
//*--------------------------------------------------------------------         
//STEPAA  EXEC PGM=IDCAMS,COND=(0,NE)                                           
//INPUT1   DD DSN=BP13.K203.SMS,DISP=OLD                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN   DD *                                                                  
          VFY FILE(INPUT1)                                                      
          IF LASTCC=12 THEN                                                     
             DO                                                                 
                SET MAXCC=0                                                     
                VFY FILE(INPUT1)                                                
             END                                                                
/*                                                                              
//*-----------------------------------------------------------------            
//* SORT THE REGN NO                                                            
//*-----------------------------------------------------------------            
//STEP01 EXEC    SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=BP13.K800.APPLN,                                             
//             DISP=SHR,                                                        
//             AMP=('BUFNI=8','BUFND=4')                                        
//SORTOUT  DD  DSN=&&BP13F800,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=SYSDA,                                                      
//             SPACE=(CYL,(100,20),RLSE),                                       
//             DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                              
//SYSIN    DD  *                                                                
   SORT FIELDS=(4,8,A),FORMAT=CH                                                
   INCLUDE COND=(1,1,CH,NE,C'C',&,4,8,CH,LT,C'90000000',&,                      
                 4,1,CH,NE,C'5')                                                
//*-----------------------------------------------------------------            
//* SORT THE REGN NO FOR DBSS CASES                                             
//*-----------------------------------------------------------------            
//STEP1A EXEC  SORT,COND=(0,NE)                                                 
//SORTIN   DD  DSN=BP13.K800.APPLN,                                             
//             DISP=SHR,                                                        
//             AMP=('BUFNI=8','BUFND=4')                                        
//SORTOUT  DD  DSN=&&BP13F800,                                                  
//             DISP=(MOD,PASS)                                                  
//SYSIN    DD  *                                                                
   SORT FIELDS=(4,8,A),FORMAT=CH                                                
   INCLUDE COND=(1,1,CH,NE,C'C',&,365,2,CH,NE,C'00',&,                          
                 4,1,CH,EQ,C'5')                                                
//*---------------------------------------------------------------------        
//* TO CREATE BP13F206 FOR NEW EQMS                                             
//*---------------------------------------------------------------------        
//STEP2A EXEC  PGM=BP13C229,COND=(0,NE)                                         
//BP13F800 DD  DSN=&&BP13F800,                                                  
//             DISP=(OLD,DELETE)                                                
//BP13F206 DD  DSN=BP13.F206.EQMS,                                              
//             DISP=SHR                                                         
//SY02F001 DD  DSN=SY02.F001.DATE,                                              
//             DISP=SHR                                                         
//BP13F290 DD  DSN=&&P13F290A,                                                  
//             DISP=(,PASS),                                                    
//             UNIT=(SYSDA,1),                                                  
//             SPACE=(CYL,(5,5),RLSE),                                          
//             DCB=(RECFM=FB,LRECL=100,BLKSIZE=0)                               
//BP13K820 DD  DSN=BP13.K820.OCCUP,                                             
//             DISP=SHR,                                                        
//             AMP=('BUFNI=8','BUFND=4')                                        
//SYSPRINT DD  SYSOUT=*                                                         
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//*--------------------------------------------------------------------         
//*---------------------------------------------------------------------        
//STEP06   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&P13F290A,DISP=(SHR,DELETE)                                  
//         DD DSN=BP13.BLANK.CHAR100,DISP=SHR                                   
//SORTOUT  DD  DSN=&&P13F290B,                                                  
//             DISP=(,PASS),                                                    
//             UNIT=(SYSDA,1),                                                  
//             SPACE=(CYL,(5,5),RLSE),                                          
//             DCB=(RECFM=FB,LRECL=100,BLKSIZE=0)                               
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,13,CH,A)                                                       
  INCLUDE COND=(34,4,CH,EQ,C'BK  ',OR,34,4,CH,EQ,C'    ')                       
  SUM FIELDS=NONE                                                               
//*--------------------------------------------------------------------         
//*  TO DEFINE BP13.K290.QUEUE                                                  
//*--------------------------------------------------------------------         
//STEP07    EXEC PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT  DD SYSOUT=*                                                         
//INPUT1    DD DSN=&&P13F290B,DISP=(SHR,DELETE)                                 
//SYSIN     DD  *                                                               
            DEL 'BP13.K290.QUEUE' CLUSTER PURGE                                 
            DEF CLUSTER (NAME(BP13.K290.QUEUE)      -                           
                CYL(5  2)                             -                         
                UNIQUE                                -                         
                STORCLAS(PRODRLS)                     -                         
                LOG(NONE)                             -                         
                SHR(2 3))                             -                         
              DATA                                    -                         
                (NAME(BP13.K290.QUEUE.DATA)          -                          
                 KEYS(13 0)                           -                         
                 RECSZ(100 100)                       -                         
                 CISZ(4096)                           -                         
                 FSPC(10 10))                         -                         
              INDEX                                   -                         
                (NAME(BP13.K290.QUEUE.INDEX)        -                           
                 CISZ(4096))                                                    
            IF MAXCC = 0  THEN                        -                         
               REPRO IFILE(INPUT1)                    -                         
               ODS(BP13.K290.QUEUE)                                             
      IF MAXCC = 0 THEN                              -                          
         DEF AIX (NAME(BP13.K290.QUEUE.ALTX1)       -                           
              REL(BP13.K290.QUEUE)                  -                           
              CYL(5  2)                              -                          
              SHR(2 3)                               -                          
              UNIQUE                                 -                          
              KEYS(13 46)                            -                          
              CISZ(4096)                             -                          
              RECSZ(31 44))                                                     
      IF LASTCC = 0 THEN                             -                          
         DEF PATH(NAME(BP13.K290.QUEUE.PATH1)        -                          
             PENT(BP13.K290.QUEUE.ALTX1))                                       
      IF LASTCC = 0 THEN                             -                          
         BIX IDS(BP13.K290.QUEUE)                    -                          
             ODS(BP13.K290.QUEUE.ALTX1)                                         
//******************************************************************            
//*  TO CLEAR  BP13.K238.HOLD.INFO                                              
//******************************************************************            
//STEP08    EXEC PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT  DD SYSOUT=*                                                         
//INPUT1    DD DSN=BP13.BLANK.CHAR150,DISP=SHR                                  
//SYSIN     DD  *                                                               
            DEL 'BP13.K238.HOLD.INFO' CL PURGE                                  
            DEF CLUSTER                                     -           00800000
                (NAME(BP13.K238.HOLD.INFO)                 -            00810000
                 CYL(10 5)                                -             00830000
                 UNIQUE                                     -           00840000
                 STORCLAS(PRODRLS)                           -                  
                 LOG(NONE)                                  -                   
                 SHR(2 3))                                  -           00850000
                DATA                                        -           00860000
                (NAME(BP13.K238.HOLD.INFO.DATA)            -            00870000
                 KEYS(8 0)                                 -            00880000
                 RECSZ(150 150)                             -           00890000
                 CISZ(4096)                                 -           00900000
                 FSPC(10 10))                               -           00910000
                INDEX                                       -           00920000
                (NAME(BP13.K238.HOLD.INFO.INDEX)           -            00930000
                 CISZ(4096))                                            00940000
            IF MAXCC = 0  THEN                              -           00950000
               REPRO IFILE(INPUT1)                          -           00960000
               ODS(BP13.K238.HOLD.INFO)                                 00720000
//*---------------------------------------------------------------------        
//* TO INCLUDE THE EQMS1 FOOTER                                                 
//*---------------------------------------------------------------------        
//STEP10 EXEC  PGM=BP13C23R,COND=(8,LT)                                         
//BP13F206 DD  DSN=BP13.F206.EQMS,DISP=MOD                                      
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
/*                                                                              
//******************************************************************            
//* FTP EQMS FILE TO HDBEQMSPF1 SERVER                                          
//******************************************************************            
//* STEP11   EXEC FTP,PARM='HDBEQMSPF1 (EXIT',COND=(8,LT)                       
//* NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                                
//* INPUT    DD *                                                               
//* CD  FTP\SOU\IN                                                              
//* ASCII                                                                       
//* PUT 'BP13.F206.EQMS' SOU_IN.TXT                                             
//* QUIT                                                                        
//*                                                                             
//******************************************************************            
//* FTP EQMS FILE TO HDBEQMSPF2 SERVER                                          
//******************************************************************            
//* STEP12   EXEC FTP,PARM='HDBEQMSPF2 (EXIT',COND=(8,LT)                       
//* NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                                
//* INPUT    DD *                                                               
//* CD  FTP\SOU\IN                                                              
//* ASCII                                                                       
//* PUT 'BP13.F206.EQMS' SOU_IN.TXT                                             
//* QUIT                                                                        
//*                                                                             
//******************************************************************            
//* SORT BY MODE/DTE-BALLOT/NT/FT/Q-NO                                          
//******************************************************************            
//STEP13   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K800.APPLN,DISP=SHR                                      
//SORTOUT  DD DSN=&&BP13F800,DISP=(,PASS),                                      
//        UNIT=SYSDA,DCB=(RECFM=FB,LRECL=2000),                                 
//        SPACE=(CYL,(100,50),RLSE)                                             
//SYSIN    DD  *                                                                
  SORT FIELDS=(4,8,A),FORMAT=CH                                                 
  INCLUDE COND=(1,1,CH,NE,C'C',AND,155,11,CH,NE,C'           ',AND,             
                1258,9,CH,EQ,C'         ',AND,                                  
                 963,1,CH,EQ,C'P',AND,                                          
                 785,6,CH,GE,C'201502')                                         
//******************************************************************            
//*  TO CREATE INTERFACE FILE FOR HLA FOR CASES                                 
//*     W/O HLA NO FROM 30 DAYS AFTER ACCEPTANCE                                
//******************************************************************            
//STEP14   EXEC PGM=BP13C25T,COND=(0,NE)                                        
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//BP13F800 DD DSN=&&BP13F800,DISP=(SHR,PASS)                                    
//BP13F313 DD DSN=&&P13F313A,DISP=(NEW,PASS),                                   
//            DCB=(RECFM=FB,LRECL=100,BLKSIZE=0),                               
//            SPACE=(CYL,(10,5),RLSE)                                           
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR                                      
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR                                    
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*****************************************************************             
//* REPRO TO BP13K313                                                           
//*****************************************************************             
//STEP15   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//INPUT    DD DSN=&&P13F313A,DISP=(OLD,DELETE)                                  
//OUTPUT   DD DSN=BP13.K313.TRANS.HLE,DISP=SHR                                  
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
   REPRO INFILE(INPUT) OUTFILE(OUTPUT) REPLACE                                  
/*                                                                              
//*****************************************************************             
//*  UPDATE K203-NUM-STATUS TO 'S' FOR ALL CASES INSIDE                         
//*  BP13.F203.SMS.BN                                                           
//*****************************************************************             
//STEP16   EXEC PGM=BP13C25X,COND=(0,NE)                                        
//BP13F203 DD DSN=BP13.F203.SMS.BN,DISP=SHR                                     
//BP13K203 DD DSN=BP13.K203.SMS,DISP=SHR                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*****************************************************************             
//* CLEAR BP13.F203.SMS.BN BEFORE PROCESSING BP13D806                           
//*****************************************************************             
//STEP17  EXEC   PGM=IEBGENER,COND=(0,NE)                                       
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUT1   DD  DSN=NULLFILE,                                                    
//             RECFM=FB,LRECL=200,                                              
//             BLKSIZE=0                                                        
//SYSUT2   DD  DSN=BP13.F203.SMS.BN,                                            
//             DISP=SHR                                                         
//SYSIN    DD  DUMMY                                                            
//*****************************************************************             
//* SORT OUT CASE FOR EMAIL NOTIFICATION FOR PRELIM AHG/ SHG                    
//*****************************************************************             
//STEP18   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K800.APPLN,DISP=SHR                                      
//SORTOUT  DD DSN=&&BP13F80A,DISP=(NEW,PASS),                                   
//          DCB=(RECFM=FB,LRECL=200,BLKSIZE=0),                                 
//          SPACE=(CYL,(10,5),RLSE)                                             
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
   SORT FIELDS=(4,8,A),FORMAT=CH                                                
   INCLUDE COND=(1,1,CH,NE,C'C',AND,1847,1,CH,NE,C' ',AND,                      
                 1848,1,CH,EQ,C'V')                                             
   OUTREC FIELDS=(4,8,1847,2,190X)                                              
/*                                                                              
//*-------------------------------------------------------------------*         
//*  SPLIT SMS.PCD CASES INTO 3 PARTS                                           
//*--------------------------------------------------------------------         
//STEP19   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&BP13F80A,DISP=SHR                                           
//OUT1     DD DSN=&&BP13F80B,DISP=(NEW,PASS),                                   
//         UNIT=SYSDA,DCB=(RECFM=FB,LRECL=200),                                 
//         SPACE=(CYL,(5,5),RLSE)                                               
//OUT2     DD DSN=&&BP13F80C,DISP=(NEW,PASS),                                   
//         UNIT=SYSDA,DCB=(RECFM=FB,LRECL=200),                                 
//         SPACE=(CYL,(5,5),RLSE)                                               
//OUT3     DD DSN=&&BP13F80D,DISP=(NEW,PASS),                                   
//         UNIT=SYSDA,DCB=(RECFM=FB,LRECL=200),                                 
//         SPACE=(CYL,(5,5),RLSE)                                               
//SYSIN    DD  *                                                                
   OPTION COPY                                                                  
   OUTFIL FNAMES=(OUT1,OUT2,OUT3),SPLIT                                         
/*                                                                              
//*--------------------------------------------------------------------*        
//* RUN PROGRAM TO CREATE NOTIFICATION MESSAGE TO SEND                          
//* TO THE MESSAGE QUEUE (BY EMAIL)                                             
//* EMAIL NOTIFICATION FOR PRELIM AHG/SHG                                       
//* APPT TYPE = (PB)                                                            
//*--------------------------------------------------------------------*        
//STEP20   EXEC MQBATCH,NAME=BP13CS20,COND=(0,NE)                               
//STEPLIB  DD                                                                   
//         DD                                                                   
//         DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//BP13F80A DD DSN=&&BP13F80B,DISP=(OLD,DELETE)                                  
//BP13K857 DD DSN=BP13.K857.EMAIL,DISP=SHR                                      
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR                                      
//BP13K848 DD DSN=BP13.K848.BKIMAGE,DISP=SHR                                    
//SYSDBG   DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DSN=MQSERIES.ALIAS.QMGR,DISP=SHR                                  
//*--------------------------------------------------------------------*        
//STEP21   EXEC MQBATCH,NAME=BP13CS20,COND=(0,NE)                               
//STEPLIB  DD                                                                   
//         DD                                                                   
//         DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//BP13F80A DD DSN=&&BP13F80C,DISP=(OLD,DELETE)                                  
//BP13K857 DD DSN=BP13.K857.EMAIL,DISP=SHR                                      
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR                                      
//BP13K848 DD DSN=BP13.K848.BKIMAGE,DISP=SHR                                    
//SYSDBG   DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DSN=MQSERIES.ALIAS.QMGR,DISP=SHR                                  
//*--------------------------------------------------------------------*        
//STEP22   EXEC MQBATCH,NAME=BP13CS20,COND=(0,NE)                               
//STEPLIB  DD                                                                   
//         DD                                                                   
//         DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//BP13F80A DD DSN=&&BP13F80D,DISP=(OLD,DELETE)                                  
//BP13K857 DD DSN=BP13.K857.EMAIL,DISP=SHR                                      
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR                                      
//BP13K848 DD DSN=BP13.K848.BKIMAGE,DISP=SHR                                    
//SYSDBG   DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DSN=MQSERIES.ALIAS.QMGR,DISP=SHR                                  
//*                                                                             
//*-------------------------------------------------------------------*         
//* TO UPDATE BP13KL00 AFTER SENDING EMAIL IN BP13D807                          
//*-------------------------------------------------------------------*         
//STEP23   EXEC PGM=BP13C25C,COND=(0,NE)                                        
//BP13F23C DD DSN=BP13.F23C.EMAIL.BK,DISP=SHR                                   
//BP13KL00 DD DSN=BP13.KL00.LETTER,DISP=SHR                                     
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* SORT BP13K454                                                               
//*---------------------------------------------------------------------        
//STEP30  EXEC SORT,COND=(0,NE)                                                 
//SORTIN   DD DSN=BP13.K454.APPTABLE,DISP=SHR                                   
//SORTOUT  DD DSN=&&F454C371,DISP=(NEW,PASS),                                   
//         UNIT=SYSDA,SPACE=(CYL,(100,50),RLSE),                                
//         DCB=(RECFM=FB,LRECL=100)                                             
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,22,A,1,8,A),FORMAT=CH                                         
//*---------------------------------------------------------------------        
//*JOIN K454 AND K800                                                           
//*---------------------------------------------------------------------        
//STEP31   EXEC SORT,COND=(0,NE)                                                
//SORTJNF1 DD DSN=&&F454C371,DISP=(OLD,PASS)                                    
//SORTJNF2 DD DSN=BP13.K800.APPLN,DISP=SHR                                      
//SORTOUT  DD DSN=&&F800C371,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(100,50),RLSE),                             
//            DCB=(RECFM=FB,LRECL=2000)                                         
//SYSIN    DD *                                                                 
   SORT FIELDS=COPY                                                             
   JOINKEYS FILES=F1,FIELDS=(15,8,A)                                            
   JOINKEYS FILES=F2,FIELDS=(4,8,A)                                             
   REFORMAT FIELDS=(F2:1,2000)                                                  
//*---------------------------------------------------------------------        
//*---------------------------------------------------------------------        
//* RUN PROGRAM C371 TO GENERATE XML FOR AGT                                    
//*---------------------------------------------------------------------        
//STEP32   EXEC PGM=BP13C371,COND=(0,NE)                                        
//BP13F800 DD DSN=&&F800C371,DISP=(OLD,PASS)                                    
//BP13K022 DD DSN=BP13.K022.WISOIC,DISP=SHR                                     
//BP13K021 DD DSN=BP13.K022.WISOIC.PATH1,DISP=SHR                               
//BP13K454 DD DSN=BP13.K454.APPTABLE,DISP=SHR                                   
//BP13K451 DD DSN=BP13.K454.APPTABLE.PATH1,DISP=SHR                             
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR                                      
//BP13K480 DD DSN=BP13.K480.CONTRA,DISP=SHR                                     
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//BP13F208 DD DSN=BP13.F371.HQMS.AGR.XML,DISP=SHR                               
//BP13F290 DD DSN=BP13.F371.HQMS.AGR.OUTPUT,DISP=SHR                            
//SYSPRINT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//******************************************************************            
//* FTP EQMS FILE TO HQMSIFSGP01 SERVER                                         
//******************************************************************            
//STEP33   EXEC FTP,PARM='HQMSIFSGP01 (EXIT',COND=(8,LT)                        
//NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                                  
//INPUT    DD *                                                                 
  CD  HQMS\FTP\SOU\IN                                                           
  ASCII                                                                         
  PUT 'BP13.F371.HQMS.AGR.XML' SOU_AGR_IN.XML                                   
  QUIT                                                                          
//*                                                                             
//*-----------------------------------------------------------------            
//* SORT OUT CASES WITHOUT AGR OR TP APPT                                       
//*-----------------------------------------------------------------            
//STEP34 EXEC    SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=BP13.K800.APPLN,                                             
//             DISP=SHR,                                                        
//             AMP=('BUFNI=8','BUFND=4')                                        
//SORTOUT  DD  DSN=&&BP13F80B,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=SYSDA,                                                      
//             SPACE=(CYL,(100,20),RLSE),                                       
//             DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                              
//SYSIN    DD  *                                                                
   SORT FIELDS=(4,8,A),FORMAT=CH                                                
   INCLUDE COND=(1,1,CH,NE,C'C',AND,                                            
                 4,8,CH,LT,C'90000000',AND,                                     
                 4,1,CH,NE,C'5',AND,                                            
                 365,8,CH,EQ,C'        ',AND,                                   
                 475,8,CH,EQ,C'        ',AND,                                   
                 924,3,CH,NE,C'OBF')                                            
//*-----------------------------------------------------------------            
//* PREP FOR HQMS UPLOADING                                                     
//* F290 - CURRENTLY IT IS TO DUMMY, REPLACE IT ONCE WE DECOMM EQMS             
//*-----------------------------------------------------------------            
//STEP35  EXEC PGM=BP13C221,COND=(0,NE)                                         
//BP13F800 DD  DSN=&&BP13F80B,                                                  
//             DISP=(OLD,DELETE)                                                
//BP13F206 DD  DSN=BP13.F206.HQMS,                                              
//             DISP=OLD                                                         
//BP13F290 DD  DUMMY                                                            
//SY02F001 DD  DSN=SY02.F001.DATE,                                              
//             DISP=SHR                                                         
//BP13K820 DD  DSN=BP13.K820.OCCUP,                                             
//             DISP=SHR,                                                        
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13K022 DD  DSN=BP13.K022.WISOIC,                                            
//             DISP=SHR                                                         
//BP13K021 DD  DSN=BP13.K022.WISOIC.PATH1,                                      
//             DISP=SHR                                                         
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
/*                                                                              
//******************************************************************            
//* FTP HQMS FILE TO HQMSIFSGP01 SERVER (PRODUCTION SERVER)                     
//******************************************************************            
//STEP36   EXEC FTP,PARM='HQMSIFSGP01 (EXIT',COND=(8,LT)                        
//NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                                  
//INPUT    DD *                                                                 
  CD  HQMS\FTP\SOU\IN                                                           
  ASCII                                                                         
  PUT 'BP13.F206.HQMS' SOU_IN.XML                                               
  QUIT                                                                          
//*                                                                             
//******************************************************************            
//*---------------------------------------------------------------------        
//******************************************************************            
//* BACKUP HQMS FILE                                                            
//*---------------------------------------------------------------------        
//STEP99   EXEC PGM=IDCAMS                                                      
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F371.HQMS.AGR.XML,DISP=SHR                               
//OUTPUT1  DD DSN=BP13.F371.HQMS.AGR.XML.AFDAILY(+1),DISP=(NEW,CATLG),          
//            SPACE=(CYL,(2,3)),                                                
//            DCB=(BP13.GDG,BLKSIZE=27900,LRECL=150,RECFM=FB)                   
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
