//BP13ADPC JOB (BP13P),'BP13ADPC',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//             NOTIFY=CSD0071                                                   
/*JOBPARM      LINECT=0                                                         
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,                                          
//             DISP=SHR                                                         
//*********************************************************************         
//* IMPORTANT NOTE :                                                            
//* THIS JCL IS FOR PRINTING OF APPLN FORM AND DOC TO BRING FORM                
//* SUCC CASES ONLY                                                             
//* FOR DBSS ONLY                                                               
//*********************************************************************         
//* BP132870 20061115 CKK  NEW JCL                                              
//* BP133610 20090601 ESA1 REPLACE BP13K767 WITH BP13K816                       
//* BP134400 20111110 DW51 ENHANCE JCL FOR D11                                  
//*-----------------------------------------------------------------            
//PRT01    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
$DJDE$ JDE=BP13D,JDL=BP13,END;                                                  
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALST11                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*                                                                             
//*-----------------------------------------------------------------            
//PRT02    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
$DJDE$ JDE=BP13D,JDL=BP13,END;                                                  
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALST12                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*                                                                             
//*-----------------------------------------------------------------            
//PRT03    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
$DJDE$ JDE=BP13D,JDL=BP13,END;                                                  
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALST13                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*                                                                             
//*-----------------------------------------------------------------            
//PRT04    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
$DJDE$ JDE=BP13D,JDL=BP13,END;                                                  
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALST14                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*                                                                             
//*=================================================================            
//* INVITATION LETTER, MCPS, DOCUMENT, NON-DEL, APPLN LETTER (ORIG)             
//*-----------------------------------------------------------------            
//PRT0A    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
$DJDE$ JDE=13C24X,COPIES=1,JDL=BP13,END;                                        
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALST1A                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*                                                                             
//*=================================================================            
//* INVITATION LETTER,  DOCUMENT,  APPLN LETTER (FILE COPY)                     
//*-----------------------------------------------------------------            
//PRT0B    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
$DJDE$ JDE=13C24X,COPIES=1,JDL=BP13,END;                                        
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALST1B                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*=================================================================            
//* INVITATION LETTER,  DOCUMENT,  APPLN LETTER (FILE COPY)                     
//*-----------------------------------------------------------------            
//PRT0F    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
$DJDE$ JDE=13C24X,COPIES=1,JDL=BP13,END;                                        
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALST1F                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*=================================================================            
//* INVITATION LETTER,  DOCUMENT,  APPLN LETTER (FILE COPY)                     
//*-----------------------------------------------------------------            
//PRT0G    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
$DJDE$ JDE=13C24X,COPIES=1,JDL=BP13,END;                                        
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALST1G                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*-----------------------------------------------------------------            
//*  SORT BY QUEUE NO AND REGISTRATION NUMBER                                   
//*  SUCC CASES ONLY                                                            
//*-----------------------------------------------------------------            
//PS0100   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K740.MATUREBA,DISP=SHR                                   
//SORTOUT  DD DSN=&&P13F740S,DISP=(NEW,PASS),                                   
//            SPACE=(CYL,(80,30),RLSE),                                         
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                            
//SYSIN    DD *                                                                 
  SORT FIELDS=(235,5,A,123,8,A),FORMAT=CH                                       
//*=================================================================            
//*  PRINT APPLN FORM AND DOC TO BRING FORM (SUCCESSFUL)                        
//*=================================================================            
//*PS0120   EXEC PGM=BP13C89Z,COND=(0,NE)                                       
//*BP13F200 DD DUMMY                                                            
//*BP13F740 DD DSN=&&P13F740S,DISP=(SHR,PASS)                                   
//*BP13K200 DD DSN=BP13.K200.BKAPPMT,DISP=SHR                                   
//*BP13K201 DD DSN=BP13.K200.BKAPPMT.PATH1,DISP=SHR                             
//*BP13K060 DD DSN=BP13.K060.CODETAB,DISP=SHR                                   
//*BP13KB78 DD DSN=BP13.KB78.DBSREQ,DISP=SHR                                    
//*BP13K816 DD DSN=BP13.K816.BTODATA,DISP=SHR                                   
//*BP13K800 DD DSN=BP13.K800.APPLN.DBS,DISP=SHR                                 
//*BP13K820 DD DSN=BP13.K820.OCCUP.DBS,DISP=SHR                                 
//*BP13K830 DD DSN=BP13.K830.ADDR,DISP=SHR                                      
//*BP13K831 DD DSN=BP13.K830.ADDR.PATH1,DISP=SHR                                
//*BP13F398 DD DSN=BP13.F398.APPLDOC.BEBTO,DISP=OLD                             
//*P13P89DA DD SYSOUT=2,OUTPUT=(*.PRT0A.FORMID)                                 
//*P13P89DB DD SYSOUT=M                                                         
//*P13L89DA DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                 
//*P13L89DB DD SYSOUT=2,OUTPUT=(*.PRT02.FORMID)                                 
//*SYSPRINT DD SYSOUT=*                                                         
//*SYSOUT   DD SYSOUT=*                                                         
//*SYSDBG   DD SYSOUT=*                                                         
//*SYSDBOUT DD SYSOUT=*                                                         
//*                                                                             
//*=================================================================            
//*  PRINT DOCUMENTS TO BRING FORM (SUCCESSFUL)                                 
//*=================================================================            
//PS0120   EXEC PGM=BP13C89Y,COND=(0,NE)                                        
//BP13F200 DD DUMMY                                                             
//BP13F740 DD DSN=&&P13F740S,DISP=(OLD,PASS)                                    
//BP13K200 DD DSN=BP13.K200.BKAPPMT,DISP=SHR                                    
//BP13K201 DD DSN=BP13.K200.BKAPPMT.PATH1,DISP=SHR                              
//BP13KA10 DD DSN=BP13.KA10.PRJCT,DISP=SHR                                      
//BP13K060 DD DSN=BP13.K060.CODETAB,DISP=SHR                                    
//BP13KB78 DD DSN=BP13.KB78.DBSREQ,DISP=SHR                                     
//BP13K816 DD DSN=BP13.K816.BTODATA,DISP=SHR                                    
//BP13K800 DD DSN=BP13.K800.APPLN.DBS,DISP=SHR                                  
//BP13K820 DD DSN=BP13.K820.OCCUP.DBS,DISP=SHR                                  
//BP13K830 DD DSN=BP13.K830.ADDR,DISP=SHR                                       
//BP13K831 DD DSN=BP13.K830.ADDR.PATH1,DISP=SHR                                 
//BP13F398 DD DSN=BP13.F398.APPLDOC.BEBTO,DISP=SHR                              
//P13P89DA DD SYSOUT=2,OUTPUT=(*.PRT0F.FORMID)                                  
//P13P89DB DD SYSOUT=M                                                          
//P13L89DA DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//P13L89DB DD SYSOUT=2,OUTPUT=(*.PRT02.FORMID)                                  
//SYSPRINT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*                                                                             
//*=================================================================            
//*  PRINT DOCUMENTS TO BRING FORM (SUCCESSFUL)                                 
//*=================================================================            
//PS0121   EXEC PGM=BP13C89Y,COND=(0,NE)                                        
//BP13F200 DD DUMMY                                                             
//BP13F740 DD DSN=&&P13F740S,DISP=(OLD,DELETE)                                  
//BP13K200 DD DSN=BP13.K200.BKAPPMT,DISP=SHR                                    
//BP13K201 DD DSN=BP13.K200.BKAPPMT.PATH1,DISP=SHR                              
//BP13KA10 DD DSN=BP13.KA10.PRJCT,DISP=SHR                                      
//BP13K060 DD DSN=BP13.K060.CODETAB,DISP=SHR                                    
//BP13KB78 DD DSN=BP13.KB78.DBSREQ,DISP=SHR                                     
//BP13K816 DD DSN=BP13.K816.BTODATA,DISP=SHR                                    
//BP13K800 DD DSN=BP13.K800.APPLN.DBS,DISP=SHR                                  
//BP13K820 DD DSN=BP13.K820.OCCUP.DBS,DISP=SHR                                  
//BP13K830 DD DSN=BP13.K830.ADDR,DISP=SHR                                       
//BP13K831 DD DSN=BP13.K830.ADDR.PATH1,DISP=SHR                                 
//BP13F398 DD DSN=BP13.F398.APPLDOC.BEBTO,DISP=SHR                              
//P13P89DA DD SYSOUT=2,OUTPUT=(*.PRT0G.FORMID)                                  
//P13P89DB DD SYSOUT=M                                                          
//P13L89DA DD SYSOUT=2,OUTPUT=(*.PRT03.FORMID)                                  
//P13L89DB DD SYSOUT=2,OUTPUT=(*.PRT04.FORMID)                                  
//SYSPRINT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*                                                                             
