//BP13ADPD JOB (BP13P),'BP13ADPD',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//             NOTIFY=CSD0071                                                   
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,                                          
//             DISP=SHR                                                         
//**************************************************************                
//* CHG-NO   BY   ON    - DESCRIPTION                                           
//*----------------------------------                                           
//* BP133610 ESA1020609 - TO DELETE BP13K767 IN PROGRAM BP13C24B                
//* BP134400 ESA1101111 - ENHANCE JCL FOR D11                                   
//*=================================================================            
//* DBSS                                                                        
//*=================================================================            
//* PRINT INVITATION LETTER TO SUCCESSFUL APPLICANT                             
//* PRINT LETTER TO INFORM UNSUCCESSFUL APPLICANT                               
//*=================================================================            
//* NON-GRO LETTER (100% SUCCESSFUL)                                            
//*-----------------------------------------------------------------            
//PRT01    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAAL1A CP-1',END;                                      
1$DJDE$ JDE=13CC5A,JDL=BP13,END;                                                
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAAL1A                                     
//SYSUT2   DD SYSOUT=W,OUTPUT=(*.FORMID),DEST=IOMW                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*                                                                             
//*-----------------------------------------------------------------            
//* NON-GRO LETTER (101 - 200% SUCCESSFUL)                                      
//*-----------------------------------------------------------------            
//PRT02    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAAL1B CP-1',END;                                      
1$DJDE$ JDE=13CC5B,JDL=BP13,END;                                                
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAAL1B                                     
//SYSUT2   DD SYSOUT=W,OUTPUT=(*.FORMID),DEST=IOMW                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*                                                                             
//*-----------------------------------------------------------------            
//* GRO LETTER (100% SUCCESSFUL)                                                
//*-----------------------------------------------------------------            
//PRT03    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAAL1C CP-1',END;                                      
1$DJDE$ JDE=13CC5C,JDL=BP13,END;                                                
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAAL1C                                     
//SYSUT2   DD SYSOUT=W,OUTPUT=(*.FORMID),DEST=IOMW                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*                                                                             
//*-----------------------------------------------------------------            
//* NON-GRO UNSUCCESSFUL                                                        
//*-----------------------------------------------------------------            
//PRT04    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAAL1D CP-1',END;                                      
1$DJDE$ JDE=13POT4,JDL=BP13,FORMS=BP13DC,END;                                   
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAAL1D                                     
//SYSUT2   DD SYSOUT=W,OUTPUT=(*.FORMID),DEST=IOMW                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*                                                                             
//*-----------------------------------------------------------------            
//* GRO UNSUCCESSFUL                                                            
//*-----------------------------------------------------------------            
//PRT05    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAAL1E CP-1',END;                                      
1$DJDE$ JDE=13POT4,JDL=BP13,FORMS=BP13DF,END;                                   
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAAL1E                                     
//SYSUT2   DD SYSOUT=W,OUTPUT=(*.FORMID),DEST=IOMW                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*                                                                             
//*-----------------------------------------------------------------            
//PRT06    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAAL1F CP-1',END;                                      
1$DJDE$ JDE=13CC5A,JDL=BP13,END;                                                
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAAL1F                                     
//SYSUT2   DD SYSOUT=W,OUTPUT=(*.FORMID),DEST=IOMW                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*                                                                             
//*-----------------------------------------------------------------            
//* NON-GRO LETTER (101 - 200% SUCCESSFUL)                                      
//*-----------------------------------------------------------------            
//PRT07    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAAL1G CP-1',END;                                      
1$DJDE$ JDE=13CC5B,JDL=BP13,END;                                                
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAAL1G                                     
//SYSUT2   DD SYSOUT=W,OUTPUT=(*.FORMID),DEST=IOMW                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*                                                                             
//*-----------------------------------------------------------------            
//* GRO LETTER (100% SUCCESSFUL)                                                
//*-----------------------------------------------------------------            
//PRT08    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAAL1H CP-1',END;                                      
1$DJDE$ JDE=13CC5C,JDL=BP13,END;                                                
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAAL1H                                     
//SYSUT2   DD SYSOUT=W,OUTPUT=(*.FORMID),DEST=IOMW                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*                                                                             
//*=================================================================            
//* SORT BY QUEUE NUMBER                                                        
//*-----------------------------------------------------------------            
//SORT01   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K200.BKAPPMT,DISP=SHR,                                   
//            AMP=('BUFND=4','BUFNI=8')                                         
//SORTOUT  DD DSN=&&F200SUCC,DISP=(NEW,PASS),                                   
//            SPACE=(CYL,(20,10),RLSE),                                         
//            DCB=(RECFM=FB,LRECL=300,BLKSIZE=0)                                
//SYSIN    DD *                                                                 
    SORT FIELDS=(57,5,A),FORMAT=CH                                              
    INCLUDE COND=(14,1,CH,EQ,C'5',AND,                                          
                  1,8,CH,EQ,C'20111118')                                        
//*-----------------------------------------------------------------            
//*  PRINT SUCCESSFUL INVITATION                                                
//*-----------------------------------------------------------------            
//STEP02   EXEC  PGM=BP13CC55,COND=(0,NE)                                       
//BP13F200 DD  DSN=&&F200SUCC,DISP=(SHR,PASS)                                   
//BP13K740 DD  DSN=BP13.K740.MATUREBA,DISP=SHR,                                 
//             AMP=('BUFND=8','BUFNI=4')                                        
//BP13K741 DD  DSN=BP13.K740.MATUREBA.PATH1,DISP=SHR,                           
//             AMP=('BUFND=8','BUFNI=4')                                        
//BP13K820 DD  DSN=BP13.K820.OCCUP.DBS,DISP=SHR,                                
//             AMP=('BUFND=8','BUFNI=4')                                        
//BP13K830 DD  DSN=BP13.K830.ADDR,DISP=SHR,                                     
//             AMP=('BUFND=8','BUFNI=4')                                        
//BP13K831 DD  DSN=BP13.K830.ADDR.PATH1,DISP=SHR,                               
//             AMP=('BUFND=8','BUFNI=4')                                        
//P13PC55A DD  SYSOUT=W,OUTPUT=(*.PRT01.FORMID),DEST=IOMW                       
//P13PC55B DD  SYSOUT=W,OUTPUT=(*.PRT02.FORMID),DEST=IOMW                       
//P13PC55C DD  SYSOUT=W,OUTPUT=(*.PRT03.FORMID),DEST=IOMW                       
//SYSTSPRT DD  SYSOUT=*                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
/*                                                                              
//*-----------------------------------------------------------------            
//*  PRINT SUCCESSFUL INVITATION                                                
//*-----------------------------------------------------------------            
//STEP2A   EXEC  PGM=BP13CC55,COND=(0,NE)                                       
//BP13F200 DD  DSN=&&F200SUCC,DISP=(SHR,PASS)                                   
//BP13K740 DD  DSN=BP13.K740.MATUREBA,DISP=SHR,                                 
//             AMP=('BUFND=8','BUFNI=4')                                        
//BP13K741 DD  DSN=BP13.K740.MATUREBA.PATH1,DISP=SHR,                           
//             AMP=('BUFND=8','BUFNI=4')                                        
//BP13K820 DD  DSN=BP13.K820.OCCUP.DBS,DISP=SHR,                                
//             AMP=('BUFND=8','BUFNI=4')                                        
//BP13K830 DD  DSN=BP13.K830.ADDR,DISP=SHR,                                     
//             AMP=('BUFND=8','BUFNI=4')                                        
//BP13K831 DD  DSN=BP13.K830.ADDR.PATH1,DISP=SHR,                               
//             AMP=('BUFND=8','BUFNI=4')                                        
//P13PC55A DD  SYSOUT=W,OUTPUT=(*.PRT06.FORMID),DEST=IOMW                       
//P13PC55B DD  SYSOUT=W,OUTPUT=(*.PRT07.FORMID),DEST=IOMW                       
//P13PC55C DD  SYSOUT=W,OUTPUT=(*.PRT08.FORMID),DEST=IOMW                       
//SYSTSPRT DD  SYSOUT=*                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
/*                                                                              
//*=================================================================            
//*  PRINT UNSUCCESSFUL LETTER                                                  
//*-----------------------------------------------------------------            
//*STEP03   EXEC SORT,COND=(0,NE)                                               
//*SORTIN   DD DSN=BP13.K740.MATUREBA,DISP=SHR                                  
//*SORTOUT  DD DSN=&&F740NGRO,DISP=(NEW,PASS),                                  
//*            UNIT=SYSDA,                                                      
//*            DCB=(RECFM=FB,LRECL=500),                                        
//*            SPACE=(CYL,(20,10),RLSE)                                         
//*SYSIN    DD *                                                                
//*   SORT FIELDS=(123,8,A),FORMAT=CH                                           
//*   INCLUDE COND=(163,2,CH,EQ,C'  ',AND,                                      
//*                 260,1,CH,EQ,C'W',AND,                                       
//*                 376,3,CH,EQ,C'DBS')                                         
//*-----------------------------------------------------------------            
//*  PRINT UNSUCCESSFUL (NON-GRO)                                               
//*-----------------------------------------------------------------            
//*STEP04   EXEC  PGM=BP13CC56,COND=(0,NE)                                      
//*BP13F740 DD  DSN=&&F740NGRO,DISP=(OLD,DELETE)                                
//*BP13K825 DD  DSN=BP13.K825.REQOCCP,                                          
//*             DISP=SHR,                                                       
//*             AMP=('BUFND=8','BUFNI=4')                                       
//*BP13K830 DD  DSN=BP13.K830.ADDR,                                             
//*             DISP=SHR,                                                       
//*             AMP=('BUFND=8','BUFNI=4')                                       
//*BP13K831 DD  DSN=BP13.K830.ADDR.PATH1,                                       
//*             DISP=SHR,                                                       
//*             AMP=('BUFND=8','BUFNI=4')                                       
//*BP13PC56 DD  SYSOUT=2,OUTPUT=(*.PRT04.FORMID),DEST=IOM2                      
//*SYSTSPRT DD  SYSOUT=*                                                        
//*SYSPRINT DD  SYSOUT=*                                                        
//*SYSUDUMP DD  SYSOUT=*                                                        
//*SYSOUT   DD  SYSOUT=*                                                        
//*SYSDBOUT DD  SYSOUT=*                                                        
//*                                                                             
//*------------------------------------------------------------------           
//*STEP03   EXEC SORT,COND=(0,NE)                                               
//*SORTIN   DD DSN=BP13.K740.MATUREBA,DISP=SHR                                  
//*SORTOUT  DD DSN=&&F740GRO,DISP=(NEW,PASS),                                   
//*            UNIT=SYSDA,                                                      
//*            DCB=(RECFM=FB,LRECL=500),                                        
//*            SPACE=(CYL,(20,10),RLSE)                                         
//*SYSIN    DD *                                                                
//*   SORT FIELDS=(123,8,A),FORMAT=CH                                           
//*   INCLUDE COND=(163,2,CH,NE,C'  ',AND,                                      
//*                 260,1,CH,EQ,C'W',AND,                                       
//*                 376,3,CH,EQ,C'DBS')                                         
//*-----------------------------------------------------------------            
//*  PRINT UNSUCCESSFUL (GRO)                                                   
//*-----------------------------------------------------------------            
//*STEP04   EXEC  PGM=BP13CC56,COND=(0,NE)                                      
//*BP13F740 DD  DSN=&&F740GRO,DISP=(OLD,DELETE)                                 
//*BP13K825 DD  DSN=BP13.K825.REQOCCP,                                          
//*             DISP=SHR,                                                       
//*             AMP=('BUFND=8','BUFNI=4')                                       
//*BP13K830 DD  DSN=BP13.K830.ADDR,                                             
//*             DISP=SHR,                                                       
//*             AMP=('BUFND=8','BUFNI=4')                                       
//*BP13K831 DD  DSN=BP13.K830.ADDR.PATH1,                                       
//*             DISP=SHR,                                                       
//*             AMP=('BUFND=8','BUFNI=4')                                       
//*BP13PC56 DD  SYSOUT=2,OUTPUT=(*.PRT05.FORMID),DEST=IOM2                      
//*SYSTSPRT DD  SYSOUT=*                                                        
//*SYSPRINT DD  SYSOUT=*                                                        
//*SYSUDUMP DD  SYSOUT=*                                                        
//*SYSOUT   DD  SYSOUT=*                                                        
//*SYSDBOUT DD  SYSOUT=*                                                        
//*                                                                             
//*********************************************************************         
//* PRINT CHECKLIST AND ATTENDANT LIST FOR DBSS                                 
//*********************************************************************         
//*----------------------------------------------------------------             
//*   TO PRINT CHECK LIST OF APPOINTMENT LETTER                                 
//*----------------------------------------------------------------             
//STEP05 EXEC    PGM=BP13C24A,COND=(0,NE)                                       
//BP13F200 DD  DSN=&&F200SUCC,DISP=(SHR,PASS)                                   
//BP13KB20 DD  DSN=BP13.KB20.DBSBK,                                             
//             DISP=SHR,                                                        
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13K800 DD  DSN=BP13.K800.APPLN.DBS,                                         
//             DISP=SHR,                                                        
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13K820 DD  DSN=BP13.K820.OCCUP.DBS,                                         
//             DISP=SHR,                                                        
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13K830 DD  DSN=BP13.K830.ADDR,                                              
//             DISP=SHR,                                                        
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13K831 DD  DSN=BP13.K830.ADDR.PATH1,                                        
//             DISP=SHR,                                                        
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13L24A DD  DSN=BP13.L24A.CHKLIST,DISP=SHR                                   
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
/*                                                                              
//*---------------------------------------------------------------------        
//* SORT F200 BY ADTE/NT/FT/DTE-APPT/TIME/REGN                                  
//*---------------------------------------------------------------------        
//STEP06 EXEC    SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=BP13.K200.BKAPPMT,                                           
//             DISP=SHR                                                         
//SORTOUT  DD  DSN=&&P13F200H,                                                  
//             DISP=(NEW,PASS),                                                 
//             SPACE=(CYL,(10,5),RLSE),                                         
//             DCB=(BLKSIZE=23400,LRECL=300,RECFM=FB)                           
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,13,A,38,12,A,57,5,A),FORMAT=CH                                
   INCLUDE COND=(14,1,CH,EQ,C'5',AND,                                           
                  1,8,CH,EQ,C'20111118')                                        
/*                                                                              
//*--------------------------------------------------------------------         
//*     PRINT ATTENDANCE LIST                                                   
//*     BP13C231 REPLACE FOCUS BM06705A                                         
//*--------------------------------------------------------------------         
//STEP24 EXEC    PGM=BP13C24B,COND=(0,NE)                                       
//BP13F200 DD  DSN=&&P13F200H,                                                  
//             DISP=(SHR,PASS)                                                  
//BP13K800 DD  DSN=BP13.K800.APPLN.DBS,                                         
//             DISP=SHR,                                                        
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13K820 DD  DSN=BP13.K820.OCCUP.DBS,                                         
//             DISP=SHR,                                                        
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13KB20 DD  DSN=BP13.KB20.DBSBK,                                             
//             DISP=SHR,                                                        
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13K060 DD  DSN=BP13.K060.CODETAB,                                           
//             DISP=SHR,                                                        
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13L24B DD  DSN=BP13.L24B.ATTLIST,                                           
//             DISP=SHR                                                         
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
/*                                                                              
