//BP13A241 JOB (BP13P),'BP13A241',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//             NOTIFY=CSD0071                                                   
/*JOBPARM LINECT=0                                                              
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,                                          
//             DISP=SHR                                                         
//*********************************************************************         
//* CHG-NO   BY   DATE    DESCRIPTION                                           
//* -------- ---- ------ -------------------------------------------            
//* BP132423 MTD  221103 JCL FOR PRICING REPORT                                 
//* BP132546 YCH 110604 - INCLUDE STORCLAS(PRODRLS) & LOG(NONE)                 
//* BP132689 LMS 280405 - CHANGE PRINTER ID FROM L434 TO L03Z.                  
//* BP135171 RJE1 100214  TO CATER FOR DB2 UPGRADE                              
//* BP135404 EL27 20140711 CHANGE PRINTER FROM L03Z TO X6AI                     
//* BP135404 NST1 20140719 CHANGE PRINTER FROM X6AI TO X6AU(LANDSCAPE)          
//* BP135561 ESA1 20150115 OUTPUT TO DATASET BEFORE SENDING TO PRINTER          
//* BP136836 ESA1 20170807 CHANGE PRINTER FROM X6AU TO XDA2                     
//*********************************************************************         
//*-----------------------------------------------------------------            
//*  TO SEND DYNAMIC JOB DESCRIPTOR ENTRIES AHEAD OF THE PRINT                  
//*  DATASET, SINGLE COPY                                                       
//*-----------------------------------------------------------------            
//PRT01  EXEC    PGM=IEBGENER,COND=(0,NE)                                       
//SYSUT1   DD  *                                                                
$DJDE$ JDE=BP13D,JDL=BP13,END;                                                  
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAAL1A                                     
//SYSUT2   DD  SYSOUT=2,OUTPUT=(*.FORMID)                                       
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//*---------------------------------------------------------------------        
//*      VERIFY FILES BEFORE DAILY PRODUCTION RUN                               
//*--------------------------------------------------------------------         
//STEP00 EXEC    PGM=IDCAMS,COND=(0,NE)                                         
//INPUT1   DD  DSN=BP13.K207.SPREC,                                             
//             DISP=OLD                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  *                                                                
          VFY FILE(INPUT1)                                                      
/*                                                                              
//*-----------------------------------------------------------------            
//*   SORT CONTROL RECORD                                                       
//*-----------------------------------------------------------------            
//STEP01 EXEC    SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=BP13.K207.SPREC,                                             
//             DISP=SHR                                                         
//SORTOUT  DD  DSN=BP13.F207.SPREC,                                             
//             DISP=OLD                                                         
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,18,A),FORMAT=CH                                               
   INCLUDE COND=(169,8,CH,EQ,C'BP13A241')                                       
/*                                                                              
//*-----------------------------------------------------------------            
//*   BP13C203 - PRINT PRICING REPORT                                           
//*-----------------------------------------------------------------            
//STEP02 EXEC    PGM=IKJEFT01,COND=(0,NE),                                      
//             REGION=4096K,                                                    
//             DYNAMNBR=20                                                      
//BP13F207 DD  DSN=BP13.F207.SPREC,                                             
//             DISP=SHR                                                         
//BM06K110 DD  DSN=BM06.K110.FLATINV,                                           
//             DISP=SHR,                                                        
//             AMP=('BUFND=8','BUFNI=4')                                        
//BM06K111 DD  DSN=BM06.K110.FLATINV.PATH2,                                     
//             DISP=SHR,                                                        
//             AMP=('BUFND=8','BUFNI=4')                                        
//BM06K100 DD  DSN=BM06.K100.BLOCK,                                             
//             DISP=SHR,                                                        
//             AMP=('BUFND=8','BUFNI=4')                                        
//BP13L203 DD  DSN=BP13.L241.RPT,                                               
//             DISP=SHR                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//SYSTSPRT DD  SYSOUT=*                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSTSIN  DD  *                                                                
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C203) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
/*                                                                              
//*--------------------------------------------------------------------         
//*   SEND REPORT OUT FROM STEP02 IN XDA2 PRINTER                               
//*--------------------------------------------------------------------         
//STEP2A EXEC    PGM=IEBGENER                                                   
//SYSUT1   DD  DSN=BP13.L241.RPT,                                               
//             DISP=SHR                                                         
//SYSUT2   DD SYSOUT=A,DEST=XDA2                                                
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//*-------------------------------------------------------------------*         
//* SEND MESSAGE TO OPERATOR TO OPEN FILES                            *         
//*-------------------------------------------------------------------*         
//STEP03   EXEC WTOG,COND=(0,NE)                                                
   ----> ############################################                           
   ---->    AFTER SUCCESSFUL COMPLETION OF BP13A241                             
   ---->    PLEASE OPEN BP13K207.                                               
   ----> ############################################                           
