//BP13A596 JOB (BP13P),'BP13A596',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),    00010000
//         NOTIFY=CSD0071                                               00020000
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                           00030000
//******************************************************************    00040000
//* OBJECTIVES - GENERATE GRO, MGP AND FTS EMAILS FOR BTO EXERICSE      00050000
//*                                                                     00060000
//*=================================================================    00070000
//* BP135622 20150108 CT2 MODELLED JOB FROM BP13A506. JUST TAKE EMAIL   00080000
//*                       PORTION.                                      00090000
//******************************************************************    00100000
//* SORT BY QUEUE NO (OMIT GRO CASES AND PORT TAG CASES)                00110000
//* GRO AND PORT TAG CASES TO BE SENT BY USER ON THEIR OWN              00120000
//*-----------------------------------------------------------------    00130000
//STEP01  EXEC SORT,COND=(0,NE)                                         00140000
//SORTIN  DD DSN=BP13.K740.MATUREBA,DISP=SHR                            00150000
//SORTOUT DD DSN=&&P13F740,DISP=(NEW,PASS),                             00160000
//           UNIT=SYSDA,DCB=(RECFM=FB,LRECL=500),                       00170000
//           SPACE=(CYL,(35,5),RLSE)                                    00180000
//SYSIN   DD *                                                          00190000
    SORT FIELDS=(187,3,A,211,2,A,235,5,A,123,8,A),FORMAT=CH             00200000
//*-----------------------------------------------------------------*   00210000
//*  TO BYPASS RECORD THAT FOUND ON BP13K76D                        *   00220000
//*  REC NOT FOUND WILL BE PROCESSED ON BP13C089                    *   00230000
//*-----------------------------------------------------------------*   00240000
//STEP02   EXEC PGM=BP13CF18,COND=(0,NE)                                00250000
//BP13F740 DD DSN=&&P13F740,DISP=(OLD,DELETE)                           00260000
//BP13K76D DD DSN=BP13.K76D.BALLOT.BLOCKLST,DISP=SHR                    00270000
//P13F740A DD DSN=&&BP13F740,DISP=(NEW,PASS),                           00280000
//             UNIT=SYSDA,SPACE=(CYL,(05,05),RLSE),                     00290000
//             DCB=(BLKSIZE=27500,LRECL=500,RECFM=FB)                   00300000
//SYSOUT   DD SYSOUT=*                                                  00310000
//*                                                                     00320000
//*-----------------------------------------------------------------*   00330000
//*  TO SEPERATE CASES WITH EMAIL ADDRESS                           *   00340000
//*-----------------------------------------------------------------*   00350000
//STEP03   EXEC PGM=BP13CF10,COND=(0,NE)                                00360000
//BP13F740 DD DSN=&&BP13F740,DISP=(OLD,DELETE)                          00370000
//BP13K857 DD DSN=BP13.K857.EMAIL,DISP=SHR                              00380000
//BP13K825 DD DSN=BP13.K825.REQOCCP.PREV,DISP=SHR                       00390000
//BP13K830 DD DSN=BP13.K830.ADDR,DISP=SHR                               00400000
//BP13K831 DD DSN=BP13.K830.ADDR.PATH1,DISP=SHR                         00410000
//P13F740A DD DSN=&&F740WO,DISP=(NEW,PASS),                             00420000
//             UNIT=SYSDA,SPACE=(CYL,(05,05),RLSE),                     00430000
//             DCB=(BLKSIZE=27500,LRECL=500,RECFM=FB)                   00440000
//P13F740B DD DSN=&&F740WITH,DISP=(NEW,PASS),                           00450000
//             UNIT=SYSDA,SPACE=(CYL,(05,05),RLSE),                     00460000
//             DCB=(BLKSIZE=27500,LRECL=500,RECFM=FB)                   00470000
//P13LCF10 DD SYSOUT=*                                                  00480000
//SYSOUT   DD SYSOUT=*                                                  00490000
//*                                                                     00500000
//*=================================================================    00510000
//* INCLUDE FLAT TYPE = SA                                              00520000
//*---------------------------------------------------------------------00530000
//STEP20   EXEC SORT,COND=(0,NE)                                        00540000
//SORTIN   DD  DSN=&&F740WITH,DISP=(OLD,PASS)                           00550000
//SORTOUT  DD  DSN=&&F740SA,DISP=(NEW,PASS),                            00560000
//             UNIT=SYSDA,SPACE=(CYL,(05,05),RLSE),                     00570000
//             DCB=(BLKSIZE=27500,LRECL=500,RECFM=FB)                   00580000
//SYSIN    DD  *                                                        00590000
  SORT FIELDS=(1,28,A),FORMAT=CH                                        00600000
  INCLUDE COND=(211,2,CH,EQ,C'1A',AND,                                  00610000
                 28,1,CH,NE,C'G',AND,                                   00620000
                373,1,CH,NE,C' ')                                       00630000
//*--------------------------------------------------------------------*00640000
//* PRINT BTO SHORTLISTED CASES WITH EMAIL ADDRESS (SA)                *00650000
//*--------------------------------------------------------------------*00660000
//STEP21   EXEC PGM=BP13CD36,COND=(0,NE)                                00670000
//BP13F740 DD DSN=&&F740SA,DISP=(OLD,DELETE)                            00680000
//BP13K857 DD DSN=BP13.K857.EMAIL,DISP=SHR                              00690000
//BP13K813 DD DSN=BP13.K813.BTOBE,DISP=SHR                              00700000
//BP13K740 DD DSN=BP13.K740.MATUREBA,DISP=SHR                           00710000
//P13LD36A DD SYSOUT=*                                                  00720000
//P13LD36B DD SYSOUT=*                                                  00730000
//P13LD36C DD SYSOUT=*                                                  00740000
//P13LD36D DD SYSOUT=*                                                  00750000
//P13LD36E DD SYSOUT=*                                                  00760000
//P13F203A DD DSN=BP13.F23A.EMAIL.F110,DISP=SHR                         00770000
//P13F203B DD DSN=BP13.F23A.EMAIL.F120,DISP=SHR                         00780000
//P13F203C DD DSN=BP13.F23A.EMAIL.F130,DISP=SHR                         00790000
//P13F203D DD DSN=BP13.F23A.EMAIL.F140,DISP=SHR                         00800000
//P13F203E DD DSN=BP13.F23A.EMAIL.F145,DISP=SHR                         00810000
//SYSOUT   DD SYSOUT=*                                                  00820000
//SYSTSPRT DD SYSOUT=*                                                  00830000
//SYSPRINT DD SYSOUT=*                                                  00840000
//SYSDBG   DD SYSOUT=*                                                  00850000
//SYSDBOUT DD SYSOUT=*                                                  00860000
//SYSTSIN  DD *                                                         00870000
//*                                                                     00880000
//*---------------------------------------------------------------------00890000
//* INCLUDE FLAT TYPE NOT = SA                                          00900000
//*---------------------------------------------------------------------00910000
//STEP22   EXEC SORT,COND=(0,NE)                                        00920000
//SORTIN   DD  DSN=&&F740WITH,DISP=(OLD,PASS)                           00930000
//SORTOUT  DD  DSN=&&F740NOSA,DISP=(NEW,PASS),                          00940000
//             UNIT=SYSDA,SPACE=(CYL,(05,05),RLSE),                     00950000
//             DCB=(BLKSIZE=27500,LRECL=500,RECFM=FB)                   00960000
//SYSIN    DD  *                                                        00970000
  SORT FIELDS=(1,28,A),FORMAT=CH                                        00980000
  INCLUDE COND=(211,2,CH,NE,C'1A',AND,                                  00990000
                 28,1,CH,NE,C'G',AND,                                   01000000
                373,1,CH,NE,C' ')                                       01010000
//*--------------------------------------------------------------------*01020000
//* PRINT BTO SHORTLISTED CASES WITH EMAIL ADDRESS (NOT SA)            *01030000
//*--------------------------------------------------------------------*01040000
//STEP23   EXEC PGM=BP13CD36,COND=(0,NE)                                01050000
//BP13F740 DD DSN=&&F740NOSA,DISP=(OLD,DELETE)                          01060000
//BP13K857 DD DSN=BP13.K857.EMAIL,DISP=SHR                              01070000
//BP13K813 DD DSN=BP13.K813.BTOBE,DISP=SHR                              01080000
//BP13K740 DD DSN=BP13.K740.MATUREBA,DISP=SHR                           01090000
//P13LD36A DD SYSOUT=*                                                  01100000
//P13LD36B DD SYSOUT=*                                                  01110000
//P13LD36C DD SYSOUT=*                                                  01120000
//P13LD36D DD SYSOUT=*                                                  01130000
//P13LD36E DD SYSOUT=*                                                  01140000
//P13F203A DD DSN=BP13.F23A.EMAIL.F150,DISP=SHR                         01150000
//P13F203B DD DSN=BP13.F23A.EMAIL.F160,DISP=SHR                         01160000
//P13F203C DD DSN=BP13.F23A.EMAIL.F170,DISP=SHR                         01170000
//P13F203D DD DSN=BP13.F23A.EMAIL.F180,DISP=SHR                         01180000
//P13F203E DD DSN=BP13.F23A.EMAIL.F190,DISP=SHR                         01190000
//SYSOUT   DD SYSOUT=*                                                  01200000
//SYSTSPRT DD SYSOUT=*                                                  01210000
//SYSPRINT DD SYSOUT=*                                                  01220000
//SYSDBG   DD SYSOUT=*                                                  01230000
//SYSDBOUT DD SYSOUT=*                                                  01240000
//SYSTSIN  DD *                                                         01250000
//*                                                                     01260000
//*-----------------------------------------------------------------    01270000
//* SORT BY NT FT QUEUE (MGP LETTERS)                                   01280000
//*-----------------------------------------------------------------    01290000
//STEP24  EXEC SORT,COND=(0,NE)                                         01300000
//SORTIN  DD DSN=&&F740WITH,DISP=(OLD,PASS)                             01310000
//SORTOUT DD DSN=&&F74AWIEM,DISP=(NEW,PASS),                            01320000
//           UNIT=SYSDA,DCB=(RECFM=FB,LRECL=500),                       01330000
//           SPACE=(CYL,(35,5),RLSE)                                    01340000
//SYSIN   DD *                                                          01350000
    SORT FIELDS=(187,3,A,211,2,A,235,5,A,123,8,A),FORMAT=CH             01360000
    INCLUDE COND=(28,1,CH,NE,C'M',AND,245,1,CH,NE,C' ')                 01370000
//*-----------------------------------------------------------------    01380000
//* INCLUDE FLAT TYPE = SA                                              01390000
//*---------------------------------------------------------------------01400000
//STEP25   EXEC SORT,COND=(0,NE)                                        01410000
//SORTIN   DD  DSN=&&F74AWIEM,DISP=(OLD,PASS)                           01420000
//SORTOUT  DD  DSN=&F74ASA,DISP=(NEW,PASS),                             01430000
//             UNIT=SYSDA,SPACE=(CYL,(05,05),RLSE),                     01440000
//             DCB=(BLKSIZE=27500,LRECL=500,RECFM=FB)                   01450000
//SYSIN    DD  *                                                        01460000
  SORT FIELDS=(1,28,A),FORMAT=CH                                        01470000
  INCLUDE COND=(211,2,CH,EQ,C'1A')                                      01480000
//*--------------------------------------------------------------------*01490000
//* PRINT BTO SHORTLISTED CASES WITH EMAIL ADDRESS (SA)                *01500000
//*--------------------------------------------------------------------*01510000
//STEP26   EXEC PGM=BP13CD39,COND=(0,NE)                                01520000
//BP13F740 DD DSN=&F74ASA,DISP=(OLD,DELETE)                             01530000
//BP13K857 DD DSN=BP13.K857.EMAIL,DISP=SHR                              01540000
//BP13K813 DD DSN=BP13.K813.BTOBE,DISP=SHR                              01550000
//BP13K740 DD DSN=BP13.K740.MATUREBA,DISP=SHR                           01560000
//BP13K741 DD DSN=BP13.K740.MATUREBA.PATH1,DISP=SHR                     01570000
//P13LD39A DD SYSOUT=*                                                  01580000
//P13LD39B DD SYSOUT=*                                                  01590000
//P13LD39C DD SYSOUT=*                                                  01600000
//P13LD39D DD SYSOUT=*                                                  01610000
//P13LD39E DD SYSOUT=*                                                  01620000
//P13F203A DD DSN=BP13.F23A.EMAIL.F210,DISP=SHR                         01630000
//P13F203B DD DSN=BP13.F23A.EMAIL.F220,DISP=SHR                         01640000
//P13F203C DD DSN=BP13.F23A.EMAIL.F230,DISP=SHR                         01650000
//P13F203D DD DSN=BP13.F23A.EMAIL.F240,DISP=SHR                         01660000
//P13F203E DD DSN=BP13.F23A.EMAIL.F245,DISP=SHR                         01670000
//SYSOUT   DD SYSOUT=*                                                  01680000
//SYSTSPRT DD SYSOUT=*                                                  01690000
//SYSPRINT DD SYSOUT=*                                                  01700000
//SYSDBG   DD SYSOUT=*                                                  01710000
//SYSDBOUT DD SYSOUT=*                                                  01720000
//SYSTSIN  DD *                                                         01730000
//*                                                                     01740000
//*---------------------------------------------------------------------01750000
//* INCLUDE FLAT TYPE NOT = SA                                          01760000
//*---------------------------------------------------------------------01770000
//STEP27   EXEC SORT,COND=(0,NE)                                        01780000
//SORTIN   DD  DSN=&&F74AWIEM,DISP=(OLD,DELETE)                         01790000
//SORTOUT  DD  DSN=&F74ANOSA,DISP=(NEW,PASS),                           01800000
//             UNIT=SYSDA,SPACE=(CYL,(05,05),RLSE),                     01810000
//             DCB=(BLKSIZE=27500,LRECL=500,RECFM=FB)                   01820000
//SYSIN    DD  *                                                        01830000
  SORT FIELDS=(1,28,A),FORMAT=CH                                        01840000
  INCLUDE COND=(211,2,CH,NE,C'1A')                                      01850000
//*--------------------------------------------------------------------*01860000
//* PRINT BTO SHORTLISTED CASES WITH EMAIL ADDRESS (NOT SA)            *01870000
//*--------------------------------------------------------------------*01880000
//STEP28   EXEC PGM=BP13CD39,COND=(0,NE)                                01890000
//BP13F740 DD DSN=&F74ANOSA,DISP=(OLD,DELETE)                           01900000
//BP13K857 DD DSN=BP13.K857.EMAIL,DISP=SHR                              01910000
//BP13K813 DD DSN=BP13.K813.BTOBE,DISP=SHR                              01920000
//BP13K740 DD DSN=BP13.K740.MATUREBA,DISP=SHR                           01930000
//BP13K741 DD DSN=BP13.K740.MATUREBA.PATH1,DISP=SHR                     01940000
//P13LD39A DD SYSOUT=*                                                  01950000
//P13LD39B DD SYSOUT=*                                                  01960000
//P13LD39C DD SYSOUT=*                                                  01970000
//P13LD39D DD SYSOUT=*                                                  01980000
//P13LD39E DD SYSOUT=*                                                  01990000
//P13F203A DD DSN=BP13.F23A.EMAIL.F250,DISP=SHR                         02000000
//P13F203B DD DSN=BP13.F23A.EMAIL.F260,DISP=SHR                         02010000
//P13F203C DD DSN=BP13.F23A.EMAIL.F270,DISP=SHR                         02020000
//P13F203D DD DSN=BP13.F23A.EMAIL.F280,DISP=SHR                         02030000
//P13F203E DD DSN=BP13.F23A.EMAIL.F290,DISP=SHR                         02040000
//SYSOUT   DD SYSOUT=*                                                  02050000
//SYSTSPRT DD SYSOUT=*                                                  02060000
//SYSPRINT DD SYSOUT=*                                                  02070000
//SYSDBG   DD SYSOUT=*                                                  02080000
//SYSDBOUT DD SYSOUT=*                                                  02090000
//SYSTSIN  DD *                                                         02100000
//*                                                                     02110000
//*---------------------------------------------------------------------02120000
//* INCLUDE SINGLES SCHEME (ALLOC SCHEME = 'FTS')                       02130000
//*---------------------------------------------------------------------02140000
//STEP29   EXEC SORT,COND=(0,NE)                                        02150000
//SORTIN   DD  DSN=&&F740WITH,DISP=(OLD,PASS)                           02160000
//SORTOUT  DD  DSN=&&F740SING,DISP=(NEW,PASS),                          02170000
//             UNIT=SYSDA,SPACE=(CYL,(05,05),RLSE),                     02180000
//             DCB=(BLKSIZE=27500,LRECL=500,RECFM=FB)                   02190000
//SYSIN    DD  *                                                        02200000
  SORT FIELDS=(1,28,A),FORMAT=CH                                        02210000
  INCLUDE COND=(213,3,CH,EQ,C'FTS')                                     02220000
//*--------------------------------------------------------------------*02230000
//* PRINT BTO SHORTLISTED CASES WITH EMAIL ADDRESS (SINGLES)           *02240000
//*--------------------------------------------------------------------*02250000
//STEP28   EXEC PGM=BP13CD96,COND=(0,NE)                                02260000
//BP13F740 DD DSN=&&F740SING,DISP=(OLD,DELETE)                          02270000
//BP13K857 DD DSN=BP13.K857.EMAIL,DISP=SHR                              02280000
//BP13K813 DD DSN=BP13.K813.BTOBE,DISP=SHR                              02290000
//BP13K740 DD DSN=BP13.K740.MATUREBA,DISP=SHR                           02300000
//BP13K741 DD DSN=BP13.K740.MATUREBA.PATH1,DISP=SHR                     02310000
//P13LD96A DD SYSOUT=*                                                  02320000
//P13LD96B DD SYSOUT=*                                                  02330000
//P13LD96C DD SYSOUT=*                                                  02340000
//P13LD96D DD SYSOUT=*                                                  02350000
//P13LD96E DD SYSOUT=*                                                  02360000
//P13F203A DD DSN=BP13.F23A.EMAIL.F310,DISP=SHR                         02370000
//P13F203B DD DSN=BP13.F23A.EMAIL.F320,DISP=SHR                         02380000
//P13F203C DD DSN=BP13.F23A.EMAIL.F330,DISP=SHR                         02390000
//P13F203D DD DSN=BP13.F23A.EMAIL.F340,DISP=SHR                         02400000
//P13F203E DD DSN=BP13.F23A.EMAIL.F350,DISP=SHR                         02410000
//SYSOUT   DD SYSOUT=*                                                  02420000
//SYSTSPRT DD SYSOUT=*                                                  02430000
//SYSPRINT DD SYSOUT=*                                                  02440000
//SYSDBG   DD SYSOUT=*                                                  02450000
//SYSDBOUT DD SYSOUT=*                                                  02460000
//SYSTSIN  DD *                                                         02470000
//*                                                                     02480000
