//BP13M727  JOB (BP13P),'BP13M727',MSGCLASS=N,CLASS=I,                          
//       MSGLEVEL=(1,1),NOTIFY=CSD0071                                          
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,DISP=SHR                                  
//*====================================================================         
//* MONTHLY JOB RUN ON 12TH OF THE MONTH                                        
//* PRINT REPORT TO MONITOR INSTALMENT PAYMENT AFTER CPF POSTING                
//*====================================================================         
//* CHG-NO    BY   ON    - DESC                                                 
//*--------------------------------                                             
//* BP1323209 LSB 100308 - ADD GIRO LETTER                                      
//* BP135171  RJE 110214 - TO CATER FOR DB2 UPGRADE                             
//*====================================================================         
//* TO SEND DYNAMIC JDE AHEAD OF THE PRINT DATASETS                             
//* PRT01 : 1 COPY                           (MA&B TEAM)                        
//*-----------------------------------------------------------------            
//PRT01    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAAARS1A CP-1',END;                                    
1$DJDE$ JDE=BP13D,JDL=BP13,END;                                                 
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAAARS1A                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID),DEST=IOM2                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*                                                                             
//*-----------------------------------------------------------------            
//* GIRO LETTER  (MA&B)                                                         
//*-----------------------------------------------------------------            
//PRT02    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAAARS1B CP-1',END;                                    
1$DJDE$ JDE=13POT2,JDL=BP13,FORMS=BP1321,END;                                   
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAAARS1B                                   
//SYSUT2   DD SYSOUT=W,OUTPUT=(*.FORMID),DEST=IOMW                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*                                                                             
//*-------------------------------------------------------------------*         
//* SORT BP13F125 BY REGN NO, TRANS TYPE AND NRIC                     *         
//*-------------------------------------------------------------------*         
//STEP01   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F136.MTHTRAN.DBSS,DISP=SHR                               
//SORTOUT  DD DSN=&&BP13F125,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,                                                       
//            SPACE=(CYL,(50,10),RLSE),                                         
//            DCB=(RECFM=FB,LRECL=150,BLKSIZE=0)                                
//SYSIN    DD *                                                                 
      SORT FIELDS=(5,8,CH,A,1,2,CH,D,25,1,CH,D,26,8,CH,A),FORMAT=CH             
      OMIT COND=(5,1,CH,EQ,C' ')                                                
//*-------------------------------------------------------------------*         
//* SORT BP13F125 BY REGN NO AND NRIC                                 *         
//*-------------------------------------------------------------------*         
//STEP02   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&BP13F125,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&P13F125A,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,                                                       
//            SPACE=(CYL,(50,10),RLSE),                                         
//            DCB=(RECFM=FB,LRECL=150,BLKSIZE=0)                                
//SYSIN    DD *                                                                 
      SORT FIELDS=(5,8,CH,A),FORMAT=CH                                          
      INCLUDE COND=((99,3,CH,EQ,C'INS'),AND,                                    
                    (1,2,CH,EQ,C'11',OR,                                        
                     1,2,CH,EQ,C'12',OR,                                        
                     1,2,CH,EQ,C'64'))                                          
//*-------------------------------------------------------------------*         
//* SORT BP13F125 BY REGN NO, DTE POST AND NRIC(1:1)                  *         
//*-------------------------------------------------------------------*         
//STEP03   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&P13F125A,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&P13F125B,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,                                                       
//            SPACE=(CYL,(50,10),RLSE),                                         
//            DCB=(RECFM=FB,LRECL=150,BLKSIZE=0)                                
//SYSIN    DD *                                                                 
      SORT FIELDS=(5,8,CH,A,13,8,CH,A,25,1,CH,D),FORMAT=CH                      
//*-------------------------------------------------------------------*         
//*  OUTPUT SEVERAL RECORDS WITH SAME REGN NO AND TRANS TYPE TO       *         
//*  ONE RECORD WITH TOTAL AMT                                        *         
//*-------------------------------------------------------------------*         
//STEP04   EXEC PGM=BP13CC86,COND=(0,NE)                                        
//BP13F125 DD DSN=&&P13F125B,DISP=(OLD,PASS)                                    
//P13F125A DD DSN=&&P13F125C,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,                                                       
//            SPACE=(CYL,(50,10),RLSE),                                         
//            DCB=(RECFM=FB,LRECL=150,BLKSIZE=0)                                
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*-------------------------------------------------------------------*         
//* SORT BP13KD00 BY REGN NO (COL 383 = AMT-INSTAL)                   *         
//*-------------------------------------------------------------------*         
//STEP05   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.KD00.DBSMAST,DISP=SHR                                    
//SORTOUT  DD DSN=&&BP13FD00,DISP=(NEW,PASS),                                   
//           UNIT=SYSDA,                                                        
//           SPACE=(CYL,(50,10),RLSE),                                          
//           DCB=(RECFM=FB,LRECL=1600,BLKSIZE=0)                                
//SYSIN    DD *                                                                 
      SORT FIELDS=(1,8,CH,A),FORMAT=CH                                          
      OMIT COND=(1,8,CH,EQ,C'        ',OR,383,6,CH,EQ,C'000000')                
//*-------------------------------------------------------------------*         
//*  DISPLAY RECORDS AND OUTPUT TO 3 FILES FOR FD00 AND F125          *         
//*-------------------------------------------------------------------*         
//STEP06   EXEC PGM=BP13CC78,COND=(0,NE)                                        
//BP13F125 DD DSN=&&P13F125C,DISP=(OLD,PASS)                                    
//BP13FD00 DD DSN=&&BP13FD00,DISP=(OLD,PASS)                                    
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR                                      
//P13F125A DD DUMMY                                                             
//P13F125B DD DUMMY                                                             
//P13FD00A DD DUMMY                                                             
//P13FD00B DD DUMMY                                                             
//P13LC78A DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//P13LC78B DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//P13LC78C DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*--------------------------------------------------------------------         
//* SORT OUT AMT-ARR-INSTAL > ZEROS                                             
//*--------------------------------------------------------------------         
//STEP07 EXEC SORT,COND=(0,NE)                                                  
//SORTIN    DD DSN=BP13.KD00.DBSMAST,DISP=SHR,                                  
//          AMP=('BUFND=4','BUFNI=8')                                           
//SORTOUT   DD DSN=&&BP13FD00,DISP=(,PASS),                                     
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=1600),                                        
//            SPACE=(CYL,(50,20),RLSE)                                          
//SYSPRINT  DD SYSOUT=*                                                         
//SYSIN     DD *                                                                
  SORT FIELDS=(1,8,A),FORMAT=CH                                                 
  INCLUDE COND=(573,8,CH,GT,C'00000000')                                        
/*                                                                              
//*-----------------------------------------------------------------            
//* PRINT LETTER TO INFORM BUYERS WHO HAVE NOT JOINED GIRO                      
//*-----------------------------------------------------------------            
//STEP08   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K               
//BP13FD00 DD  DSN=&&BP13FD00,DISP=(OLD,PASS)                                   
//SY02F001 DD  DSN=SY02.F001.DATE,DISP=SHR                                      
//BP13KD00 DD  DSN=BP13.KD00.DBSMAST,DISP=SHR,                                  
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K800 DD  DSN=BP13.K800.APPLN,DISP=SHR,                                    
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K820 DD  DSN=BP13.K820.OCCUP,DISP=SHR,                                    
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K830 DD  DSN=BP13.K830.ADDR,DISP=SHR,                                     
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K831 DD  DSN=BP13.K830.ADDR.PATH1,DISP=SHR,                               
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13LC93 DD  SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                       
//BP13PC93 DD  SYSOUT=W,OUTPUT=(*.PRT02.FORMID),DEST=IOMW                       
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
     DSN SYSTEM(DSN)                                                            
     RUN PROGRAM(BP13CC93) PLAN(BP13PCC) -                                      
         LIB('BP13.BATCH.LOADCOB')                                              
     END                                                                        
