//BP13D702  JOB (BP13P),'BP13D702',CLASS=I,MSGCLASS=N,                          
//        MSGLEVEL=(1,1),NOTIFY=CSD0071                                         
//JOBLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                    
//*=================================================================*           
//* CHG-NO   BY   ON       DESCRIPTION                                          
//* ---------------------------------------------------------------             
//* BP136390 KSJ3 20161101 ADD VERIFY STEP                                      
//*=================================================================            
//*  SEND DYNAMIC JDE AHEAD OF THE PRINT DATASET                                
//*  PRT01 : CLASS = 2                                                          
//*-----------------------------------------------------------------            
//PRT01    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAALSS1A CP-1',END;                                    
1$DJDE$ JDE=13C382,JDL=BP13,END;                                                
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALSS1A                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID),DEST=IOM2                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*                                                                             
//*-----------------------------------------------------------------            
//*  TO SEND DYNAMIC JDE AHEAD OF THE PRINT DATASET                             
//*  PRT02 : CLASS = 2                                                          
//*-----------------------------------------------------------------            
//PRT02    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAALSS1B CP-1',END;                                    
1$DJDE$ JDE=BP13D,JDL=BP13,END;                                                 
//FORMID   OUTPUT FORMS=1WD2,GROUPID=EAALSS1B                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID),DEST=IOM2                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*===================================================================          
//* VERIFY FILES BEFORE DAILY PRODUCTION RUN                                    
//*-----------------------------------------------------------------            
//STEP00   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//INPUT1   DD DSN=BP13.K820.OCCUP,DISP=OLD                                      
//INPUT2   DD DSN=BP13.K830.ADDR,DISP=OLD                                       
//INPUT3   DD DSN=BP13.K857.EMAIL,DISP=OLD                                      
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN   DD *                                                                  
          VFY FILE(INPUT1)                                                      
          VFY FILE(INPUT2)                                                      
          VFY FILE(INPUT3)                                                      
//*                                                                             
//*-----------------------------------------------------------------            
//* SORT CASES BY REGN                                                          
//*-----------------------------------------------------------------            
//STEP01   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K833.CHGADDR,DISP=SHR                                    
//SORTOUT  DD DSN=&&BP13F833,DISP=(NEW,PASS),                                   
//            UNIT=(SYSDA,1),SPACE=(CYL,(3,1),RLSE),                            
//            DCB=(BLKSIZE=27600,LRECL=400,RECFM=FB)                            
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,8,A),FORMAT=CH                                                
//*-----------------------------------------------------------------            
//* CHECKLIST AND REPORT FOR REQUEST RECEIVED VIA BP13ADDR                      
//*-----------------------------------------------------------------            
//STEP02  EXEC PGM=BP13C382,COND=(0,NE)                                         
//BP13F833 DD DSN=&&BP13F833,DISP=(OLD,PASS)                                    
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR,                                     
//            AMP=('BUFNI=8')                                                   
//BP13K830 DD DSN=BP13.K830.ADDR,DISP=SHR,                                      
//            AMP=('BUFNI=8')                                                   
//BP13K831 DD DSN=BP13.K830.ADDR.PATH1,DISP=SHR,                                
//            AMP=('BUFNI=8')                                                   
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFNI=8')                                                   
//BP13K857 DD DSN=BP13.K857.EMAIL,DISP=SHR,                                     
//            AMP=('BUFNI=8')                                                   
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//BP13F839 DD DSN=BP13.F839.CHGADDR.HLA,DISP=MOD                                
//P13L382A DD DUMMY                                                             
//P13L382B DD SYSOUT=2,OUTPUT=(*.PRT02.FORMID),DEST=IOM2                        
//P13L382C DD SYSOUT=2,OUTPUT=(*.PRT02.FORMID),DEST=IOM2                        
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
