//BP13A59P JOB (BP13P),'BP13A59P',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),    JOB02565
//       NOTIFY=CSD0071                                                         
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//*-------------------------------------------------------------------*         
//* TO INITIALIZE THE FILES                                                     
//*-------------------------------------------------------------------*         
//STEP00    EXEC PGM=IDCAMS,COND=(0,NE)                                 00002800
//SYSPRINT  DD SYSOUT=*                                                 00003600
//INPUT1    DD DSN=NULLFILE,DISP=SHR                                    00003702
//OUTPUT1   DD DSN=BP13.F23A.EMAIL.SL.F100,DISP=OLD                             
//OUTPUT2   DD DSN=BP13.F23A.EMAIL.SL.F200,DISP=OLD                             
//OUTPUT3   DD DSN=BP13.F23A.EMAIL.SL.F300,DISP=OLD                             
//OUTPUT4   DD DSN=BP13.F23A.EMAIL.SL.F400,DISP=OLD                             
//OUTPUT5   DD DSN=BP13.F23A.EMAIL.SL.F500,DISP=OLD                             
//OUTPUT6   DD DSN=BP13.F23A.EMAIL.SL.F600,DISP=OLD                             
//OUTPUT7   DD DSN=BP13.F23A.EMAIL.SL.F700,DISP=OLD                             
//OUTPUT8   DD DSN=BP13.F23A.EMAIL.SL.F800,DISP=OLD                             
//SYSIN     DD *                                                        00012300
   REPRO INFILE(INPUT1) OUTFILE(OUTPUT1)                                00012300
   REPRO INFILE(INPUT1) OUTFILE(OUTPUT2)                                00012300
   REPRO INFILE(INPUT1) OUTFILE(OUTPUT3)                                00012300
   REPRO INFILE(INPUT1) OUTFILE(OUTPUT4)                                00012300
   REPRO INFILE(INPUT1) OUTFILE(OUTPUT5)                                00012300
   REPRO INFILE(INPUT1) OUTFILE(OUTPUT6)                                00012300
   REPRO INFILE(INPUT1) OUTFILE(OUTPUT7)                                00012300
   REPRO INFILE(INPUT1) OUTFILE(OUTPUT8)                                00012300
//*-------------------------------------------------------------------          
//* STEP12:  GET FIRST 2000 RECS FOR EMAIL                             *        
//*--------------------------------------------------------------------*        
//STEP12   EXEC PGM=IDCAMS                                                      
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F23A.EMAIL.SL,DISP=SHR                                   
//OUTPUT1  DD DSN=BP13.F23A.EMAIL.SL.F100,DISP=SHR                              
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1) COUNT(2000)                         
//*--------------------------------------------------------------------*        
//* STEP13:  GET NEXT 2000 RECS FOR EMAIL                              *        
//*--------------------------------------------------------------------*        
//IFTEST1 IF (STEP12.RC = 0) THEN                                               
//STEP13   EXEC PGM=IDCAMS                                                      
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F23A.EMAIL.SL,DISP=SHR                                   
//OUTPUT1  DD DSN=BP13.F23A.EMAIL.SL.F200,DISP=OLD                              
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1) COUNT(2000) SKIP(2000)              
//ENDTEST1  ENDIF                                                               
//*--------------------------------------------------------------------*        
//* STEP14:  GET NEXT 2000 RECS FOR EMAIL                              *        
//*--------------------------------------------------------------------*        
//IFTEST1 IF (STEP13.RC = 0) THEN                                               
//STEP14   EXEC PGM=IDCAMS                                                      
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F23A.EMAIL.SL,DISP=SHR                                   
//OUTPUT1  DD DSN=BP13.F23A.EMAIL.SL.F300,DISP=OLD                              
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1) COUNT(2000) SKIP(4000)              
//ENDTEST1  ENDIF                                                               
//*--------------------------------------------------------------------*        
//STEP18   EXEC PGM=IDCAMS                                                      
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F23A.EMAIL.SL,DISP=SHR                                   
//OUTPUT1  DD DSN=BP13.F23A.EMAIL.SL.F400,DISP=SHR                              
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1) COUNT(2000) SKIP(6000)              
//*--------------------------------------------------------------------*        
//* STEP13:  GET NEXT 2000 RECS FOR EMAIL                              *        
//*--------------------------------------------------------------------*        
//IFTEST7 IF (STEP18.RC = 0) THEN                                               
//STEP19   EXEC PGM=IDCAMS                                                      
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F23A.EMAIL.SL,DISP=SHR                                   
//OUTPUT1  DD DSN=BP13.F23A.EMAIL.SL.F500,DISP=OLD                              
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1) COUNT(2000) SKIP(8000)              
//ENDTEST7  ENDIF                                                               
//*--------------------------------------------------------------------*        
//* STEP13:  GET NEXT 2000 RECS FOR EMAIL                              *        
//*--------------------------------------------------------------------*        
//IFTEST8 IF (STEP19.RC = 0) THEN                                               
//STEP20   EXEC PGM=IDCAMS                                                      
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F23A.EMAIL.SL,DISP=SHR                                   
//OUTPUT1  DD DSN=BP13.F23A.EMAIL.SL.F600,DISP=OLD                              
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1) COUNT(2000) SKIP(10000)             
//ENDTEST8  ENDIF                                                               
//*--------------------------------------------------------------------*        
//* STEP13:  GET NEXT 2000 RECS FOR EMAIL                              *        
//*--------------------------------------------------------------------*        
//IFTEST9 IF (STEP20.RC = 0) THEN                                               
//STEP21   EXEC PGM=IDCAMS                                                      
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F23A.EMAIL.SL,DISP=SHR                                   
//OUTPUT1  DD DSN=BP13.F23A.EMAIL.SL.F700,DISP=OLD                              
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1) COUNT(2000) SKIP(12000)             
//ENDTEST9  ENDIF                                                               
//*--------------------------------------------------------------------*        
//* STEP13:  GET NEXT 2000 RECS FOR EMAIL                              *        
//*--------------------------------------------------------------------*        
//IFTEST1 IF (STEP21.RC = 0) THEN                                               
//STEP22   EXEC PGM=IDCAMS                                                      
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F23A.EMAIL.SL,DISP=SHR                                   
//OUTPUT1  DD DSN=BP13.F23A.EMAIL.SL.F800,DISP=OLD                              
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1) COUNT(2000) SKIP(14000)             
//ENDTEST1  ENDIF                                                               
