//BP13A640 JOB (BP13P),'BP13A640',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//         NOTIFY=CSD0071                                                       
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//**********************************************************************        
//* ADHOC JOB TO EXTRACT CASES WITHIN 200% IN BP13F800 FORMAT FOR HLE &         
//* FORM A FILE FOR CANCELLED CASES - BP13K313 ('05' + REGNO)                   
//**********************************************************************        
//* CHG REF  BY   ON       DESCRIPTION                                          
//* -------- ---- -------- --------------------------------------------         
//* BP135656 SMR2 04022015 NEW JCL                                              
//* BP135656 SMR2 06032015 ADD FILE IN BP13CF84 - BP13K76D                      
//* BP137548 AM25 07012019 CHANGE INPUT FILE TO USE IN BP13CF84                 
//* BP137701 LJL1 01032019 CHANGE COND CODE 4 FOR STEP08 TO CATER FOR           
//*                        EMPTY FILE                                           
//*---------------------------------------------------------------------        
//* VERIFY FILE/S BEFORE DAILY PRODUCTION RUN                                   
//*---------------------------------------------------------------------        
//STEP00   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//INPUT1   DD DSN=BP13.K313.TRANS.HLE,DISP=OLD                                  
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
          VFY FILE(INPUT1)                                                      
//*---------------------------------------------------------------------        
//* DELETE SEQUENTIAL FILE                                                      
//*---------------------------------------------------------------------        
//STEP01   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
     DEL (BP13.F800.HLE)                                                        
     IF MAXCC < 12 THEN                                                         
        SET MAXCC = 0                                                           
//*---------------------------------------------------------------------        
//* REMOVE DUPLICATES FROM LAST BALLOTED SALES                                  
//*---------------------------------------------------------------------        
//STEP02   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F800.APPLN.BALLOT.BKUP(0),DISP=SHR                       
//SORTOUT  DD DSN=&&BP13F800,DISP=(NEW,PASS),                                   
//            SPACE=(CYL,(40,10),RLSE),                                         
//            DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                               
//SYSIN    DD *                                                                 
   SORT FIELDS=(4,8,A),FORMAT=CH                                                
   SUM FIELDS=NONE                                                              
//*---------------------------------------------------------------------        
//* EXTRACT CASES FROM BP13.K740.BOOK                                           
//*---------------------------------------------------------------------        
//STEP03   EXEC SORT,COND=(0,NE)                                                
//SORTJNF1 DD DSN=&&BP13F800,DISP=(OLD,DELETE)                                  
//SORTJNF2 DD DSN=BP13.K740.BOOK,DISP=SHR                                       
//MATCH    DD DSN=&&F800F740,DISP=(NEW,PASS),                                   
//            SPACE=(CYL,(40,10),RLSE),                                         
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                            
//SYSIN    DD *                                                                 
   JOINKEYS FILE=F1,FIELDS=(4,8,A)                                              
   JOINKEYS FILE=F2,FIELDS=(123,8,A)                                            
   REFORMAT FIELDS=(F2:1,500)                                                   
   OUTFILE FNAMES=MATCH                                                         
   SORT FIELDS=(123,8,A),FORMAT=CH                                              
/*                                                                              
//SYSUDUMP DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* OMIT GRO-PA & MGPS CASES                                                    
//*---------------------------------------------------------------------        
//STEP04   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F800F740,DISP=(OLD,DELETE)                                  
//SORTOUT  DD DSN=&&BP13F740,DISP=(NEW,PASS),                                   
//            SPACE=(CYL,(40,10),RLSE),                                         
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                            
//SYSIN    DD *                                                                 
   SORT FIELDS=(123,8,A),FORMAT=CH                                              
   OMIT COND=(28,1,CH,EQ,C'G',OR,245,1,CH,NE,C' ')                              
   SUM FIELDS=NONE                                                              
//*---------------------------------------------------------------------        
//* EXTRACT CASES WITHIN 200% IN BP13F800 FORMAT FOR HLE                        
//*---------------------------------------------------------------------        
//STEP05   EXEC PGM=BP13CF84,COND=(0,NE)                                        
//BP13F740 DD DSN=&&BP13F740,DISP=(OLD,DELETE)                                  
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFND=13')                                                  
//BP13K813 DD DSN=BP13.K813.BTOBE,DISP=SHR                                      
//BP13K76D DD DSN=BP13.K76D.BALLOT.BLOCKLST,DISP=SHR                            
//BP13F800 DD DSN=BP13.F800.HLE,DISP=(NEW,CATLG),                               
//            DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0),                              
//            SPACE=(CYL,(40,20),RLSE)                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* FORM A FILE FOR CANCELLED CASES - BP13K313 ('05' + REGNO)                   
//*---------------------------------------------------------------------        
//STEP06   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F800.APPLN.BALLOT.BKUP(0),DISP=SHR                       
//SORTOUT  DD DSN=&&BP13F313,DISP=(NEW,PASS),                                   
//            DCB=(RECFM=FB,LRECL=100,BLKSIZE=0),                               
//            SPACE=(CYL,(10,5),RLSE)                                           
//SYSIN    DD *                                                                 
   SORT FIELDS=(4,8,A),FORMAT=CH                                                
   INCLUDE COND=(1,1,CH,EQ,C'C')                                                
   OUTREC FIELDS=(C'05',4,8,90X)                                                
//*---------------------------------------------------------------------        
//* CHECK FILE IF EMPTY                                                         
//*---------------------------------------------------------------------        
//STEP07   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INFILE   DD DSN=&&BP13F313,DISP=(OLD,PASS)                                    
//SYSIN    DD *                                                                 
       PRINT INFILE(INFILE) COUNT(1)                                            
       IF LASTCC EQ 4 THEN SET MAXCC=4                                          
//*---------------------------------------------------------------------        
//* REPRO TO BP13K313                                                           
//*---------------------------------------------------------------------        
//STEP08   EXEC PGM=IDCAMS,COND=(4,LT)                                          
//INPUT    DD DSN=&&BP13F313,DISP=(OLD,DELETE)                                  
//OUTPUT   DD DSN=BP13.K313.TRANS.HLE,DISP=OLD                                  
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
   REPRO INFILE(INPUT) OUTFILE(OUTPUT) REPLACE                                  
/*                                                                              
