//BP13D22D JOB (BP13P),'BP13D22D',MSGCLASS=N,CLASS=I,                           
//       MSGLEVEL=(1,1),NOTIFY=CSD0071                                          
/*JOBPARM SYSAFF=MVS2                                                           
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,DISP=SHR                                  
//*=================================================================            
//* COMPUTE OUTSIDE 300%, FINAL HARDLUCK FT BP13.F585.HARLUCK                   
//*=================================================================            
//* BP13AY0A WITH CUT-OFF POINT AT 200901                                       
//* FT HARDLUCK = BP13.F595.SOCNOTFD.AFQUE.AY0H, OUTPUT IN JOB BP13D22B         
//*             = JOB BP13D220, BP13D22A, BP13D22B, BP13D22C                    
//*             = BP13CY89 - COMPUTE HARDLUCK                                   
//* FT/2T HARDLUCK = BP13.F595.AY0J.RDBCHK, OUTPUT IN JOB BP13D22G              
//* 2T HARDLUCK = BP13.F595.AY0J.PURE2T, OUTPUT IN JOB BP13D221                 
//*=================================================================            
//* CHG-NO   BY    ON   - DESCRIPTION                                           
//*--------------------------------------                                       
//* BP133835 LSB 160410 - ADD SBF ALLOC-CAT                                     
//* BP133835 LSB 010710 - DELETE OMIT HH=G, BTO MATURE EST                      
//* BP133891 LSB 070810 - NEW REPORT BYPASS NE                                  
//* BP133921 LSB 240810 - BYPASS JUN BTO FOR AFTER SOC, AFTER QUEUE             
//* BP133840 LSB 010910 - BYPASS JUN BTO PG FOR AFTER QUEUE REPORT              
//* BP134205 LSB 110511 - ADD BP13K813 TO BP13CB91 BYPASS HARDLUCK              
//*                       BP13CY82 REPLACE CY64                                 
//* BP134247 LSB 110611 - CB78 ADD K893,CY82 CHK MATURE-TAG,ADD PPO/EC          
//* BP134247 LSB 110711 - DELETE CB90, ENHANCE CB71, CB91                       
//* BP134388 LSB 210212 - ADD OCCUPIER SPOUSE/FS IN CB80 GET FR K828            
//* BP134598 LSB 010812 - TAKE OUT SY02F001                                     
//* BP134780 IMC 270113 - REPLACE CB78 WITH CY49                                
//* BP135237 LSB 280214 - REFER TO BP13.K595.BP13D220 CUTOFF=201101             
//*                       INSTEAD OF BP13.K595.BALLOT.LOG                       
//* BP137734 LSB 100419 - DELETE BP13CB91                                       
//* BP137734 LSB 120419 - STILL RUN BP13CB91 TO COUNT-STATUS-S, BUT             
//*                       NO UPDATE TO BTO-CNT                                  
//* BP137958 LSB 310719 - DELETE BP13CB91                                       
//* BP139512 LSB 010323 - ADD MULTI VOL                                         
//*=================================================================            
//*-----------------------------------------------------------------            
//* SORT BP13.K205.CTLREC, INCLUDE OPTION = Y1                                  
//*-----------------------------------------------------------------            
//STEP01   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K20H.CTLREC,DISP=SHR                                     
//SORTOUT  DD DSN=&&BP13F205,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(1,1),RLSE),                                
//            DCB=(LRECL=80,RECFM=FB)                                           
//SYSIN    DD *                                                                 
  SORT FIELDS=(1,15,A),FORMAT=CH                                                
  INCLUDE COND=(14,2,CH,EQ,C'YH')                                               
//*-----------------------------------------------------------------            
//*------------------------------------------------------------------           
//* SORT BY BK CNT/BK TAG/BE CNT/BTO CNT                                        
//* INCLUDE BK_TAG = 'N' AFTER BP13K595 CHECK                                   
//* BYPASS SA FLAT                                                              
//*------------------------------------------------------------------           
//STEP02   EXEC SORT,COND=(0,NE)                                                
//SORTIN  DD DSN=BP13.F595.SMSNOTFD.AY0H,DISP=SHR                               
//SORTOUT DD DSN=BP13.F595.SOCNOTFD.AFQUE.AY0H,DISP=OLD,                        
//        UNIT=SYSDA,                                                           
//        DCB=(RECFM=FB,LRECL=500),                                             
//        SPACE=(CYL,(180,30),RLSE)                                             
//SYSIN   DD  *                                                                 
   SORT FIELDS=(467,2,A,469,1,A,465,2,A,467,1,A),FORMAT=CH                      
   INCLUDE COND=(469,1,CH,EQ,C'N',AND,                                          
                 211,2,CH,NE,C'1A',AND,                                         
                 211,2,CH,NE,C'SP')                                             
//*---------------------------------------------------------------------        
//* SORT BP13.F595.SOCNOTFD.AFQUE BY NRIC1                                      
//* INCLUDE                                                                     
//* BTO COUNT > 00 AND                                                          
//* REQUEST-STATUS=S = 00                                                       
//*---------------------------------------------------------------------        
//STEP04   EXEC SORT,COND=(0,NE)                                                
//SORTIN  DD DSN=BP13.F595.SOCNOTFD.AFQUE.AY0H,DISP=SHR                         
//SORTOUT  DD DSN=&&F595F585,DISP=(,PASS),                                      
//        UNIT=SYSDA,DCB=(RECFM=FB,LRECL=500),                                  
//        SPACE=(CYL,(180,30),RLSE)                                             
//SYSIN    DD  *                                                                
  SORT FIELDS=(41,9,A),FORMAT=CH                                                
   INCLUDE COND=(467,2,CH,GE,C'01')                                             
//*---------------------------------------------------------------------        
//* SORT BP13.F500.AY0H BY NRIC1/DTE-BALLOT/DTE-REQUEST                         
//*---------------------------------------------------------------------        
//STEP05   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F595.AY0H.CY46,DISP=SHR                          00120000
//*         DD DSN=BP13.F595.CB8A.AY0H.PA,DISP=SHR                              
//*         DD DSN=BP13.F595.CB8A.AY0H.PAHA1,DISP=SHR                           
//SORTOUT  DD DSN=&&F595QTR,DISP=(,PASS),                                       
//        UNIT=(SYSDA,3),DCB=(RECFM=FB,LRECL=500),                              
//        DATACLAS=MULTIVOL,                                                    
//        SPACE=(CYL,(80,30),RLSE)                                              
//SYSIN    DD  *                                                                
  SORT FIELDS=(41,9,A,334,6,A,261,8,A),FORMAT=CH                                
//*INCLUDE COND=(213,3,CH,NE,C'FTS')                                            
//*---------------------------------------------------------------------        
//* CREATE HARDLUCK FILE, TRANS-TYPE = 1                                        
//*---------------------------------------------------------------------        
//STEP06   EXEC PGM=BP13CY89,COND=(0,NE)                                        
//BP13F595 DD DSN=&&F595F585,DISP=(OLD,PASS)                                    
//BP13F205 DD DSN=&&BP13F205,DISP=(OLD,PASS)                                    
//BP13F730 DD DSN=&&F595QTR,DISP=(OLD,PASS)                                     
//BP13K813 DD DSN=BP13.K813.BTOBE,DISP=SHR,                                     
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K595 DD DSN=BP13.K595.BP13D220,DISP=SHR,                                  
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13F585 DD DSN=BP13.F585.HARDLUCK,DISP=SHR                                   
//BP13LY89 DD DSN=BP13.LY89.BP13CY89,DISP=SHR                                   
//SYSPRINT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
