//BP13A59H JOB (BP13P),'BP13A59H',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),    00000100
//          NOTIFY=CSD0071                                              00000200
//JOBLIB DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                     
//*=================================================================            
//*                                                                             
//*  THIS JOB IS TO ftp xml file to server                                      
//*  and create bp13k213                                                        
//*                                                                             
//*=================================================================            
//* CHG REF  BY   ON       DESCRIPTION                                          
//* -------- ---  -------- -----------                                          
//* BP136992 ZDD1 100817   NEW JCL                                              
//*=================================================================            
//*=====================================================================        
//*  to run the vry file for sending of sms                                     
//*=====================================================================        
//**********************************************************************        
//* STEP02 : DELETE TEMP FILES                                                  
//**********************************************************************        
//STEP02   EXEC PGM=IEFBR14,COND=(0,NE)                                         
//F20301   DD  DSN=BP13.F203.ASMS.XML01,                                        
//             DISP=(MOD,DELETE),                                               
//             SPACE=(CYL,0)                                                    
//F20302   DD  DSN=BP13.F203.ASMS.XML02,                                        
//             DISP=(MOD,DELETE),                                               
//             SPACE=(CYL,0)                                                    
//F20303   DD  DSN=BP13.F203.ASMS.XML03,                                        
//             DISP=(MOD,DELETE),                                               
//             SPACE=(CYL,0)                                                    
//F20304   DD  DSN=BP13.F203.ASMS.XML04,                                        
//             DISP=(MOD,DELETE),                                               
//             SPACE=(CYL,0)                                                    
//F20305   DD  DSN=BP13.F203.ASMS.XML05,                                        
//             DISP=(MOD,DELETE),                                               
//             SPACE=(CYL,0)                                                    
//F203FTP  DD  DSN=BP13.F203.FTP,                                               
//             DISP=(MOD,DELETE),                                               
//             SPACE=(CYL,0)                                                    
//F20306   DD  DSN=BP13.F203.ASMS.UNSUCC.XML01,                                 
//             DISP=(MOD,DELETE),                                               
//             SPACE=(CYL,0)                                                    
//F20307   DD  DSN=BP13.F203.ASMS.UNSUCC.XML02,                                 
//             DISP=(MOD,DELETE),                                               
//             SPACE=(CYL,0)                                                    
//F20308   DD  DSN=BP13.F203.ASMS.UNSUCC.XML03,                                 
//             DISP=(MOD,DELETE),                                               
//             SPACE=(CYL,0)                                                    
//F20309   DD  DSN=BP13.F203.ASMS.UNSUCC.XML04,                                 
//             DISP=(MOD,DELETE),                                               
//             SPACE=(CYL,0)                                                    
//F20310   DD  DSN=BP13.F203.ASMS.UNSUCC.XML05,                                 
//             DISP=(MOD,DELETE),                                               
//             SPACE=(CYL,0)                                                    
//F203UN   DD  DSN=BP13.F203.UNSUCC.FTP,                                        
//             DISP=(MOD,DELETE),                                               
//             SPACE=(CYL,0)                                                    
/*                                                                              
//**********************************************************************        
//* STEP03 : DEFINE TEMP FILES                                                  
//**********************************************************************        
//STEP03A  EXEC PGM=IEFBR14,COND=(0,NE)                                         
//F20301   DD  DSN=BP13.F203.ASMS.XML01,                                        
//             DISP=(NEW,CATLG),DATACLAS=MULTIVOL,                              
//             SPACE=(CYL,(2,1),RLSE),                                          
//             DCB=(RECFM=FB,LRECL=500,BLKSIZE=0)                               
/*                                                                              
//STEP03B  EXEC PGM=IEFBR14,COND=(0,NE)                                         
//F20302   DD  DSN=BP13.F203.ASMS.XML02,                                        
//             DISP=(NEW,CATLG),DATACLAS=MULTIVOL,                              
//             SPACE=(CYL,(2,1),RLSE),                                          
//             DCB=(RECFM=FB,LRECL=500,BLKSIZE=0)                               
/*                                                                              
//STEP03C  EXEC PGM=IEFBR14,COND=(0,NE)                                         
//F20303   DD  DSN=BP13.F203.ASMS.XML03,                                        
//             DISP=(NEW,CATLG),DATACLAS=MULTIVOL,                              
//             SPACE=(CYL,(2,1),RLSE),                                          
//             DCB=(RECFM=FB,LRECL=500,BLKSIZE=0)                               
/*                                                                              
//STEP03D  EXEC PGM=IEFBR14,COND=(0,NE)                                         
//F20304   DD  DSN=BP13.F203.ASMS.XML04,                                        
//             DISP=(NEW,CATLG),DATACLAS=MULTIVOL,                              
//             SPACE=(CYL,(2,1),RLSE),                                          
//             DCB=(RECFM=FB,LRECL=500,BLKSIZE=0)                               
/*                                                                              
//STEP03E  EXEC PGM=IEFBR14,COND=(0,NE)                                         
//F20305   DD  DSN=BP13.F203.ASMS.XML05,                                        
//             DISP=(NEW,CATLG),DATACLAS=MULTIVOL,                              
//             SPACE=(CYL,(2,1),RLSE),                                          
//             DCB=(RECFM=FB,LRECL=500,BLKSIZE=0)                               
/*                                                                              
//STEP03G  EXEC PGM=IEFBR14,COND=(0,NE)                                         
//F203FTP  DD  DSN=BP13.F203.FTP,                                               
//             DISP=(NEW,CATLG),DATACLAS=MULTIVOL,                              
//             SPACE=(CYL,(1,1),RLSE),                                          
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=0)                                
/*                                                                              
//STEP03H  EXEC PGM=IEFBR14,COND=(0,NE)                                         
//F20306   DD  DSN=BP13.F203.ASMS.UNSUCC.XML01,                                 
//             DISP=(NEW,CATLG),DATACLAS=MULTIVOL,                              
//             SPACE=(CYL,(2,1),RLSE),                                          
//             DCB=(RECFM=FB,LRECL=700,BLKSIZE=0)                               
/*                                                                              
//STEP03I  EXEC PGM=IEFBR14,COND=(0,NE)                                         
//F20307   DD  DSN=BP13.F203.ASMS.UNSUCC.XML02,                                 
//             DISP=(NEW,CATLG),DATACLAS=MULTIVOL,                              
//             SPACE=(CYL,(2,1),RLSE),                                          
//             DCB=(RECFM=FB,LRECL=700,BLKSIZE=0)                               
/*                                                                              
//STEP03J  EXEC PGM=IEFBR14,COND=(0,NE)                                         
//F20308   DD  DSN=BP13.F203.ASMS.UNSUCC.XML03,                                 
//             DISP=(NEW,CATLG),DATACLAS=MULTIVOL,                              
//             SPACE=(CYL,(2,1),RLSE),                                          
//             DCB=(RECFM=FB,LRECL=700,BLKSIZE=0)                               
/*                                                                              
//STEP03K  EXEC PGM=IEFBR14,COND=(0,NE)                                         
//F20309   DD  DSN=BP13.F203.ASMS.UNSUCC.XML04,                                 
//             DISP=(NEW,CATLG),DATACLAS=MULTIVOL,                              
//             SPACE=(CYL,(2,1),RLSE),                                          
//             DCB=(RECFM=FB,LRECL=700,BLKSIZE=0)                               
/*                                                                              
//STEP03L  EXEC PGM=IEFBR14,COND=(0,NE)                                         
//F20310   DD  DSN=BP13.F203.ASMS.UNSUCC.XML05,                                 
//             DISP=(NEW,CATLG),DATACLAS=MULTIVOL,                              
//             SPACE=(CYL,(2,1),RLSE),                                          
//             DCB=(RECFM=FB,LRECL=700,BLKSIZE=0)                               
/*                                                                              
//STEP03M  EXEC PGM=IEFBR14,COND=(0,NE)                                         
//F203UN   DD  DSN=BP13.F203.UNSUCC.FTP,                                        
//             DISP=(NEW,CATLG),DATACLAS=MULTIVOL,                              
//             SPACE=(CYL,(1,1),RLSE),                                          
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=0)                                
/*                                                                              
//**********************************************************************        
//* STEP04 : DELETE AND CREATE FILELIN DATASET                                  
//**********************************************************************        
//STEP04A   EXEC  PGM=IEFBR14,COND=(0,NE)                                       
//TRFRSEQ  DD  DSN=BP13.BULKSMS.FILEIN.FTP,                                     
//             DISP=(MOD,DELETE),                                               
//             SPACE=(TRK,0)                                                    
//SYSIN    DD  *                                                                
/*                                                                              
//STEP04B  EXEC PGM=IEFBR14,COND=(0,NE)                                         
//TRFRSEQ   DD DSN=BP13.BULKSMS.FILEIN.FTP,                                     
//            DISP=(NEW,CATLG),DATACLAS=MULTIVOL,                               
//            SPACE=(CYL,(5,5)),                                                
//            DCB=(RECFM=FB,LRECL=80,BLKSIZE=0)                                 
//SYSIN      DD *                                                               
/*                                                                              
//STEP04C   EXEC  PGM=IEFBR14,COND=(0,NE)                                       
//TRFRSEQ  DD  DSN=BP13.BULKSMS.FILEIN,                                         
//             DISP=(MOD,DELETE),                                               
//             SPACE=(TRK,0)                                                    
//SYSIN    DD  *                                                                
/*                                                                              
//STEP04D  EXEC PGM=IEFBR14,COND=(0,NE)                                         
//TRFRSEQ   DD DSN=BP13.BULKSMS.FILEIN,                                         
//            DISP=(NEW,CATLG),DATACLAS=MULTIVOL,                               
//            SPACE=(CYL,(5,5)),                                                
//            DCB=(RECFM=FB,LRECL=80,BLKSIZE=0)                                 
//SYSIN      DD *                                                               
/*                                                                              
//STEP04E   EXEC  PGM=IEFBR14,COND=(0,NE)                                       
//TRFRSEQ  DD  DSN=BP13.BULKSMS.UNSUCC.FILEIN.FTP,                              
//             DISP=(MOD,DELETE),                                               
//             SPACE=(TRK,0)                                                    
//SYSIN    DD  *                                                                
/*                                                                              
//STEP04F  EXEC PGM=IEFBR14,COND=(0,NE)                                         
//TRFRSEQ   DD DSN=BP13.BULKSMS.UNSUCC.FILEIN.FTP,                              
//            DISP=(NEW,CATLG),DATACLAS=MULTIVOL,                               
//            SPACE=(CYL,(5,5)),                                                
//            DCB=(RECFM=FB,LRECL=80,BLKSIZE=0)                                 
//SYSIN      DD *                                                               
/*                                                                              
//STEP04G   EXEC  PGM=IEFBR14,COND=(0,NE)                                       
//TRFRSEQ  DD  DSN=BP13.BULKSMS.UNSUCC.FILEIN,                                  
//             DISP=(MOD,DELETE),                                               
//             SPACE=(TRK,0)                                                    
//SYSIN    DD  *                                                                
/*                                                                              
//STEP04H  EXEC PGM=IEFBR14,COND=(0,NE)                                         
//TRFRSEQ   DD DSN=BP13.BULKSMS.UNSUCC.FILEIN,                                  
//            DISP=(NEW,CATLG),DATACLAS=MULTIVOL,                               
//            SPACE=(CYL,(5,5)),                                                
//            DCB=(RECFM=FB,LRECL=80,BLKSIZE=0)                                 
//SYSIN      DD *                                                               
/*                                                                              
//*=====================================================================        
//* GENERATE XML FILES FOR FTP TO SEND AUTOMATED SMS                            
//*=====================================================================        
//STEP06    EXEC PGM=BP13CFA4,COND=(0,NE)                                       
//BP13F203  DD DSN=BP13.F203.SMS.ROF.R1,DISP=SHR                                
//SY02F001  DD DSN=SY02.F001.DATE,DISP=SHR                                      
//B13DUMMY  DD DSN=BP13.DUMMY.MOBILE,DISP=SHR                                   
//B13F203A  DD DSN=BP13.F203.ASMS.XML01,DISP=SHR                                
//B13F203B  DD DSN=BP13.F203.ASMS.XML02,DISP=SHR                                
//B13F203C  DD DSN=BP13.F203.ASMS.XML03,DISP=SHR                                
//B13F203D  DD DSN=BP13.F203.ASMS.XML04,DISP=SHR                                
//B13F203E  DD DSN=BP13.F203.ASMS.XML05,DISP=SHR                                
//SYSPRINT  DD SYSOUT=*                                                         
//SYSOUT    DD SYSOUT=*                                                         
//SYSIN     DD *                                                                
/*                                                                              
//**********************************************************************        
//* FTP FILE(S) THAT ARE NOT EMPTY                                              
//**********************************************************************        
//STEP07A EXEC PGM=IDCAMS,COND=(0,NE)                                           
//SYSPRINT DD SYSOUT=*                                                          
//FILE1 DD DSN=BP13.F203.ASMS.XML01,DISP=SHR                                    
//SYSUDUMP DD SYSOUT=*                                                          
//SYSIN DD *                                                                    
  PRINT INFILE(FILE1) -                                                         
  DUMP COUNT(1)                                                                 
  IF LASTCC EQ 4 THEN SET MAXCC=1                                               
/*                                                                              
//STARTIF IF (STEP07A.RC = 0) THEN                                              
//**********************************************************************        
//*          GENERATE THE FILELIST DATASET                                      
//**********************************************************************        
//STEP07B   EXEC SAS,COND=(0,NE)                                                
//WORK      DD  UNIT=SYSDA,SPACE=(CYL,(150,10))                                 
//FILELST   DD  DSN=BP13.BULKSMS.FILEIN,DISP=MOD                                
//SYSPRINT  DD  SYSOUT=*                                                        
//SYSIN     DD  *                                                               
DATA _NULLS_;                                                                   
FILE FILELST;                                                                   
TDAY=DATE();                                                                    
   PUT @001 "20"                                                                
       @003 TDAY   YYMMDD6.                                                     
       @009 '0800000001.xml';                                                   
//**********************************************************************        
//*          GENERATE THE CURRENT FTP DATE FILE                                 
//**********************************************************************        
//STEP07C   EXEC SAS,COND=(0,NE)                                                
//WORK      DD  UNIT=SYSDA,SPACE=(CYL,(150,10))                                 
//FTPDATE   DD  DSN=BP13.F203.FTP,DISP=OLD                                      
//SYSPRINT  DD  SYSOUT=*                                                        
//SYSIN     DD  *                                                               
DATA _NULLS_;                                                                   
FILE FTPDATE;                                                                   
TDAY=DATE();                                                                    
   PUT @001 'cd /prod/appn/data/BP13/from-hdb/BULKSMS';                         
   PUT @001 "put 'BP13.F203.ASMS.XML01' 20"                                     
       @030 TDAY   YYMMDD6.                                                     
       @036 '0800000001.xml';                                                   
   PUT @001 'quit';                                                             
//FTP001   EXEC FTP,PARM='LANSFTPP01   (EXIT'                                   
//NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                                  
//INPUT    DD DSN=BP13.F203.FTP,DISP=OLD                                        
/*                                                                              
//STOPIF   ENDIF                                                                
/*                                                                              
//**********************************************************************        
//* FTP FILE(S) THAT ARE NOT EMPTY                                              
//**********************************************************************        
//STEP08A EXEC PGM=IDCAMS,COND=(0,NE)                                           
//SYSPRINT DD SYSOUT=*                                                          
//FILE1 DD DSN=BP13.F203.ASMS.XML02,DISP=SHR                                    
//SYSUDUMP DD SYSOUT=*                                                          
//SYSIN DD *                                                                    
  PRINT INFILE(FILE1) -                                                         
  DUMP COUNT(1)                                                                 
  IF LASTCC EQ 4 THEN SET MAXCC=1                                               
/*                                                                              
//STARTIF IF (STEP08A.RC = 0) THEN                                              
//**********************************************************************        
//*          GENERATE THE FILELIST DATASET                                      
//**********************************************************************        
//STEP08B   EXEC SAS,COND=(0,NE)                                                
//WORK      DD  UNIT=SYSDA,SPACE=(CYL,(150,10))                                 
//FILELST   DD  DSN=BP13.BULKSMS.FILEIN,DISP=MOD                                
//SYSPRINT  DD  SYSOUT=*                                                        
//SYSIN     DD  *                                                               
DATA _NULLS_;                                                                   
FILE FILELST;                                                                   
TDAY=DATE();                                                                    
   PUT @001 "20"                                                                
       @003 TDAY   YYMMDD6.                                                     
       @009 '0800000002.xml';                                                   
//**********************************************************************        
//*          GENERATE THE CURRENT FTP DATE FILE                                 
//**********************************************************************        
//STEP08C   EXEC SAS,COND=(0,NE)                                                
//WORK      DD  UNIT=SYSDA,SPACE=(CYL,(150,10))                                 
//FTPDATE   DD  DSN=BP13.F203.FTP,DISP=OLD                                      
//SYSPRINT  DD  SYSOUT=*                                                        
//SYSIN     DD  *                                                               
DATA _NULLS_;                                                                   
FILE FTPDATE;                                                                   
TDAY=DATE();                                                                    
   PUT @001 'cd /prod/appn/data/BP13/from-hdb/BULKSMS';                         
   PUT @001 "put 'BP13.F203.ASMS.XML02' 20"                                     
       @030 TDAY   YYMMDD6.                                                     
       @036 '0800000002.xml';                                                   
   PUT @001 'quit';                                                             
//FTP002   EXEC FTP,PARM='LANSFTPP01   (EXIT'                                   
//NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                                  
//INPUT    DD DSN=BP13.F203.FTP,DISP=OLD                                        
/*                                                                              
//STOPIF   ENDIF                                                                
/*                                                                              
//**********************************************************************        
//* FTP FILE(S) THAT ARE NOT EMPTY                                              
//**********************************************************************        
//STEP09A EXEC PGM=IDCAMS,COND=(0,NE)                                           
//SYSPRINT DD SYSOUT=*                                                          
//FILE1 DD DSN=BP13.F203.ASMS.XML03,DISP=SHR                                    
//SYSUDUMP DD SYSOUT=*                                                          
//SYSIN DD *                                                                    
  PRINT INFILE(FILE1) -                                                         
  DUMP COUNT(1)                                                                 
  IF LASTCC EQ 4 THEN SET MAXCC=1                                               
/*                                                                              
//STARTIF IF (STEP09A.RC = 0) THEN                                              
//**********************************************************************        
//*          GENERATE THE FILELIST DATASET                                      
//**********************************************************************        
//STEP09B   EXEC SAS,COND=(0,NE)                                                
//WORK      DD  UNIT=SYSDA,SPACE=(CYL,(150,10))                                 
//FILELST   DD  DSN=BP13.BULKSMS.FILEIN,DISP=MOD                                
//SYSPRINT  DD  SYSOUT=*                                                        
//SYSIN     DD  *                                                               
DATA _NULLS_;                                                                   
FILE FILELST;                                                                   
TDAY=DATE();                                                                    
   PUT @001 "20"                                                                
       @003 TDAY   YYMMDD6.                                                     
       @009 '0800000003.xml';                                                   
//**********************************************************************        
//*          GENERATE THE CURRENT FTP DATE FILE                                 
//**********************************************************************        
//STEP09C   EXEC SAS,COND=(0,NE)                                                
//WORK      DD  UNIT=SYSDA,SPACE=(CYL,(150,10))                                 
//FTPDATE   DD  DSN=BP13.F203.FTP,DISP=OLD                                      
//SYSPRINT  DD  SYSOUT=*                                                        
//SYSIN     DD  *                                                               
DATA _NULLS_;                                                                   
FILE FTPDATE;                                                                   
TDAY=DATE();                                                                    
   PUT @001 'cd /prod/appn/data/BP13/from-hdb/BULKSMS';                         
   PUT @001 "put 'BP13.F203.ASMS.XML03' 20"                                     
       @030 TDAY   YYMMDD6.                                                     
       @036 '0800000003.xml';                                                   
   PUT @001 'quit';                                                             
//FTP003   EXEC FTP,PARM='LANSFTPP01   (EXIT'                                   
//NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                                  
//INPUT    DD DSN=BP13.F203.FTP,DISP=OLD                                        
/*                                                                              
//STOPIF   ENDIF                                                                
/*                                                                              
//**********************************************************************        
//* FTP FILE(S) THAT ARE NOT EMPTY                                              
//**********************************************************************        
//STEP10A EXEC PGM=IDCAMS,COND=(0,NE)                                           
//SYSPRINT DD SYSOUT=*                                                          
//FILE1 DD DSN=BP13.F203.ASMS.XML04,DISP=SHR                                    
//SYSUDUMP DD SYSOUT=*                                                          
//SYSIN DD *                                                                    
  PRINT INFILE(FILE1) -                                                         
  DUMP COUNT(1)                                                                 
  IF LASTCC EQ 4 THEN SET MAXCC=1                                               
/*                                                                              
//STARTIF IF (STEP10A.RC = 0) THEN                                              
//**********************************************************************        
//*          GENERATE THE FILELIST DATASET                                      
//**********************************************************************        
//STEP10B   EXEC SAS,COND=(0,NE)                                                
//WORK      DD  UNIT=SYSDA,SPACE=(CYL,(150,10))                                 
//FILELST   DD  DSN=BP13.BULKSMS.FILEIN,DISP=MOD                                
//SYSPRINT  DD  SYSOUT=*                                                        
//SYSIN     DD  *                                                               
DATA _NULLS_;                                                                   
FILE FILELST;                                                                   
TDAY=DATE();                                                                    
   PUT @001 "20"                                                                
       @003 TDAY   YYMMDD6.                                                     
       @009 '0800000004.xml';                                                   
//**********************************************************************        
//*          GENERATE THE CURRENT FTP DATE FILE                                 
//**********************************************************************        
//STEP10C   EXEC SAS,COND=(0,NE)                                                
//WORK      DD  UNIT=SYSDA,SPACE=(CYL,(150,10))                                 
//FTPDATE   DD  DSN=BP13.F203.FTP,DISP=OLD                                      
//SYSPRINT  DD  SYSOUT=*                                                        
//SYSIN     DD  *                                                               
DATA _NULLS_;                                                                   
FILE FTPDATE;                                                                   
TDAY=DATE();                                                                    
   PUT @001 'cd /prod/appn/data/BP13/from-hdb/BULKSMS';                         
   PUT @001 "put 'BP13.F203.ASMS.XML04' 20"                                     
       @030 TDAY   YYMMDD6.                                                     
       @036 '0800000004.xml';                                                   
   PUT @001 'quit';                                                             
//FTP004   EXEC FTP,PARM='LANSFTPP01   (EXIT'                                   
//NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                                  
//INPUT    DD DSN=BP13.F203.FTP,DISP=OLD                                        
/*                                                                              
//STOPIF   ENDIF                                                                
/*                                                                              
//**********************************************************************        
//* FTP FILE(S) THAT ARE NOT EMPTY                                              
//**********************************************************************        
//STEP11A EXEC PGM=IDCAMS,COND=(0,NE)                                           
//SYSPRINT DD SYSOUT=*                                                          
//FILE1 DD DSN=BP13.F203.ASMS.XML05,DISP=SHR                                    
//SYSUDUMP DD SYSOUT=*                                                          
//SYSIN DD *                                                                    
  PRINT INFILE(FILE1) -                                                         
  DUMP COUNT(1)                                                                 
  IF LASTCC EQ 4 THEN SET MAXCC=1                                               
/*                                                                              
//STARTIF IF (STEP11A.RC = 0) THEN                                              
//**********************************************************************        
//*          GENERATE THE FILELIST DATASET                                      
//**********************************************************************        
//STEP11B   EXEC SAS,COND=(0,NE)                                                
//WORK      DD  UNIT=SYSDA,SPACE=(CYL,(150,10))                                 
//FILELST   DD  DSN=BP13.BULKSMS.FILEIN,DISP=MOD                                
//SYSPRINT  DD  SYSOUT=*                                                        
//SYSIN     DD  *                                                               
DATA _NULLS_;                                                                   
FILE FILELST;                                                                   
TDAY=DATE();                                                                    
   PUT @001 "20"                                                                
       @003 TDAY   YYMMDD6.                                                     
       @009 '0800000005.xml';                                                   
//**********************************************************************        
//*          GENERATE THE CURRENT FTP DATE FILE                                 
//**********************************************************************        
//STEP11C   EXEC SAS,COND=(0,NE)                                                
//WORK      DD  UNIT=SYSDA,SPACE=(CYL,(150,10))                                 
//FTPDATE   DD  DSN=BP13.F203.FTP,DISP=OLD                                      
//SYSPRINT  DD  SYSOUT=*                                                        
//SYSIN     DD  *                                                               
DATA _NULLS_;                                                                   
FILE FTPDATE;                                                                   
TDAY=DATE();                                                                    
   PUT @001 'cd /prod/appn/data/BP13/from-hdb/BULKSMS';                         
   PUT @001 "put 'BP13.F203.ASMS.XML05' 20"                                     
       @030 TDAY   YYMMDD6.                                                     
       @036 '0800000005.xml';                                                   
   PUT @001 'quit';                                                             
//FTP005   EXEC FTP,PARM='LANSFTPP01   (EXIT'                                   
//NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                                  
//INPUT    DD DSN=BP13.F203.FTP,DISP=OLD                                        
/*                                                                              
//STOPIF   ENDIF                                                                
/*                                                                              
//**********************************************************************        
//*          FTP TO BulkSMS-File-List.txt                                       
//**********************************************************************        
//*STEP13    EXEC SAS,COND=(0,NE,STEP06)                                        
//*WORK      DD  UNIT=SYSDA,SPACE=(CYL,(150,10))                                
//*FTPDATE   DD  DSN=BP13.BULKSMS.FILEIN.FTP,DISP=OLD                           
//*SYSPRINT  DD  SYSOUT=*                                                       
//*SYSIN     DD  *                                                              
//*DATA _NULLS_;                                                                
//*FILE FTPDATE;                                                                
//*TDAY=DATE();                                                                 
//*   PUT @001 'cd /prod/appn/data/BP13/from-hdb/BULKSMS';                      
//*   PUT @001 "put 'BP13.BULKSMS.FILEIN' BulkSMS-File-List.txt";               
//*   PUT @001 'quit';                                                          
//*FTP007   EXEC FTP,PARM='LANSFTPP01   (EXIT'                                  
//*NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                                 
//*INPUT    DD DSN=BP13.BULKSMS.FILEIN.FTP,DISP=OLD                             
/*                                                                              
//*=====================================================================        
//* GENERATE XML FILES FOR FTP TO SEND AUTOMATED SMS                            
//*=====================================================================        
//STEP15    EXEC PGM=BP13CFA8,COND=(0,NE,STEP06)                                
//BP13F213  DD DSN=BP13.F203.SMS.ROF.R2,DISP=SHR                                
//SY02F001  DD DSN=SY02.F001.DATE,DISP=SHR                                      
//B13DUMMY  DD DSN=BP13.DUMMY.MOBILE,DISP=SHR                                   
//B13F213A  DD DSN=BP13.F203.ASMS.UNSUCC.XML01,DISP=SHR                         
//B13F213B  DD DSN=BP13.F203.ASMS.UNSUCC.XML02,DISP=SHR                         
//B13F213C  DD DSN=BP13.F203.ASMS.UNSUCC.XML03,DISP=SHR                         
//B13F213D  DD DSN=BP13.F203.ASMS.UNSUCC.XML04,DISP=SHR                         
//B13F213E  DD DSN=BP13.F203.ASMS.UNSUCC.XML05,DISP=SHR                         
//SYSPRINT  DD SYSOUT=*                                                         
//SYSOUT    DD SYSOUT=*                                                         
//SYSIN     DD *                                                                
/*                                                                              
//**********************************************************************        
//* FTP FILE(S) THAT ARE NOT EMPTY                                              
//**********************************************************************        
//STEP16A EXEC PGM=IDCAMS,COND=(0,NE,STEP15)                                    
//SYSPRINT DD SYSOUT=*                                                          
//FILE1 DD DSN=BP13.F203.ASMS.UNSUCC.XML01,DISP=SHR                             
//SYSUDUMP DD SYSOUT=*                                                          
//SYSIN DD *                                                                    
  PRINT INFILE(FILE1) -                                                         
  DUMP COUNT(1)                                                                 
  IF LASTCC EQ 4 THEN SET MAXCC=1                                               
/*                                                                              
//STARTIF IF (STEP16A.RC = 0) THEN                                              
//**********************************************************************        
//*          GENERATE THE FILELIST DATASET                                      
//**********************************************************************        
//STEP16B   EXEC SAS,COND=(0,NE,STEP16A)                                        
//WORK      DD  UNIT=SYSDA,SPACE=(CYL,(150,10))                                 
//FILELST   DD  DSN=BP13.BULKSMS.UNSUCC.FILEIN,DISP=MOD                         
//SYSPRINT  DD  SYSOUT=*                                                        
//SYSIN     DD  *                                                               
DATA _NULLS_;                                                                   
FILE FILELST;                                                                   
TDAY=DATE();                                                                    
   PUT @001 "20"                                                                
       @003 TDAY   YYMMDD6.                                                     
       @009 '0800000006.xml';                                                   
//**********************************************************************        
//*          GENERATE THE CURRENT FTP DATE FILE                                 
//**********************************************************************        
//STEP16C   EXEC SAS,COND=(0,NE,STEP16A)                                        
//WORK      DD  UNIT=SYSDA,SPACE=(CYL,(150,10))                                 
//FTPDATE   DD  DSN=BP13.F203.UNSUCC.FTP,DISP=OLD                               
//SYSPRINT  DD  SYSOUT=*                                                        
//SYSIN     DD  *                                                               
DATA _NULLS_;                                                                   
FILE FTPDATE;                                                                   
TDAY=DATE();                                                                    
   PUT @001 'cd /prod/appn/data/BP13/from-hdb/BULKSMS';                         
   PUT @001 "put 'BP13.F203.ASMS.UNSUCC.XML01' 20"                              
       @037 TDAY   YYMMDD6.                                                     
       @043 '0800000006.xml';                                                   
   PUT @001 'quit';                                                             
//FTP008   EXEC FTP,PARM='LANSFTPP01   (EXIT'                                   
//NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                                  
//INPUT    DD DSN=BP13.F203.UNSUCC.FTP,DISP=OLD                                 
/*                                                                              
//STOPIF   ENDIF                                                                
/*                                                                              
//**********************************************************************        
//* FTP FILE(S) THAT ARE NOT EMPTY                                              
//**********************************************************************        
//STEP17A EXEC PGM=IDCAMS,COND=(0,NE,STEP15)                                    
//SYSPRINT DD SYSOUT=*                                                          
//FILE1 DD DSN=BP13.F203.ASMS.UNSUCC.XML02,DISP=SHR                             
//SYSUDUMP DD SYSOUT=*                                                          
//SYSIN DD *                                                                    
  PRINT INFILE(FILE1) -                                                         
  DUMP COUNT(1)                                                                 
  IF LASTCC EQ 4 THEN SET MAXCC=1                                               
/*                                                                              
//STARTIF IF (STEP17A.RC = 0) THEN                                              
//**********************************************************************        
//*          GENERATE THE FILELIST DATASET                                      
//**********************************************************************        
//STEP17B   EXEC SAS,COND=(0,NE,STEP17A)                                        
//WORK      DD  UNIT=SYSDA,SPACE=(CYL,(150,10))                                 
//FILELST   DD  DSN=BP13.BULKSMS.UNSUCC.FILEIN,DISP=MOD                         
//SYSPRINT  DD  SYSOUT=*                                                        
//SYSIN     DD  *                                                               
DATA _NULLS_;                                                                   
FILE FILELST;                                                                   
TDAY=DATE();                                                                    
   PUT @001 "20"                                                                
       @003 TDAY   YYMMDD6.                                                     
       @009 '0800000007.xml';                                                   
//**********************************************************************        
//*          GENERATE THE CURRENT FTP DATE FILE                                 
//**********************************************************************        
//STEP17C   EXEC SAS,COND=(0,NE,STEP17A)                                        
//WORK      DD  UNIT=SYSDA,SPACE=(CYL,(150,10))                                 
//FTPDATE   DD  DSN=BP13.F203.UNSUCC.FTP,DISP=OLD                               
//SYSPRINT  DD  SYSOUT=*                                                        
//SYSIN     DD  *                                                               
DATA _NULLS_;                                                                   
FILE FTPDATE;                                                                   
TDAY=DATE();                                                                    
   PUT @001 'cd /prod/appn/data/BP13/from-hdb/BULKSMS';                         
   PUT @001 "put 'BP13.F203.ASMS.UNSUCC.XML02' 20"                              
       @037 TDAY   YYMMDD6.                                                     
       @043 '0800000007.xml';                                                   
   PUT @001 'quit';                                                             
//FTP009   EXEC FTP,PARM='LANSFTPP01   (EXIT'                                   
//NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                                  
//INPUT    DD DSN=BP13.F203.UNSUCC.FTP,DISP=OLD                                 
/*                                                                              
//STOPIF   ENDIF                                                                
/*                                                                              
//**********************************************************************        
//* FTP FILE(S) THAT ARE NOT EMPTY                                              
//**********************************************************************        
//STEP18A EXEC PGM=IDCAMS,COND=(0,NE,STEP15)                                    
//SYSPRINT DD SYSOUT=*                                                          
//FILE1 DD DSN=BP13.F203.ASMS.UNSUCC.XML03,DISP=SHR                             
//SYSUDUMP DD SYSOUT=*                                                          
//SYSIN DD *                                                                    
  PRINT INFILE(FILE1) -                                                         
  DUMP COUNT(1)                                                                 
  IF LASTCC EQ 4 THEN SET MAXCC=1                                               
/*                                                                              
//STARTIF IF (STEP18A.RC = 0) THEN                                              
//**********************************************************************        
//*          GENERATE THE FILELIST DATASET                                      
//**********************************************************************        
//STEP18B   EXEC SAS,COND=(0,NE,STEP18A)                                        
//WORK      DD  UNIT=SYSDA,SPACE=(CYL,(150,10))                                 
//FILELST   DD  DSN=BP13.BULKSMS.UNSUCC.FILEIN,DISP=MOD                         
//SYSPRINT  DD  SYSOUT=*                                                        
//SYSIN     DD  *                                                               
DATA _NULLS_;                                                                   
FILE FILELST;                                                                   
TDAY=DATE();                                                                    
   PUT @001 "20"                                                                
       @003 TDAY   YYMMDD6.                                                     
       @009 '0800000008.xml';                                                   
//**********************************************************************        
//*          GENERATE THE CURRENT FTP DATE FILE                                 
//**********************************************************************        
//STEP18C   EXEC SAS,COND=(0,NE,STEP18A)                                        
//WORK      DD  UNIT=SYSDA,SPACE=(CYL,(150,10))                                 
//FTPDATE   DD  DSN=BP13.F203.UNSUCC.FTP,DISP=OLD                               
//SYSPRINT  DD  SYSOUT=*                                                        
//SYSIN     DD  *                                                               
DATA _NULLS_;                                                                   
FILE FTPDATE;                                                                   
TDAY=DATE();                                                                    
   PUT @001 'cd /prod/appn/data/BP13/from-hdb/BULKSMS';                         
   PUT @001 "put 'BP13.F203.ASMS.UNSUCC.XML03' 20"                              
       @037 TDAY   YYMMDD6.                                                     
       @043 '0800000008.xml';                                                   
   PUT @001 'quit';                                                             
//FTP010   EXEC FTP,PARM='LANSFTPP01   (EXIT'                                   
//NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                                  
//INPUT    DD DSN=BP13.F203.UNSUCC.FTP,DISP=OLD                                 
/*                                                                              
//STOPIF   ENDIF                                                                
/*                                                                              
//**********************************************************************        
//* FTP FILE(S) THAT ARE NOT EMPTY                                              
//**********************************************************************        
//STEP19A EXEC PGM=IDCAMS,COND=(0,NE,STEP15)                                    
//SYSPRINT DD SYSOUT=*                                                          
//FILE1 DD DSN=BP13.F203.ASMS.UNSUCC.XML04,DISP=SHR                             
//SYSUDUMP DD SYSOUT=*                                                          
//SYSIN DD *                                                                    
  PRINT INFILE(FILE1) -                                                         
  DUMP COUNT(1)                                                                 
  IF LASTCC EQ 4 THEN SET MAXCC=1                                               
/*                                                                              
//STARTIF IF (STEP19A.RC = 0) THEN                                              
//**********************************************************************        
//*          GENERATE THE FILELIST DATASET                                      
//**********************************************************************        
//STEP19B   EXEC SAS,COND=(0,NE,STEP19A)                                        
//WORK      DD  UNIT=SYSDA,SPACE=(CYL,(150,10))                                 
//FILELST   DD  DSN=BP13.BULKSMS.UNSUCC.FILEIN,DISP=MOD                         
//SYSPRINT  DD  SYSOUT=*                                                        
//SYSIN     DD  *                                                               
DATA _NULLS_;                                                                   
FILE FILELST;                                                                   
TDAY=DATE();                                                                    
   PUT @001 "20"                                                                
       @003 TDAY   YYMMDD6.                                                     
       @009 '0800000009.xml';                                                   
//**********************************************************************        
//*          GENERATE THE CURRENT FTP DATE FILE                                 
//**********************************************************************        
//STEP19C   EXEC SAS,COND=(0,NE,STEP19A)                                        
//WORK      DD  UNIT=SYSDA,SPACE=(CYL,(150,10))                                 
//FTPDATE   DD  DSN=BP13.F203.UNSUCC.FTP,DISP=OLD                               
//SYSPRINT  DD  SYSOUT=*                                                        
//SYSIN     DD  *                                                               
DATA _NULLS_;                                                                   
FILE FTPDATE;                                                                   
TDAY=DATE();                                                                    
   PUT @001 'cd /prod/appn/data/BP13/from-hdb/BULKSMS';                         
   PUT @001 "put 'BP13.F203.ASMS.UNSUCC.XML04' 20"                              
       @037 TDAY   YYMMDD6.                                                     
       @043 '0800000009.xml';                                                   
   PUT @001 'quit';                                                             
//FTP011   EXEC FTP,PARM='LANSFTPP01   (EXIT'                                   
//NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                                  
//INPUT    DD DSN=BP13.F203.UNSUCC.FTP,DISP=OLD                                 
/*                                                                              
//STOPIF   ENDIF                                                                
/*                                                                              
//**********************************************************************        
//* FTP FILE(S) THAT ARE NOT EMPTY                                              
//**********************************************************************        
//STEP20A EXEC PGM=IDCAMS,COND=(0,NE,STEP15)                                    
//SYSPRINT DD SYSOUT=*                                                          
//FILE1 DD DSN=BP13.F203.ASMS.UNSUCC.XML05,DISP=SHR                             
//SYSUDUMP DD SYSOUT=*                                                          
//SYSIN DD *                                                                    
  PRINT INFILE(FILE1) -                                                         
  DUMP COUNT(1)                                                                 
  IF LASTCC EQ 4 THEN SET MAXCC=1                                               
/*                                                                              
//STARTIF IF (STEP20A.RC = 0) THEN                                              
//**********************************************************************        
//*          GENERATE THE FILELIST DATASET                                      
//**********************************************************************        
//STEP20B   EXEC SAS,COND=(0,NE,STEP20A)                                        
//WORK      DD  UNIT=SYSDA,SPACE=(CYL,(150,10))                                 
//FILELST   DD  DSN=BP13.BULKSMS.UNSUCC.FILEIN,DISP=MOD                         
//SYSPRINT  DD  SYSOUT=*                                                        
//SYSIN     DD  *                                                               
DATA _NULLS_;                                                                   
FILE FILELST;                                                                   
TDAY=DATE();                                                                    
   PUT @001 "20"                                                                
       @003 TDAY   YYMMDD6.                                                     
       @009 '0800000010.xml';                                                   
//**********************************************************************        
//*          GENERATE THE CURRENT FTP DATE FILE                                 
//**********************************************************************        
//STEP20C   EXEC SAS,COND=(0,NE,STEP20A)                                        
//WORK      DD  UNIT=SYSDA,SPACE=(CYL,(150,10))                                 
//FTPDATE   DD  DSN=BP13.F203.UNSUCC.FTP,DISP=OLD                               
//SYSPRINT  DD  SYSOUT=*                                                        
//SYSIN     DD  *                                                               
DATA _NULLS_;                                                                   
FILE FTPDATE;                                                                   
TDAY=DATE();                                                                    
   PUT @001 'cd /prod/appn/data/BP13/from-hdb/BULKSMS';                         
   PUT @001 "put 'BP13.F203.ASMS.UNSUCC.XML05' 20"                              
       @037 TDAY   YYMMDD6.                                                     
       @043 '0800000010.xml';                                                   
   PUT @001 'quit';                                                             
//FTP012   EXEC FTP,PARM='LANSFTPP01   (EXIT'                                   
//NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                                  
//INPUT    DD DSN=BP13.F203.UNSUCC.FTP,DISP=OLD                                 
/*                                                                              
//STOPIF   ENDIF                                                                
/*                                                                              
//*---------------------------------------------------------------------        
//STEP20D  EXEC SORT,COND=(0,NE,STEP15)                                         
//SORTIN   DD DSN=BP13.BULKSMS.UNSUCC.FILEIN,DISP=SHR                           
//SORTOUT  DD DSN=BP13.BULKSMS.FILEIN,DISP=MOD                                  
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,80,A),FORMAT=CH                                                
//**********************************************************************        
//*          FTP TO BulkSMS-File-List.txt                                       
//**********************************************************************        
//STEP21    EXEC SAS,COND=(0,NE,STEP15)                                         
//WORK      DD  UNIT=SYSDA,SPACE=(CYL,(150,10))                                 
//FTPDATE   DD  DSN=BP13.BULKSMS.FILEIN.FTP,DISP=OLD                            
//SYSPRINT  DD  SYSOUT=*                                                        
//SYSIN     DD  *                                                               
DATA _NULLS_;                                                                   
FILE FTPDATE;                                                                   
TDAY=DATE();                                                                    
   PUT @001 'cd /prod/appn/data/BP13/from-hdb/BULKSMS';                         
   PUT @001 "put 'BP13.BULKSMS.FILEIN' BulkSMS-File-List.txt";                  
   PUT @001 'quit';                                                             
//FTP013   EXEC FTP,PARM='LANSFTPP01   (EXIT'                                   
//NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                                  
//INPUT    DD DSN=BP13.BULKSMS.FILEIN.FTP,DISP=OLD                              
/*                                                                              
//*====================================================================         
//* ACCUMULATE CASES WHERE ASMS SENT                                            
//*====================================================================         
//STEP22   EXEC SORT,COND=(0,NE,STEP15)                                         
//SORTIN   DD DSN=BP13.F203.SMS.ROF,DISP=SHR                                    
//SORTOUT  DD DSN=BP13.F203.ASMS.SENT.ACCUM,DISP=MOD                            
//SYSPRINT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  *                                                                
  SORT FIELDS=COPY                                                              
/*                                                                              
//*--------------------------------------------------------------------         
//*- SORT                                                                       
//*--------------------------------------------------------------------         
//STEP23   EXEC SORT,COND=(0,NE,STEP15)                                         
//SORTIN   DD DSN=BP13.F203.SMS.ROF,DISP=SHR                                    
//SORTOUT  DD DSN=&&BP13F203,DISP=(NEW,PASS),                                   
//         UNIT=SYSDA,DCB=(RECFM=FB,LRECL=200),                                 
//         SPACE=(CYL,(20,3),RLSE)                                              
//SYSIN    DD  *                                                                
   SORT FIELDS=(12,8,A),FORMAT=CH                                               
//*--------------------------------------------------------------------         
//*- CREATE SMS FILE                                                            
//*--------------------------------------------------------------------         
//STEP24   EXEC PGM=IDCAMS,COND=(0,NE,STEP15)                                   
//SYSPRINT DD SYSOUT=*                                                          
//INPUT    DD DSN=&&BP13F203,DISP=(OLD,PASS)                                    
//SYSIN    DD *                                                                 
         DEL (BP13.K213.SMS.ROF) CLUSTER PURGE                                  
         DEF CL (NAME(BP13.K213.SMS.ROF)         -                              
                 CYL(20 5)                        -                             
                 UNIQUE                          -                              
                 SPEED                           -                              
                 STORCLAS(PRODRLS)               -                              
                 LOG(NONE)                       -                              
                 SHR(2 3))                       -                              
                 DATA                            -                              
                 (NAME(BP13.K213.SMS.ROF.DATA) -                                
                 KEYS(8 11)                      -                              
                 RECSZ(200 200)                  -                              
                 FSPC(10 10)                     -                              
                 CISZ(4096))                                                    
         IF LASTCC = 0 THEN                      -                              
           REPRO IFILE(INPUT)                    -                              
                 ODS(BP13.K213.SMS.ROF)                                         
      IF MAXCC = 0  THEN                         -                      00970000
           DEF AIX (NAME(BP13.K213.SMS.ROF.ALTX1) -                     00980000
               REL(BP13.K213.SMS.ROF)            -                      00990000
               REUSE                             -                      01010000
               KEYS(9 117)                       -                      01020000
               SHR(2 3)                          -                      01040000
               NUNQK)                            -                      01050000
               DATA                              -                      01060000
               (NAME(BP13.K213.SMS.ROF.ALTX1.DATA) -                    01070000
               CYL(15 5)                       -                        01080000
               RECSZ(150 1000)                    -                     01090000
               FSPC(10 10)                       -                      01100000
               CISZ(4096))                       -                      01110000
               INDEX                             -                      01120000
               (NAME(BP13.K213.SMS.ROF.ALTX1.INDEX) -                   01130000
               CISZ(4096))                                              01140000
         IF MAXCC = 0 THEN                       -                      01150000
           DEF PATH (NAME(BP13.K213.SMS.ROF.PATH1) -                    01160000
               PENT(BP13.K213.SMS.ROF.ALTX1))                           01170000
         IF MAXCC = 0 THEN                                              01180000
           BIX IDS(BP13.K213.SMS.ROF)            -                      01190000
               ODS(BP13.K213.SMS.ROF.ALTX1)                             01200000
