//BP13A644 JOB (BP13P),'BP13A644',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//         NOTIFY=CSD0071                                                       
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//**********************************************************************        
//* CHG REF   BY    DDMMCCYY  DESCRIPTION                                       
//* --------  ----  --------  -----------------------------------------         
//* BP138301  AM25  04062020  HARDCOPY REPORTS CONVERSION                       
//**********************************************************************        
//*--------------------------------------------------------------------         
//*      VERIFY FILES BEFORE DAILY PRODUCTION RUN                               
//*--------------------------------------------------------------------         
//STEP01  EXEC PGM=IDCAMS,COND=(0,NE)                                           
//INPUT1   DD DSN=BP13.K740.MATUREBA,DISP=OLD                                   
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN   DD *                                                                  
          VFY FILE(INPUT1)                                                      
//*-------------------------------------------------------------------- 00130010
//* OMIT BLANK RECORD                                                   00130010
//*-------------------------------------------------------------------- 00130010
//STEP02   EXEC SORT,COND=(0,NE)                                                
//SORTIN  DD DSN=BP13.K707.COHORT,DISP=SHR                                      
//SORTOUT DD DSN=&&BP13F707,DISP=(NEW,PASS),                                    
//            DCB=(RECFM=FB,LRECL=50),                                          
//            SPACE=(CYL,(2,1),RLSE)                                            
//SYSIN   DD  *                                                                 
   SORT FIELDS=(1,7,A),FORMAT=CH                                                
   OMIT COND=(1,7,CH,EQ,C'       ')                                             
//*-------------------------------------------------------------------- 00130010
//* SORT BY NT/FT/HH/COHORT                                             00130010
//*-------------------------------------------------------------------- 00130010
//STEP03  EXEC SORT,COND=(0,NE)                                                 
//SORTIN  DD DSN=BP13.K740.MATUREBA,DISP=SHR,                                   
//        AMP=('BUFND=4','BUFNI=8')                                             
//SORTOUT DD DSN=&&BP13F740,DISP=(NEW,PASS),                                    
//            DCB=(RECFM=FB,LRECL=500),                                         
//            SPACE=(CYL,(50,20),RLSE)                                          
//SYSIN   DD  *                                                                 
   SORT FIELDS=(187,3,A,211,2,A,461,1,A,260,1,A,123,8,A),FORMAT=CH              
   INCLUDE COND=(260,1,CH,EQ,C'W')                                              
//*---------------------------------------------------------------------00000030
//* UPDATE COHORT FOR REQUEST W CASES                                   00000030
//*---------------------------------------------------------------------00000030
//STEP04   EXEC  PGM=BP13C70D,COND=(0,NE)                               00002680
//BP13F707 DD  DSN=&&BP13F707,DISP=(OLD,PASS)                           00002710
//BP13F740 DD  DSN=&&BP13F740,DISP=(OLD,PASS)                           00002710
//BP13K740 DD  DSN=BP13.K740.MATUREBA,DISP=SHR,                         00002710
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13L70D DD  SYSOUT=8,DEST=IOM8                                               
//SYSOUT   DD  SYSOUT=*                                                 00002880
//SYSPRINT DD  SYSOUT=*                                                 00002890
//SYSDBG   DD  SYSOUT=*                                                 00001760
//SYSDBOUT DD  SYSOUT=*                                                 00001770
