//BP13M905 JOB (BP13P),'BP13M905',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),    00010000
//       NOTIFY=CSD0071                                                 00020000
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                           00030000
//* ============================================================== *    00040000
//* CHG REF  BY   ON       DESCRIPTION                                  00050000
//* -------- --   ------   -----------                                  00060000
//* BP136905 MRN1 25082017 REPORTS FOR NOTIFICATION LETTER TYPES        00070000
//*                        1-DP, 2-QN, 3-LN, 4-SN                       00080000
//* BP137663 MRN1 13032019 INCLUDE READING FROM BB24F590 AND INCLUDE    00090000
//*                        BLANK LETTER TYPE                            00100000
//* BP137739 SRG1 02042019 INCREASED THE SAPCE FOR SORT STEP01.         00110000
//* BP137515 MRN1 30042019 ADD STEPS FOR REPORTS DA='Y'                 00120000
//* BP137823 PP11 10052019 ADDED STEP03A TO CHECK WHETHER INCOM RPT2 IS 00130000
//*                        NOT EMPTY THEN SEND REPORT DETAILS TO        00140000
//*                        RECIPIENT.                                   00150000
//* BP139189 PP11 02062022 INCLUDED RECIPIENT EMAIL.                    00160000
//* BP139274 PP11 15092022 INCLUDED RECIPIENT EMAIL.                    00161000
//* BP139305 PP11 20092022 REMOVED RECIPIENT BEE CHENG FONG.            00163000
//* BP13XXXX EL27 03032023 EXPAND STEP02 SPACE.                         00163100
//* BP139572 MRR5 03062023 REMOVED RECIPIENT MAZLINA OTSMAN             00163203
//*                                                                     00164000
//* ============================================================== *    00170000
//*---------------------------------------------------------------------00180000
//* SORT OUT LETTER TYPES 1-4 AND BLANK                                 00190000
//*---------------------------------------------------------------------00200000
//STEP01   EXEC SORT,CYL=30,COND=(0,NE)                                 00210000
//SORTIN   DD DSN=BP13.KB50.LEVY,DISP=SHR                               00220000
//SORTOUT  DD DSN=&&BP13FB50,DISP=(NEW,PASS),                           00230000
//            UNIT=SYSDA,SPACE=(CYL,(20,5),RLSE),                       00240000
//            DCB=(BLKSIZE=27000,LRECL=1000,RECFM=FB)                   00250000
//SYSIN    DD  *                                                        00260000
  SORT FIELDS=(1,17,A),FORMAT=CH                                        00270000
  INCLUDE COND=(39,1,CH,EQ,C'1',OR,                                     00280000
                39,1,CH,EQ,C'2',OR,                                     00290000
                39,1,CH,EQ,C'3',OR,                                     00300000
                39,1,CH,EQ,C'4',OR,                                     00310000
                39,1,CH,EQ,C' ')                                        00320000
//*---------------------------------------------------------------------00330000
//* SORT BB24F590 BY REGNO+NRIC                                         00340000
//*---------------------------------------------------------------------00350000
//STEP02   EXEC SORT,CYL=30,COND=(0,NE)                                 00360000
//SORTIN   DD DSN=BP13.BB24.F590.COLLLEVY.ACCUM,DISP=SHR                00370000
//SORTOUT  DD DSN=&&BB24F590,DISP=(NEW,PASS),                           00380000
//            UNIT=SYSDA,SPACE=(CYL,(20,5),RLSE),                       00390000
//            DCB=(BLKSIZE=27650,LRECL=350,RECFM=FB)                    00400000
//SYSIN    DD  *                                                        00410000
  SORT FIELDS=(81,17,A),FORMAT=CH                                       00420000
//*---------------------------------------------------------------------00430000
//* CREATE REPORT BASED ON BP13FB50                                     00440000
//*---------------------------------------------------------------------00450000
//STEP03   EXEC PGM=BP13CB0G,COND=(0,NE)                                00460000
//BP13FB50 DD DSN=&&BP13FB50,DISP=(OLD,PASS)                            00470000
//BB24F590 DD DSN=&&BB24F590,DISP=(OLD,PASS)                            00480000
//BP13KB20 DD DSN=BP13.KB20.DBSBK,DISP=SHR                              00490000
//BP13KD15 DD DSN=BP13.KD15.DBSSTP,DISP=SHR                             00500000
//BP13KD11 DD DSN=BP13.KD15.DBSSTP.PATH1,DISP=SHR                       00510000
//P04K010  DD DSN=BP04.K010.DEBAR,DISP=SHR                              00520000
//BB24K510 DD DSN=BB24.K510.UINHIST,DISP=SHR                            00530000
//BB24K500 DD DSN=BB24.K500.RESLHIST,DISP=SHR                           00540000
//AB03K080 DD DSN=AB03.K080.UINACC,DISP=SHR                             00550000
//AB03K030 DD DSN=AB03.K030.SALEMAST,DISP=SHR                           00560000
//BP18K300 DD DSN=BP18.K300.MASTER,DISP=SHR                             00570000
//BP18K440 DD DSN=BP18.K440.APLCTN.HIST.TP,DISP=SHR                     00580000
//REPORT1  DD DSN=BP13.LB0G.REPORT1.DP,DISP=OLD                         00590000
//REPORT2A DD DSN=BP13.LB0G.REPORT2A.QN,DISP=OLD                        00600000
//REPORT2B DD DSN=BP13.LB0G.REPORT2B.QN,DISP=OLD                        00610000
//REPORT3  DD DSN=BP13.LB0G.REPORT3.LN,DISP=OLD                         00620000
//REPORT4  DD DSN=BP13.LB0G.REPORT4.SN,DISP=OLD                         00630000
//REPORTB  DD DSN=BP13.LB0G.REPORT.BLANK,DISP=OLD                       00640000
//SYSUDUMP DD SYSOUT=*                                                  00650000
//SYSOUT   DD SYSOUT=*                                                  00660000
//SYSDBOUT DD SYSOUT=*                                                  00670000
//*---------------------------------------------------------------------00680000
//*                                                                     00690000
//*          BP13.REPORT.DEFER.INCOME.RPT2  IF NOT EMPTY                00700000
//*                                                                     00710000
//*---------------------------------------------------------------------00720000
//STEP03A  EXEC PGM=IDCAMS                                              00730000
//SYSPRINT DD SYSOUT=*                                                  00740000
//FILE1 DD DSN=BP13.REPORT.DEFER.INCOME.RPT2,DISP=SHR                   00750000
//SYSUDUMP DD SYSOUT=*                                                  00760000
//SYSIN DD *                                                            00770000
  PRINT INFILE(FILE1) -                                                 00780000
  DUMP COUNT(1)                                                         00790000
  IF LASTCC EQ 4 THEN SET MAXCC=4                                       00800000
/*                                                                      00810000
//*                                                                     00820000
//STARTIF  IF (STEP03A.RC = 0) THEN                                     00830000
//*---------------------------------------------------------------------00840000
//*        : AUTO-GENERATE MAIL HEADER PART I                           00850000
//*          HELO SGPHDBX                                               00860000
//*          MAIL FROM:<XXXXXXXX@SGPHDBX>                               00870000
//* TO SEND BP13.REPORT.DEFER.INCOME.RPT2 GENERATED BY BP13D115 JOB     00880000
//*---------------------------------------------------------------------00890000
//STEP04   EXEC PGM=IRXJCL,PARM='SMTPHDR'                               00900000
//SYSTSPRT DD SYSOUT=*                                                  00910000
//SYSEXEC  DD DSN=SYS3.SYSTEM.CLIST,DISP=SHR                            00920000
//SMTPHDR  DD DSN=&&P13MHDG,DISP=(NEW,PASS),                            00930000
//         SPACE=(TRK,(1,1)),DCB=(DSORG=PS,LRECL=259,RECFM=VB)          00940000
//SYSTSIN  DD DUMMY                                                     00950000
//*---------------------------------------------------------------------00960000
//STEP05   EXEC SAS,COND=(0,NE),OPTIONS='MACRO'                         00970000
//SYSOUT   DD SYSOUT=*                                                  00980000
//MAILNAME DD DSN=&&MAILNAME,DISP=(NEW,PASS),                           00990000
//            UNIT=SYSDA,SPACE=(CYL,(2,1),RLSE),                        01000000
//            DCB=(RECFM=VB,LRECL=259)                                  01010000
//MAILRCPT DD DSN=&&MAILRCPT,DISP=(NEW,PASS),                           01020000
//            UNIT=SYSDA,SPACE=(CYL,(2,1),RLSE),                        01030000
//            DCB=(RECFM=VB,LRECL=259)                                  01040000
//SYSPRINT DD SYSOUT=*                                                  01050000
//SYSIN    DD *                                                         01060000
  DATA _NULL_;                                                          01070000
    FILE MAILNAME;                                                      01080000
    PUT @01 '           FILENAME="BP13LPC2.TXT"';                       01090000
    PUT @01 ' ';                                                        01100000
  RUN;                                                                  01110000
                                                                        01120000
  DATA _NULL_;                                                          01130000
    FILE MAILRCPT;                                                      01140000
    PUT @01 'RCPT TO:<ZANY_CE_LIAW@HDB.GOV.SG>';                        01170000
    PUT @01 'RCPT TO:<FRANCIS_WM_CHEE@HDB.GOV.SG>';                     01180000
    PUT @01 'RCPT TO:<HEE_WAN_MENG@HDB.GOV.SG>';                        01181000
    PUT @01 'DATA';                                                     01190000
    PUT @01 'FROM:SOC SYSTEM - EMAIL ALERT';                            01200000
    PUT @01 'TO:<ZANY_CE_LIAW@HDB.GOV.SG>';                             01230000
    PUT @01 'TO:<FRANCIS_WM_CHEE@HDB.GOV.SG>';                          01240000
    PUT @01 'TO:<HEE_WAN_MENG@HDB.GOV.SG>';                             01241000
    PUT @01 'SUBJECT : MONTHLY REPORT DA=Y WITHOUT PCD NOTIF DATE';     01250000
  RUN;                                                                  01260000
//*---------------------------------------------------------------------01270000
//STEP06   EXEC PGM=IEBGENER,COND=(0,NE)                                01280000
//SYSUT1   DD DSN=*.STEP04.SMTPHDR,DISP=(OLD,DELETE)                    01290000
//         DD DSN=&&MAILRCPT,DISP=(OLD,DELETE)                          01300000
//         DD DSN=AV05.MIME.HEADERS.VB(MIMEHDR),DISP=SHR                01310000
//         DD DSN=AV05.MIME.HEADERS.VB(MPHDR),DISP=SHR                  01320000
//         DD DSN=AV05.MIME.HEADERS.VB(BOUNDARY),DISP=SHR               01330000
//         DD DSN=AV05.MIME.HEADERS.VB(TEXTHDR),DISP=SHR                01340000
//         DD DSN=AV05.MIME.HEADERS.VB(ATCHHDR),DISP=SHR                01350000
//         DD DSN=&&MAILNAME,DISP=(OLD,DELETE)                          01360000
//         DD *                                                         01370000
//         DD DSN=BP13.REPORT.DEFER.INCOME.RPT2,DISP=SHR                01380000
//         DD DSN=AV05.MIME.HEADERS.VB(BOUNDARY),DISP=SHR               01390000
//SYSUT2   DD DSN=BP13.MAILOUT.BP13PCD2,DISP=OLD                        01400000
//SYSPRINT DD SYSOUT=*                                                  01410000
//SYSIN    DD DUMMY                                                     01420000
//*-------------------------------------------------------------------* 01430000
//*  SEND MAINFRAME EMAIL                                             * 01440000
//*-------------------------------------------------------------------* 01450000
//STEP90   EXEC SENDMAIL,COND=(4,LT)                                    01460000
//INPUT    DD DSN=BP13.MAILOUT.BP13PCD2,DISP=SHR                        01470000
/*                                                                      01480000
//STOPIF   ENDIF                                                        01490000
//*                                                                     01500000
