//BP13ADBS  JOB (BP13P),'BP13ADBS',CLASS=I,MSGCLASS=N,                  JOB05330
//    MSGLEVEL=(1,1),NOTIFY=CSD0071                                             
//JOBLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                    
//**************************************************************                
//* THIS JCL IS TO PRINT THE REPORT FOR MCPS IN HDB FLAT > 2KM                  
//*==================================================================           
//* CHG REF  BY   ON       DESCRIPTION                                          
//* -------- ---- -------- -----------                                          
//* BP133323 IL5  220708   HARDCODE NT 'AMK'                                    
//* BP133389 IL5  040808   ADD INPUT FILE BP13KB78 FOR BP13C02N                 
//* BP133424 IL5  101108   HARDCPDE NT 'BH'                                     
//* BP133533 IL5  140409   HARDCODE NT 'TP'                                     
//* BP133533 IL5  170409   HARDCODE NT 'TAP'                                    
//*                        MERGE REPORTS BP13C02M AND BP13C02L                  
//*                        MERGE REPORTS BP13C02N AND BP13C02P                  
//*                        ADD REPORT BP13C02T                                  
//* BP134344 IL5  040112   CHANGE SORT CONDITION IN STEP01                      
//* BP134470 IL5  240412   CHANGE SORT CONDITION IN STEP01                      
//*------------------------------------------------------------------*          
//* STEP 0:-       *   DELETE BACKUP FILES *                                    
//*------------------------------------------------------------------*          
//STEP200  EXEC  PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD *                                                                 
     DEL (BP13.MFMAIL.L02M)                                                     
     DEL (BP13.MFMAIL.L02P)                                                     
     DEL (BP13.MFMAIL.L02Q)                                                     
     DEL (BP13.MFMAIL.L02T)                                                     
     IF MAXCC < 12 THEN                                                         
        SET MAXCC = 0                                                           
/*                                                                              
//*--------------------------------------------------------------------         
//* SORT BY REGN NO                                                             
//* INCLUDE DBSS CASES AND MCPS INELIGBLE DUE TO HDB FLAT > 2KM                 
//*---------------------------------------------------------------------        
//STEP2A   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K730.MATURERQ,DISP=SHR                                   
//SORTOUT  DD DSN=&&P13F730,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            SPACE=(CYL,(60,20),RLSE)                                          
//SYSIN    DD  *                                                                
    SORT FIELDS=(123,8,A,325,9,A),FORMAT=CH                                     
    INCLUDE COND=(123,1,CH,EQ,C'5',AND,                                         
                  334,6,CH,EQ,C'201204',AND,                                    
                  187,2,CH,EQ,C'PR')                                            
//*------------------------------------------------------------------           
//* SORT OUT CASES FROM BP13K730 FILE                                           
//*------------------------------------------------------------------           
//STEP2B   EXEC PGM=BP13C161,COND=(0,NE)                                        
//BP13F500 DD DSN=&&P13F730,DISP=(OLD,DELETE)                                   
//BP13K730 DD DSN=BP13.K730.MATURERQ,DISP=SHR                                   
//BP13F730 DD DSN=&&P13F730,DISP=(,PASS),                                       
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            SPACE=(CYL,(60,20),RLSE)                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*--------------------------------------------------------------------         
//* SORT BY REGN NO                                                             
//* INCLUDE DBSS CASES AND MCPS INELIGBLE DUE TO HDB FLAT > 2KM                 
//*---------------------------------------------------------------------        
//STEP2C   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&P13F730,DISP=(OLD,PASS)                                     
//SORTOUT  DD DSN=&&F730A,DISP=(NEW,PASS),                                      
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            SPACE=(CYL,(60,20),RLSE)                                          
//SYSIN    DD  *                                                                
    SORT FIELDS=(123,8,A,325,9,A),FORMAT=CH                                     
    INCLUDE COND=(253,1,CH,EQ,C'H')                                             
//*---------------------------------------------------------------------        
//*  SORT BP13F725 IN NRIC SEQUENCE AND DROP DUMMY RECORDS                      
//*---------------------------------------------------------------------        
//STEP2D   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F725.MHADATA.ACCUM,DISP=SHR                              
//SORTOUT  DD DSN=&&P13F725,DISP=(NEW,PASS),                                    
//            UNIT=(SYSDA),                                                     
//            DCB=(BLKSIZE=21100,LRECL=211,RECFM=FB),                           
//            SPACE=(CYL,(100,10),RLSE)                                         
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,17,A),FORMAT=CH                                               
   INCLUDE COND=(1,1,CH,EQ,C'5')                                                
   SUM FIELDS=NONE                                                              
//*---------------------------------------------------------------------        
//*  TO PRINT REPORT ON HDB ADDRESS > 2KM                                       
//*  FOR DBSS DEVELOPER - REMOVE MHA POSTAL AND NOT MATCHED CASES               
//*  PROJECT NAME HARDCODED IN PROGRAM                                          
//*---------------------------------------------------------------------        
//STEP2F   EXEC PGM=BP13C02M,COND=(0,NE)                                        
//BP13F730 DD DSN=&&F730A,DISP=(OLD,DELETE)                                     
//BP13F725 DD DSN=&&P13F725,DISP=(OLD,PASS)                                     
//BP13KB78 DD DSN=BP13.KB78.DBSREQ,DISP=SHR                                     
//BP13L02M DD DSN=BP13.MFMAIL.L02M,DISP=(NEW,CATLG),                            
//           LRECL=133,RECFM=FBA,BLKSIZE=0,DATACLAS=MULTIVOL,                   
//           SPACE=(1,(5,5),RLSE),AVGREC=M,DSORG=PS                             
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*--------------------------------------------------------------------         
//* SORT BY REGN NO                                                             
//* INCLUDE DBSS CASES AND MCPS INELIGBLE DUE TO PRIVATE PROPERTY OR            
//* NON-HDB FLAT                                                                
//*---------------------------------------------------------------------        
//STEP2G   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&P13F730,DISP=(OLD,PASS)                                      
//SORTOUT  DD DSN=&&F730B,DISP=(NEW,PASS),                                      
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            SPACE=(CYL,(60,20),RLSE)                                          
//SYSIN    DD  *                                                                
    SORT FIELDS=(123,8,A,325,9,A),FORMAT=CH                                     
    INCLUDE COND=(253,1,CH,EQ,C'P')                                             
/*                                                                              
//*---------------------------------------------------------------------        
//*  TO PRINT REPORT ON NON-HDB ADDRESS FOR MANUAL PROCESS                      
//*  FOR DBSS DEVELOPER - REMOVE MHA POSTAL AND NOT MATCHED CASES               
//*---------------------------------------------------------------------        
//STEP2I   EXEC PGM=BP13C02P,COND=(0,NE)                                        
//BP13F730 DD DSN=&&F730B,DISP=(OLD,DELETE)                                     
//BP13F725 DD DSN=&&P13F725,DISP=(OLD,PASS)                                     
//BP13KB78 DD DSN=BP13.KB78.DBSREQ,DISP=SHR                                     
//BP13L02P DD DSN=BP13.MFMAIL.L02P,DISP=(NEW,CATLG),                            
//           LRECL=133,RECFM=FBA,BLKSIZE=0,DATACLAS=MULTIVOL,                   
//           SPACE=(1,(5,5),RLSE),AVGREC=M,DSORG=PS                             
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*---------------------------------------------------------------------        
//*  TO PRINT REPORT ON INELIGIBLE TCP CASES FOR DBSS                           
//*---------------------------------------------------------------------        
//STEP2L   EXEC SORT,COND=(0,NE)                                                
//SORTIN  DD DSN=&&P13F730,DISP=(OLD,PASS)                                      
//SORTOUT DD DSN=&&F730C,DISP=(NEW,PASS),                                       
//           UNIT=SYSDA,SPACE=(CYL,(5,2),RLSE),                                 
//           DCB=(RECFM=FB,LRECL=500,BLKSIZE=0)                                 
//SYSIN   DD  *                                                                 
   SORT FIELDS=(123,8,A),FORMAT=CH                                              
   INCLUDE COND=(123,1,CH,EQ,C'5',AND,                                          
                 213,3,CH,EQ,C'TCP')                                            
//*------------------------------------------------------------------           
//* SORT OUT CASES FROM BP13K730 FILE                                           
//*------------------------------------------------------------------           
//STEP2M   EXEC PGM=BP13C161,COND=(0,NE)                                        
//BP13F500 DD DSN=&&F730C,DISP=(OLD,DELETE)                                     
//BP13K730 DD DSN=BP13.K730.MATURERQ,DISP=SHR                                   
//BP13F730 DD DSN=&&F730,DISP=(,PASS),                                          
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            SPACE=(CYL,(60,20),RLSE)                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//*  JCL TO RUN PROGRAM BP13L02Q - TCP REPORT                                   
//*---------------------------------------------------------------------        
//STEP2N   EXEC PGM=BP13C02Q,COND=(0,NE)                                        
//BP13F730 DD DSN=&&F730,DISP=(OLD,DELETE)                                      
//BP13K825 DD DSN=BP13.K825.REQOCCP,DISP=SHR                                    
//BP13KB78 DD DSN=BP13.KB78.DBSREQ,DISP=SHR                                     
//BP13K060 DD DSN=BP13.K060.CODETAB,DISP=SHR                                    
//BP13L02Q DD DSN=BP13.MFMAIL.L02Q,DISP=(NEW,CATLG),                            
//           LRECL=133,RECFM=FBA,BLKSIZE=0,DATACLAS=MULTIVOL,                   
//           SPACE=(1,(5,5),RLSE),AVGREC=M,DSORG=PS                             
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*---------------------------------------------------------------------        
//*  JCL TO RUN PROGRAM BP13L02T - COMPARISON ON MCPS TAG                       
//*---------------------------------------------------------------------        
//STEP2O   EXEC PGM=BP13C02T,COND=(0,NE)                                        
//BP13F730 DD DSN=&&P13F730,DISP=(OLD,DELETE)                                   
//BP13KB20 DD DSN=BP13.KB20.DBSBK,DISP=SHR                                      
//BP13L02T DD DSN=BP13.MFMAIL.L02T,DISP=(NEW,CATLG),                            
//           LRECL=133,RECFM=FBA,BLKSIZE=0,DATACLAS=MULTIVOL,                   
//           SPACE=(1,(5,5),RLSE),AVGREC=M,DSORG=PS                             
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*---------------------------------------------------------------------        
//* END BP13ADBS                                                                
//*---------------------------------------------------------------------        
