//BP13A22B JOB (BP13P),'BP13A22B',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//             NOTIFY=CSD0071                                                   
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//*=====================================================================        
//* FOR LAUNCH OF SBF FLAT                                                      
//* CREATE BP13K23F TO KEEP UNIT WITH LOWEST SELLING PRICE BY                   
//* NT/FT/ETHNIC/DESIGN (STANDARD OR PREMIUM)                                   
//*      : 1) RUN FOR STANDARD/PREMIUM                                          
//*      : 2) RUN FOR ANY DESIGN TYPE                                           
//*=====================================================================        
//* NOTE : HARDCODE DTE-BALLOT FOR THE LAUNCH = 201209                          
//*=====================================================================        
//* CHG REF  BY   DATE       DESCRIPTION                                        
//*---------------------------------------------------------------------        
//* BP134653 ESA1 20120918  NEW JOB                                             
//*=====================================================================        
//*--------------------------------------------------------------------         
//*      VERIFY FILES BEFORE DAILY PRODUCTION RUN                               
//*--------------------------------------------------------------------         
//STEP00  EXEC PGM=IDCAMS,COND=(0,NE)                                           
//INPUT1   DD DSN=BP13.K23F.SPLOOKUP,DISP=OLD                                   
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN   DD *                                                                  
          VFY FILE(INPUT1)                                                      
//*-------------------------------------------------------------------*         
//*  REPRO VSAM FILE TO SEQUENTIAL FILES                              *         
//*-------------------------------------------------------------------*         
//STEP0A   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.K23F.SPLOOKUP,DISP=SHR,                                  
//            AMP=('BUFND=23')                                                  
//OUTPUT1  DD DSN=BP13.F23F.SPLOOKUP.BKUP(+1),DISP=(NEW,CATLG),                 
//            SPACE=(CYL,(10,8)),                                               
//            DCB=(BP13.GDG,BLKSIZE=0,LRECL=150,RECFM=FB)                       
//*                                                                             
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
//*                                                                             
//*---------------------------------------------------------------------        
//* DEFINE BP13K23F                                                             
//*---------------------------------------------------------------------        
//STEP01 EXEC    PGM=IDCAMS,COND=(0,NE)                                         
//INPUT   DD  DSN=BP13.BLANK.CHAR150,                                           
//             DISP=SHR                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  *                                                                
  DEL 'BP13.K23F.SPLOOKUP' CLUSTER PURGE                                        
  DEF CLUSTER                                         -                         
        (NAME(BP13.K23F.SPLOOKUP)                     -                         
        SHAREOPTIONS(2,3)                             -                         
        KEYS(55 0)                                    -                         
        CYL (3 6)                                   -                           
        RECSZ(150 150)                                -                         
        FREESPACE(10 10)                              -                         
        CISZ(4096)                                    -                         
        STORCLAS(PRODRLS)                             -                         
        LOG(NONE)                                      -                        
        IXD                                           -                         
        UNQ)                                          -                         
      DATA                                            -                         
        (NAME(BP13.K23F.SPLOOKUP.DATA))             -                           
      INDEX                                           -                         
        (NAME(BP13.K23F.SPLOOKUP.INDEX))                                        
         IF LASTCC = 0 THEN               -                                     
           REPRO IFILE(INPUT)             -                                     
                 ODS(BP13.K23F.SPLOOKUP)                                        
/*                                                                              
//*---------------------------------------------------------------------        
//* SORT BP13K240 ACCORDING TO SEARCH CRITERIA (NT/FT/ETHNIC/DESIGN)            
//*---------------------------------------------------------------------        
//STEP02 EXEC    SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=BP13.K240.HEADFLAT,DISP=SHR                                  
//SORTOUT  DD  DSN=&&BP13F240,DISP=(NEW,PASS),                                  
//             UNIT=SYSDA,SPACE=(CYL,(10,5),RLSE),                              
//             DCB=(RECFM=FB,LRECL=450)                                         
//SYSIN    DD  *                                                                
     SORT FIELDS=(131,3,A,144,20,A,117,6,A,164,9,A,173,4,A,                     
                  177,5,A),FORMAT=CH                                            
     INCLUDE COND=(5,2,CH,EQ,C'01',AND,117,6,CH,EQ,C'201209')                   
//*---------------------------------------------------------------------        
//* FORMAT BP13F240 DESIGN ( STANDARD/PREMIUM )                                 
//*-------------------------------------------------------------------*         
//STEP03   EXEC PGM=BP13C2W1,COND=(0,NE)                                        
//BP13F240 DD DSN=&&BP13F240,DISP=(OLD,PASS)                                    
//BP13F24A DD  DSN=&&BP13F24A,DISP=(NEW,PASS),                                  
//             UNIT=SYSDA,SPACE=(CYL,(10,5),RLSE),                              
//             DCB=(RECFM=FB,LRECL=450)                                         
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* SORT BP13F24A ACCORDING TO SEARCH CRITERIA (NT/FT/ETHNIC/DESIGN)            
//*---------------------------------------------------------------------        
//STEP04 EXEC    SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=&&BP13F24A,DISP=(OLD,PASS)                                   
//SORTOUT  DD  DSN=&&BP13F24B,DISP=(NEW,PASS),                                  
//             UNIT=SYSDA,SPACE=(CYL,(10,5),RLSE),                              
//             DCB=(RECFM=FB,LRECL=450)                                         
//SYSIN    DD  *                                                                
     SORT FIELDS=(131,3,A,144,20,A,117,6,A,164,9,A,173,4,A,                     
                  177,5,A),FORMAT=CH                                            
//*-------------------------------------------------------------------*         
//* FORMAT BP13F23F FOR NT/FT/ETHNIC/DESIGN                                     
//*-------------------------------------------------------------------*         
//STEP05   EXEC PGM=BP13C23W,COND=(0,NE)                                        
//BP13F240 DD DSN=&&BP13F24B,DISP=(OLD,PASS)                                    
//BP13F23F DD DSN=&&BP13F23F,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(10,5),RLSE),                               
//            DCB=(RECFM=FB,LRECL=150)                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//*  SORT BP13K230 ACCORDING TO SEARCH CRITERIA, OMIT NO PRICE UNIT             
//*---------------------------------------------------------------------        
//STEP06 EXEC    SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=BP13.K230.FLATLIST,DISP=SHR                                  
//SORTOUT  DD  DSN=&&BP13F230,DISP=(NEW,PASS),                                  
//             UNIT=SYSDA,SPACE=(CYL,(10,5),RLSE),                              
//             DCB=(RECFM=FB,LRECL=450)                                         
//SYSIN    DD  *                                                                
     SORT FIELDS=(131,3,A,144,20,A,117,6,A,164,9,A,173,4,A,239,4,A,             
                  358,8,A),FORMAT=CH                                            
     OMIT COND=(358,8,CH,EQ,C'99999999',OR,                                     
                358,8,CH,EQ,C'00000000',OR,                                     
                358,8,CH,EQ,C'        ',OR,                                     
                358,8,CH,EQ,C'09999999',OR,                                     
                358,8,CH,EQ,C'00999999')                                        
//*---------------------------------------------------------------------        
//* SORT BP13F230 ACCORDING TO SEARCH CRITERIA                                  
//*---------------------------------------------------------------------        
//STEP07 EXEC    SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=&&BP13F230,DISP=(OLD,PASS)                                   
//SORTOUT  DD  DSN=&&BP13F23A,DISP=(NEW,PASS),                                  
//             UNIT=SYSDA,SPACE=(CYL,(10,5),RLSE),                              
//             DCB=(RECFM=FB,LRECL=450)                                         
//SYSIN    DD  *                                                                
     SORT FIELDS=(131,3,A,144,20,A,117,6,A,164,9,A,173,4,A,239,4,A,             
                  358,8,A),FORMAT=CH                                            
     INCLUDE COND=(117,6,CH,EQ,C'201209')                                       
//*-------------------------------------------------------------------*         
//* FORMAT BP13F240 DESIGN ( STANDARD/PREMIUM )                                 
//*-------------------------------------------------------------------*         
//STEP08   EXEC PGM=BP13C2W1,COND=(0,NE)                                        
//BP13F240 DD DSN=&&BP13F23A,DISP=(OLD,PASS)                                    
//BP13F24A DD DSN=&&BP13F23B,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(10,5),RLSE),                               
//            DCB=(RECFM=FB,LRECL=450)                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* SORT BP13F23B ACCORDING TO SEARCH CRITERIA (NT/FT/ETHNIC/DESIGN)            
//*---------------------------------------------------------------------        
//STEP09 EXEC    SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=&&BP13F23B,DISP=(OLD,PASS)                                   
//SORTOUT  DD  DSN=&&BP13F23C,DISP=(NEW,PASS),                                  
//             UNIT=SYSDA,SPACE=(CYL,(10,5),RLSE),                              
//             DCB=(RECFM=FB,LRECL=450)                                         
//SYSIN    DD  *                                                                
     SORT FIELDS=(131,3,A,144,20,A,117,6,A,164,9,A,173,4,A,358,8,A),            
                  FORMAT=CH                                                     
//*---------------------------------------------------------------------        
//* SORT BP13F23F WITHOUT ANY (PREMIUM OR STANDARD)                             
//*---------------------------------------------------------------------        
//STEP10 EXEC    SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=&&BP13F23F,DISP=(OLD,PASS)                                   
//SORTOUT  DD  DSN=&&F23FALL,DISP=(NEW,PASS),                                   
//             UNIT=SYSDA,SPACE=(CYL,(10,5),RLSE),                              
//             DCB=(RECFM=FB,LRECL=150)                                         
//SYSIN    DD  *                                                                
     SORT FIELDS=(1,55,A),FORMAT=CH                                             
     OMIT COND=(39,4,CH,EQ,C'ANY ')                                             
//*-------------------------------------------------------------------*         
//* GET UNIT WITH LOWER SELLING FOR NT/FT/ETHNIC/DESIGN(STD/PREM)               
//*-------------------------------------------------------------------*         
//STEP11   EXEC PGM=BP13C23X,COND=(0,NE)                                        
//BP13F230 DD DSN=&&BP13F23C,DISP=(OLD,PASS)                                    
//BP13F23F DD DSN=&&F23FALL,DISP=(OLD,PASS)                                     
//BP13K23F DD DSN=BP13.K23F.SPLOOKUP,DISP=SHR                                   
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* SORT BP13F23F TO INCLUDE 'ANY' ONLY                                         
//*---------------------------------------------------------------------        
//STEP12 EXEC    SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=&&BP13F23F,DISP=(OLD,PASS)                                   
//SORTOUT  DD  DSN=&&F23FANY,DISP=(NEW,PASS),                                   
//             UNIT=SYSDA,SPACE=(CYL,(10,5),RLSE),                              
//             DCB=(RECFM=FB,LRECL=150)                                         
//SYSIN    DD  *                                                                
     SORT FIELDS=(1,55,A),FORMAT=CH                                             
     INCLUDE COND=(39,4,CH,EQ,C'ANY ')                                          
//*---------------------------------------------------------------------        
//* DO NOT SORT BP13F230 BY DESIGN TYPE (ANY TYPE)                              
//*---------------------------------------------------------------------        
//STEP13 EXEC    SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=&&BP13F23C,DISP=(OLD,PASS)                                   
//SORTOUT  DD  DSN=&&BP13F23D,DISP=(NEW,PASS),                                  
//             UNIT=SYSDA,SPACE=(CYL,(10,5),RLSE),                              
//             DCB=(RECFM=FB,LRECL=450)                                         
//SYSIN    DD  *                                                                
     SORT FIELDS=(131,3,A,144,20,A,117,6,A,164,9,A,358,8,A),FORMAT=CH           
//*-------------------------------------------------------------------*         
//* GET UNIT WITH LOWER SELLING FOR NT/FT/ETHNIC/DESIGN(ANY)                    
//*-------------------------------------------------------------------*         
//STEP14   EXEC PGM=BP13C23Y,COND=(0,NE)                                        
//BP13F230 DD DSN=&&BP13F23D,DISP=(OLD,PASS)                                    
//BP13F23F DD DSN=&&F23FANY,DISP=(OLD,PASS)                                     
//BP13K23F DD DSN=BP13.K23F.SPLOOKUP,DISP=SHR                                   
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
