//BP13D122 JOB (BP13P),'BP13D122',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//         NOTIFY=CSD0071                                                       
//JOBLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                    
//*=================================================================            
//* DAILY PROCESS GRANT RECOVERY POSTING, AFTER CPFB RETURN                     
//*=================================================================            
//* BP137965 LSB  17092019 - NEW JOB                                            
//* BP137503 SRG1 23102019 - INCLUDED FILES FOR EC REPORTS                      
//* BP138045 SRG1 01112019 - INCLUDED A STEP TO UPDATE KD05                     
//* BP138045 PP11 05112019 - INCLUDED FILE FOR NO EC REPORT                     
//* BP138095 KR13 29112019 - ADD EHG IN STEP05 SORT                             
//* BP138100 PP11 02012020 - INCLUDED FILE FOR REJEC PRD                        
//* BP138176 PP11 20022020 - INCLUDED FILE FOR MANUAL PRD                       
//* BP138100 PP11 01042020 - INCLUDED FILE FOR PARTIAL PRD                      
//* BP138231 PP11 10012023 - ADDED HGT REG SRG PHG TUG ATG FSG AND              
//*                          INCLUDED FILE FOR PARTIAL AND FULL NON EC          
//*=================================================================            
//PRT01    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAALAG CP-1',END;                                      
1$DJDE$ JDE=BP13D,JDL=BP13,END;                                                 
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALAG                                     
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID),DEST=IOM2                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*--------------------------------------------------------------------         
//* SORT RECORDS IN REGN SEQUENCE                                               
//*---------------------------------------------------------------------        
//STEP01   EXEC  SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=BP13.AB02.F945.SOC.DAILY,DISP=SHR                            
//SORTOUT  DD  DSN=&&AB02F945,                                                  
//             DISP=(,PASS),                                                    
//             UNIT=(SYSDA,1),                                                  
//             SPACE=(CYL,(10,5),RLSE),                                         
//             DCB=(RECFM=FB,LRECL=300,BLKSIZE=0)                               
//SYSIN    DD  *                                                                
        SORT FIELDS=(40,8,A,2,9,A),FORMAT=CH                                    
/*                                                                              
//*-----------------------------------------------------------------            
//* UPDATE BP13K736 FOR THOSE CASES THAT ARE MATCHED FROM CPF                   
//*-----------------------------------------------------------------            
//STEP02 EXEC PGM=BP13CB3G,COND=(0,NE)                                          
//AB02F945 DD DSN=&&AB02F945,DISP=(OLD,PASS)                                    
//BP13K736 DD DSN=BP13.K736.CPFENQ,DISP=SHR                                     
//BP13L94A DD DSN=BP13.AB02.L945.GRNT.REJT,DISP=OLD                             
//BP13L94B DD DSN=BP13.AB02.L945.GRNT.PART,DISP=OLD                             
//BP13L94C DD DSN=BP13.AB02.L945.GRNT.MANL,DISP=OLD                             
//BP13L94D DD DSN=BP13.AB02.L945.GRNT.REJTEC,DISP=OLD                           
//BP13L94E DD DSN=BP13.AB02.L945.GRNT.PARTEC,DISP=OLD                           
//BP13L94F DD DSN=BP13.AB02.L945.GRNT.MANLEC,DISP=OLD                           
//BP13L94G DD DSN=BP13.AB02.L945.GRNT.FULLEC,DISP=OLD                           
//BP13L94H DD DSN=BP13.AB02.L945.GRNT.FULLNOEC,DISP=OLD                         
//BP13L94I DD DSN=BP13.AB02.L945.GRNT.REJCEC.PRD,DISP=OLD                       
//BP13L94J DD DSN=BP13.AB02.L945.GRNT.MANL.PRD,DISP=OLD                         
//BP13L94K DD DSN=BP13.AB02.L945.GRNT.PART.PRD,DISP=OLD                         
//BP13L94L DD DSN=BP13.AB02.L945.GRNT.FULLNOEC.PRD,DISP=OLD                     
//BP13L94M DD DSN=BP13.AB02.L945.GRNT.REJCNOEC.PRD,DISP=OLD                     
//BP13FPRC DD DSN=BP13.F736.GRNT.PROCSED,DISP=OLD                               
//BP13MAIL DD DSN=BP13.GRANT.MAIL,DISP=OLD                                      
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*-------------------------------------------------------------------*         
//STEP03   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F736.GRNT.PROCSED,DISP=SHR                               
//SORTOUT  DD DSN=&&BP13F736,DISP=(NEW,PASS),                                   
//         UNIT=(SYSDA,1),                                                      
//         DCB=(LRECL=1000,BLKSIZE=27000,RECFM=FB),                             
//         SPACE=(CYL,(30,10),RLSE)                                             
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,17,A),FORMAT=CH                                               
//*-----------------------------------------------------------------            
//* OUTPUT GL FILE BP13F180                                                     
//* OUTPUT COLL SYSTEM PAYMENT FILE FORMAT FOR UPDATE GRANT TABLE               
//*-----------------------------------------------------------------            
//STEP04   EXEC PGM=BP13CZ3D,COND=(0,NE)                                02460000
//BP13F736 DD DSN=&&BP13F736,DISP=(OLD,PASS)                            02470000
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                               02480000
//BP13F180 DD DSN=BP13.F180.GLTRAN.GRANT,DISP=OLD                       02510000
//AC28F526 DD DSN=BP13.AC28.F526.GRANT,DISP=OLD                         02510000
//BP13LZ3D DD DSN=BP13.LZ3D.BP13CZ3D,DISP=OLD                           02520000
//SYSOUT   DD SYSOUT=*                                                  02530000
//SYSTSPRT DD SYSOUT=*                                                  02540000
//SYSPRINT DD SYSOUT=*                                                  02550000
//SYSDBG   DD SYSOUT=*                                                  02560000
//SYSDBOUT DD SYSOUT=*                                                  02570000
//SYSTSIN  DD *                                                         02580000
/*                                                                              
//*-------------------------------------------------------------------*         
//* CASH PAYMENT FROM COLLECTION SYSTEM FOR SRG, SUG, AHG/SHG RECOVERY*         
//*-------------------------------------------------------------------*         
//STEP05   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.AC28.F526.GRANT,DISP=SHR                                 
//SORTOUT  DD DSN=BP13.AC28.F526.SRG.RECVRY,DISP=OLD                            
//SYSIN    DD *                                                                 
  SORT FIELDS=(113,8,A,91,5,A,27,14,A),FORMAT=CH                                
  INCLUDE COND=(91,5,CH,EQ,C'AHG  ',OR,                                         
                91,5,CH,EQ,C'INT  ',OR,                                         
                91,5,CH,EQ,C'SHG  ',OR,                                         
                91,5,CH,EQ,C'SRG  ',OR,                                         
                91,5,CH,EQ,C'SUG  ',OR,                                         
                91,5,CH,EQ,C'EHG  ',OR,                                         
                91,5,CH,EQ,C'HGT  ',OR,                                         
                91,5,CH,EQ,C'REG  ',OR,                                         
                91,5,CH,EQ,C'PHG  ',OR,                                         
                91,5,CH,EQ,C'TUG  ',OR,                                         
                91,5,CH,EQ,C'ATG  ',OR,                                         
                91,5,CH,EQ,C'FSG  ')                                            
/*                                                                              
//*-------------------------------------------------------------------*         
//* PROCESS RECOVERY FROM COLLECTION SYSTEM                           *         
//*-------------------------------------------------------------------*         
//STEP06   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K               
//AC28F526 DD DSN=BP13.AC28.F526.SRG.RECVRY,DISP=SHR                            
//BP13K130 DD DSN=BP13.K130.SOCHIST,DISP=SHR                                    
//BP13F52A DD DSN=BP13.AC28.F52A.MISMTH.SRGREC,DISP=OLD                         
//BP13LB0E DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13CB0E) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
/*                                                                              
//*-------------------------------------------------------------------*         
//* UPDATE KD05 FROM RECOVERY FILE                                    *         
//*-------------------------------------------------------------------*         
//STEP06A  EXEC PGM=BP13CB3H,COND=(0,NE)                                02460000
//AC28F526 DD DSN=BP13.AC28.F526.SRG.RECVRY,DISP=SHR                    02510000
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13KD05 DD DSN=BP13.KD05.CPFGRANT,DISP=SHR,                                  
//            AMP=('BUFNI=4','BUFND=8')                                         
//SYSOUT   DD SYSOUT=*                                                  02530000
//SYSTSPRT DD SYSOUT=*                                                  02540000
//SYSPRINT DD SYSOUT=*                                                  02550000
//SYSDBG   DD SYSOUT=*                                                  02560000
//SYSDBOUT DD SYSOUT=*                                                  02570000
//SYSTSIN  DD *                                                         02580000
/*                                                                              
//*-------------------------------------------------------------------- 02590000
//* SORT BP13F180 IN GL DESCRIPTION ORDER                               02600000
//*-------------------------------------------------------------------- 02610000
//STEP07   EXEC SORT,COND=(0,NE)                                        02620000
//SORTIN   DD DSN=BP13.F180.GLTRAN.GRANT,DISP=SHR                       02630000
//SORTOUT  DD DSN=&&F180GNT,DISP=(NEW,PASS),                            02650000
//            UNIT=SYSDA,SPACE=(CYL,(20,5),RLSE),                       02660000
//            DCB=(BLKSIZE=0,LRECL=120,RECFM=FB)                        02670000
//SYSOUT   DD SYSOUT=*                                                  02680000
//SYSPRINT DD SYSOUT=*                                                  02690000
//SYSIN    DD   *                                                       02700000
   SORT FIELDS=(58,40,A),FORMAT=CH                                      02710000
   INCLUDE COND=(1,2,CH,EQ,C'SG')                                       02720000
/*                                                                              
//*-------------------------------------------------------------------- 02730000
//* SUM DETAIL GL TRAN RECORD TO GL SYSTEM FOR SA                       02740000
//*-------------------------------------------------------------------- 02750000
//STEP08   EXEC PGM=BP13C109,COND=(0,NE)                                02760000
//BP13F180 DD DSN=&&F180GNT,DISP=(OLD,PASS)                             02770000
//AG20F900 DD DSN=BP13.F190.AASUM.GRANT,DISP=OLD                        02780000
//SYSPRINT DD SYSOUT=*                                                  02790000
//SYSOUT   DD SYSOUT=*                                                  02800000
//SYSDBG   DD SYSOUT=*                                                  02810000
//SYSDBOUT DD SYSOUT=*                                                  02820000
//*-----------------------------------------------------------------            
//* BACKUP ALL REQUIRED FILES( GL, RETRUN CPFB, PROCESSED)                      
//*-----------------------------------------------------------------            
//STEP09    EXEC PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT  DD SYSOUT=*                                                         
//INPUT1    DD DSN=BP13.F180.GLTRAN.GRANT,DISP=SHR                              
//OUTPUT1   DD DSN=BP13.F180.GLTRAN.GRTBKUP(+1),                                
//          DISP=(NEW,CATLG),                                                   
//          SPACE=(CYL,(10,5)),                                                 
//          DCB=(BP13.GDG,BLKSIZE=27960,LRECL=120,RECFM=FB)                     
//INPUT2    DD DSN=BP13.F190.AASUM.GRANT,DISP=SHR                               
//OUTPUT2   DD DSN=BP13.F190.AASUM.GRTBKUP(+1),                                 
//          DISP=(NEW,CATLG),                                                   
//          SPACE=(CYL,(10,5)),                                                 
//          DCB=(BP13.GDG,BLKSIZE=27960,LRECL=120,RECFM=FB)                     
//INPUT3    DD DSN=BP13.AB02.F945.SOC.DAILY,DISP=SHR                            
//OUTPUT3   DD DSN=BP13.AB02.F945.SOC.BKUP(+1),                                 
//          DISP=(NEW,CATLG),                                                   
//          SPACE=(CYL,(10,5)),                                                 
//          DCB=(BP13.GDG,BLKSIZE=27900,LRECL=300,RECFM=FB)                     
//INPUT4    DD DSN=BP13.F736.GRNT.PROCSED,DISP=SHR                              
//OUTPUT4   DD DSN=BP13.F736.GRNT.PROCSED.BKUP(+1),                             
//          DISP=(NEW,CATLG),                                                   
//          SPACE=(CYL,(10,5)),                                                 
//          DCB=(BP13.GDG,BLKSIZE=28000,LRECL=1000,RECFM=FB)                    
//SYSIN     DD  *                                                               
     REPRO INFILE(INPUT1) OUTFILE(OUTPUT1)                                      
     REPRO INFILE(INPUT2) OUTFILE(OUTPUT2)                                      
     REPRO INFILE(INPUT3) OUTFILE(OUTPUT3)                                      
     REPRO INFILE(INPUT4) OUTFILE(OUTPUT4)                                      
/*                                                                              
//*-------------------------------------------------------------------*         
//* SENDMAIL                                                                    
//*-------------------------------------------------------------------*         
//STEP10   EXEC SENDMAIL,COND=(0,NE)                                            
//INPUT    DD DSN=BP13.GRANT.MAIL,DISP=SHR                                      
/*                                                                              
//*-----------------------------------------------------------------            
//*  SEND MAINFRAME EMAIL (BP13LZ3D)                                            
//*-----------------------------------------------------------------            
//STEP11   EXEC SENDMAIL,COND=(4,LT)                                            
//INPUT    DD DSN=BP13.LZ3D.BP13CZ3D,DISP=SHR                                   
/*                                                                              
//*-----------------------------------------------------------------            
//* EMPTY AB02 FILES                                                  *         
//*-------------------------------------------------------------------*         
//STEP12   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DUMMY                                                             
//OUTPUT1  DD DSN=BP13.F736.GRNT.PROCSED,DISP=OLD                               
//OUTPUT2  DD DSN=BP13.AB02.F945.SOC.DAILY,DISP=OLD                             
//SYSIN    DD *                                                                 
        REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                  
        REPRO INFILE(INPUT1)  OUTFILE(OUTPUT2)                                  
/*                                                                              
//*-------------------------------------------------------------------*         
//* DELETE GRANT RECOVERD RECORDS FROM K736 AND BACKUP                *         
//*-------------------------------------------------------------------*         
//STEP13   EXEC PGM=BP13CB3K,COND=(0,NE)                                02460000
//BP13K736 DD DSN=BP13.K736.CPFENQ,DISP=SHR                                     
//BP13FBCK DD DSN=BP13.F736.CPFENQ.ARCHIVE,DISP=MOD                             
//SYSOUT   DD SYSOUT=*                                                  02530000
//SYSTSPRT DD SYSOUT=*                                                  02540000
//SYSPRINT DD SYSOUT=*                                                  02550000
