//BP13D53D JOB (BP13P),'BP13D53D',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),    00010000
//         NOTIFY=CSD0071                                               00020000
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                           00030000
//**************************************************************        00040000
//*      SENDING EMAIL TO BOOKING CASES FOR THE DAY                     00050000
//**************************************************************        00060000
//* CHG REF  BY  ON        DESCRIPTION                                  00070000
//* -------- --- ------    -----------                                  00080000
//* BP138787 PP1120210618  NEW JCL. FOR SENDING EMAIL                   00090000
//* BP138814 PP1120210727  SENDING EMAIL FOR TP CASES                   00100000
//* BP138943 PP1120211101  BACKUP OF DAILY BK AND TP CASES              00110000
//* BP139038 PP1120220302  CATER TO PULL TP CASES FROM K410 ACCUMSO FILE00111000
//* BP139038 PP1120220302  CATER TO PULL TP CASES FROM K400 FILE        00112000
//*-------------------------------------------------------------------* 00120000
//*-------------------------------------------------------------------* 00130000
//*  SORT OUT ALL THE BOOKING CASES                                     00140000
//*-------------------------------------------------------------------- 00150000
//STEP01 EXEC PGM=SORT                                                  00160000
//SYSPRINT DD SYSOUT=*                                                  00170000
//SYSOUT DD SYSOUT=*                                                    00180000
//SORTIN DD DSN=BP13.K800.APPLN,DISP=SHR                                00190000
//SORTOUT  DD DSN=&&F800BK,DISP=(NEW,PASS),                             00200000
//         UNIT=SYSDA,DCB=(RECFM=FB,LRECL=2000),                        00210000
//         SPACE=(CYL,(8,5),RLSE)                                       00220000
//SYSIN DD *                                                            00230000
    SORT FIELDS=COPY                                                    00240000
    INCLUDE COND=(1352,8,CH,EQ,DATE1)                                   00250000
/*                                                                      00260000
//*                                                                     00270000
//STEP02 EXEC PGM=BP13CFB2                                              00280000
//SYSPRINT DD SYSOUT=*                                                  00290000
//SYSOUT DD SYSOUT=*                                                    00300000
//BP13F800 DD DSN=&&F800BK,DISP=(SHR,PASS)                              00310000
//BP13K857 DD DSN=BP13.K857.EMAIL,DISP=SHR                              00320000
//BP13F23A DD DSN=BP13.F23A.EMAIL.BK,DISP=SHR                           00330000
//*                                                                     00340000
//*-------------------------------------------------------------------* 00350000
//* DAILY DATA APPENDED INTO MONTH FILE FOR BK                          00360000
//*-------------------------------------------------------------------* 00370000
//STEP02A  EXEC PGM=IDCAMS,COND=(0,NE)                                  00380000
//SYSPRINT DD SYSOUT=*                                                  00390000
//INPUT1   DD DSN=BP13.F23A.EMAIL.BK,DISP=SHR                           00400000
//OUTPUT1  DD DSN=BP13.F23A.EMAIL.BK.MONTH,DISP=MOD                     00410000
//SYSIN    DD *                                                         00420000
        REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                          00430000
//*                                                                     00440000
//*-------------------------------------------------------------------* 00450000
//*  SPLIT 'BK' CASES INTO 2 PARTS                                      00460000
//*-------------------------------------------------------------------- 00470000
//STEP03   EXEC SORT,COND=(0,NE)                                        00480000
//SORTIN   DD DSN=BP13.F23A.EMAIL.BK,DISP=SHR                           00490000
//OUT1     DD DSN=&&F23ABK1,DISP=(NEW,PASS),                            00500000
//         UNIT=SYSDA,DCB=(RECFM=FB,LRECL=200),                         00510000
//         SPACE=(CYL,(8,5),RLSE)                                       00520000
//OUT2     DD DSN=&&F23ABK2,DISP=(NEW,PASS),                            00530000
//         UNIT=SYSDA,DCB=(RECFM=FB,LRECL=200),                         00540000
//         SPACE=(CYL,(8,5),RLSE)                                       00550000
//SYSIN    DD  *                                                        00560000
   OPTION COPY                                                          00570000
   OUTFIL FNAMES=(OUT1,OUT2),SPLIT1R=2000                               00580000
//*--------------------------------------------------------------------*00590000
//* STEP04:  RUN PROGRAM TO CREATE NOTIFICATION MESSAGE TO SEND        *00600000
//*          TO THE MESSAGE QUEUE (BY EMAIL)                           *00610000
//*          APPT TYPE = (BK)                                          *00620000
//*--------------------------------------------------------------------*00630000
//STEP04   EXEC MQBATCH,NAME=BP13CS06,COND=(0,NE)                       00640000
//STEPLIB  DD                                                           00650000
//         DD                                                           00660000
//         DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                           00670000
//BP13F23A DD DSN=&&F23ABK1,DISP=(SHR,PASS)                             00680000
//SYSDBG   DD  SYSOUT=*                                                 00690000
//SYSOUT   DD  SYSOUT=*                                                 00700000
//SYSDBOUT DD  SYSOUT=*                                                 00710000
//SYSABOUT DD  SYSOUT=*                                                 00720000
//SYSPRINT DD  SYSOUT=*                                                 00730000
//SYSIN    DD  DSN=MQSERIES.ALIAS.QMGR,DISP=SHR                         00740000
/*                                                                      00750000
//*--------------------------------------------------------------------*00760000
//* STEP05:  RUN PROGRAM TO CREATE NOTIFICATION MESSAGE TO SEND        *00770000
//*          TO THE MESSAGE QUEUE (BY EMAIL)                           *00780000
//*          APPT TYPE = (BK)                                          *00790000
//*--------------------------------------------------------------------*00800000
//STEP05   EXEC MQBATCH,NAME=BP13CS06,COND=(0,NE)                       00810000
//STEPLIB  DD                                                           00820000
//         DD                                                           00830000
//         DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                           00840000
//BP13F23A DD DSN=&&F23ABK2,DISP=(SHR,PASS)                             00850000
//SYSDBG   DD  SYSOUT=*                                                 00860000
//SYSOUT   DD  SYSOUT=*                                                 00870000
//SYSDBOUT DD  SYSOUT=*                                                 00880000
//SYSABOUT DD  SYSOUT=*                                                 00890000
//SYSPRINT DD  SYSOUT=*                                                 00900000
//SYSIN    DD  DSN=MQSERIES.ALIAS.QMGR,DISP=SHR                         00910000
/*                                                                      00920000
//*-------------------------------------------------------------------* 00930000
//*  SORT OUT ALL THE TP CASES                                          00940000
//*-------------------------------------------------------------------- 00950000
//STEP06 EXEC PGM=SORT                                                  00960000
//SYSPRINT DD SYSOUT=*                                                  00970000
//SYSOUT DD SYSOUT=*                                                    00980000
//SORTIN DD DSN=BP13.K400.SALEORD,DISP=SHR                              00990000
//SORTOUT  DD DSN=&&F400TP,DISP=(NEW,PASS),                             01000000
//         UNIT=SYSDA,DCB=(RECFM=FB,LRECL=2000),                        01010000
//         SPACE=(CYL,(8,5),RLSE)                                       01020000
//SYSIN DD *                                                            01030000
    SORT FIELDS=COPY                                                    01040000
    INCLUDE COND=(855,8,CH,EQ,DATE1)                                    01050000
/*                                                                      01060000
//*                                                                     01070000
//*-------------------------------------------------------------------* 01080000
//STEP07 EXEC PGM=BP13CFB3                                              01090000
//SYSPRINT DD SYSOUT=*                                                  01100000
//SYSOUT DD SYSOUT=*                                                    01110000
//BP13F400 DD DSN=&&F400TP,DISP=(SHR,PASS)                              01120000
//BP13K857 DD DSN=BP13.K857.EMAIL,DISP=SHR                              01130000
//BP13F23A DD DSN=BP13.F23A.EMAIL.TP,DISP=SHR                           01140000
//*                                                                     01150000
//*-------------------------------------------------------------------* 01160000
//* DAILY DATA APPENDED INTO MONTH FILE FOR TP                          01170000
//*-------------------------------------------------------------------* 01180000
//STEP07A  EXEC PGM=IDCAMS,COND=(0,NE)                                  01190000
//SYSPRINT DD SYSOUT=*                                                  01200000
//INPUT1   DD DSN=BP13.F23A.EMAIL.TP,DISP=SHR                           01210000
//OUTPUT1  DD DSN=BP13.F23A.EMAIL.TP.MONTH,DISP=MOD                     01220000
//SYSIN    DD *                                                         01230000
        REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                          01240000
//*                                                                     01250000
//*-------------------------------------------------------------------* 01260000
//*  SPLIT 'TP' CASES INTO 2 PARTS                                      01270000
//*-------------------------------------------------------------------- 01280000
//STEP08   EXEC SORT,COND=(0,NE)                                        01290000
//SORTIN   DD DSN=BP13.F23A.EMAIL.TP,DISP=SHR                           01300000
//OUT1     DD DSN=&&F23ATP1,DISP=(NEW,PASS),                            01310000
//         UNIT=SYSDA,DCB=(RECFM=FB,LRECL=200),                         01320000
//         SPACE=(CYL,(8,5),RLSE)                                       01330000
//OUT2     DD DSN=&&F23ATP2,DISP=(NEW,PASS),                            01340000
//         UNIT=SYSDA,DCB=(RECFM=FB,LRECL=200),                         01350000
//         SPACE=(CYL,(8,5),RLSE)                                       01360000
//SYSIN    DD  *                                                        01370000
   OPTION COPY                                                          01380000
   OUTFIL FNAMES=(OUT1,OUT2),SPLIT1R=2000                               01390000
//*--------------------------------------------------------------------*01400000
//* STEP08A: RUN PROGRAM TO CREATE NOTIFICATION MESSAGE TO SEND        *01410000
//*          TO THE MESSAGE QUEUE (BY EMAIL)                           *01420000
//*          APPT TYPE = (TP)                                          *01430000
//*--------------------------------------------------------------------*01440000
//STEP08A  EXEC MQBATCH,NAME=BP13CS06,COND=(0,NE)                       01450000
//STEPLIB  DD                                                           01460000
//         DD                                                           01470000
//         DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                           01480000
//BP13F23A DD DSN=&&F23ATP1,DISP=(SHR,PASS)                             01490000
//SYSDBG   DD  SYSOUT=*                                                 01500000
//SYSOUT   DD  SYSOUT=*                                                 01510000
//SYSDBOUT DD  SYSOUT=*                                                 01520000
//SYSABOUT DD  SYSOUT=*                                                 01530000
//SYSPRINT DD  SYSOUT=*                                                 01540000
//SYSIN    DD  DSN=MQSERIES.ALIAS.QMGR,DISP=SHR                         01550000
/*                                                                      01560000
//*--------------------------------------------------------------------*01570000
//* STEP08B: RUN PROGRAM TO CREATE NOTIFICATION MESSAGE TO SEND        *01580000
//*          TO THE MESSAGE QUEUE (BY EMAIL)                           *01590000
//*          APPT TYPE = (TP)                                          *01600000
//*--------------------------------------------------------------------*01610000
//STEP08B  EXEC MQBATCH,NAME=BP13CS06,COND=(0,NE)                       01620000
//STEPLIB  DD                                                           01630000
//         DD                                                           01640000
//         DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                           01650000
//BP13F23A DD DSN=&&F23ATP2,DISP=(SHR,PASS)                             01660000
//SYSDBG   DD  SYSOUT=*                                                 01670000
//SYSOUT   DD  SYSOUT=*                                                 01680000
//SYSDBOUT DD  SYSOUT=*                                                 01690000
//SYSABOUT DD  SYSOUT=*                                                 01700000
//SYSPRINT DD  SYSOUT=*                                                 01710000
//SYSIN    DD  DSN=MQSERIES.ALIAS.QMGR,DISP=SHR                         01720000
/*                                                                      01730000
