//BP13ADPH  JOB (BP13P),'BP13ADPH',CLASS=I,MSGCLASS=N,                          
//        MSGLEVEL=(1,1),NOTIFY=CSD0071                                         
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//*=================================================================*           
//*=================================================================*           
//* CHGE REQ  DATE        BY   DESCRIPTION                          *           
//* --------  ----        ---  -----------                          *           
//* BP134259  14/06/2011  DW5  NEW JCL FOR CREATING HOMELINK        *           
//*-----------------------------------------------------------------*           
//* JCL TO UPDATE HOMELINK DATASET FOR DBSS                         *           
//*-----------------------------------------------------------------*           
//*------------------------------------------------------------------           
//* CTRL REC FOR OPTION 6 - SCHEDULE BOOKING APPMT (ZONE)                       
//*------------------------------------------------------------------           
//STEP01   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K205.CTLREC,DISP=SHR                                     
//SORTOUT  DD  DSN=&&BP13F205,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=SYSDA,                                                      
//             SPACE=(TRK,(1,1),RLSE),                                          
//             DCB=(BLKSIZE=0,LRECL=80,RECFM=FB)                                
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,15,A),FORMAT=CH                                               
   INCLUDE COND=(14,2,CH,EQ,C'DB',AND,30,1,CH,EQ,C'T')                          
//*------------------------------------------------------------------*          
//*  SORT BP13F200 BY ALLOC-DATE, NT/ZONE, FT, CUR-REG-NO                       
//*------------------------------------------------------------------*          
//STEP02 EXEC    SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=BP13.K200.BKAPPMT,                                           
//             DISP=SHR                                                         
//SORTOUT  DD  DSN=&&P13F200H,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=SYSDA,                                                      
//             SPACE=(CYL,(10,5),RLSE),                                         
//             DCB=(BLKSIZE=23400,LRECL=300,RECFM=FB)                           
//SYSIN    DD  *                                                                
    SORT FIELDS=(1,13,A,57,5,A),FORMAT=CH                                       
//*----------------------------------------------------------------             
//* OUTPUT HOMELINK DATASET                                                     
//*----------------------------------------------------------------             
//STEP03 EXEC    PGM=BP13C24H,COND=(0,NE)                                       
//BP13F205 DD  DSN=&&BP13F205,                                                  
//             DISP=(SHR,PASS)                                                  
//BP13F200 DD  DSN=&&P13F200H,                                                  
//             DISP=(SHR,DELETE)                                                
//BP13K800 DD  DSN=BP13.K800.APPLN.DBS,                                         
//             DISP=SHR,                                                        
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13L24H DD  DSN=BP13.L24H.HOMELINK,DISP=SHR                                  
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//*---------------------------------------------------------------------        
//*  ACCUMULATE THE CONTROL REC INTO CTLREC-ACC FILE                            
//*---------------------------------------------------------------------        
//STEP04 EXEC    PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT DD  SYSOUT=*                                                         
//INPUT1   DD  DSN=&&BP13F205,                                                  
//             DISP=(SHR,PASS)                                                  
//OUTPUT1  DD  DSN=BP13.F205.ACCUM,                                             
//             DISP=MOD                                                         
//SYSIN    DD  *                                                                
      REPRO INFILE(INPUT1) OUTFILE(OUTPUT1)                                     
/*                                                                              
