//BP13AA03 JOB (BP13P),'BP13AA03',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),    00010000
//             NOTIFY=CSD0071                                           00020000
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,                                  00030000
//             DISP=SHR                                                 00040000
//*=====================================================================00050000
//* TITLE  : COMPUTER BALLOTING OF DBSS                                 00060000
//*=====================================================================00070000
//*-------------------------------------------------------------        00080000
//*    TO SEND DYNAMIC JDE AHEAD OF THE PRINT DATASET                   00090000
//*---------------------------------------------------------------------00100000
//PRT01  EXEC    PGM=IEBGENER,COND=(0,NE)                               00110000
//SYSUT1   DD  *                                                        00120000
1$DJDE$ BTEXT='DPT=GRPID-EAAL1A CP-1',END;                              00130000
1$DJDE$ JDE=BP13D,COPIES=1,JDL=BP13,END;                                00140000
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAAL1A                             00150000
//SYSUT2   DD  SYSOUT=8,                                                00160001
//             OUTPUT=(*.FORMID),DEST=IOM8                              00170000
//SYSPRINT DD  SYSOUT=*                                                 00180000
//SYSIN    DD  DUMMY                                                    00190000
/*                                                                      00200000
//*-------------------------------------------------------------------- 00210000
//*      VERIFY FILES BEFORE DAILY PRODUCTION RUN                       00220000
//*-------------------------------------------------------------------- 00230000
//STEP01  EXEC PGM=IDCAMS,COND=(0,NE)                                   00240000
//INPUT1   DD DSN=BP13.K100.DBSSUNIT.UPDATE,DISP=OLD                    00250000
//SYSPRINT DD SYSOUT=*                                                  00260000
//SYSIN   DD *                                                          00270000
          VFY FILE(INPUT1)                                              00280000
/*                                                                      00290000
//*---------------------------------------------------------------------00300000
//* SAS PROGRAM TO PRINT REPORT                                         00310000
//*---------------------------------------------------------------------00320000
//STEP02 EXEC    SAS,COND=(0,NE)                                        00330000
//WORK     DD  UNIT=SYSDA,                                              00340000
//             SPACE=(CYL,(10,5))                                       00350000
//FT42F001 DD  SYSOUT=8,                                                00360001
//             OUTPUT=(*.PRT01.FORMID),DEST=IOM8                        00370000
//P13F100A DD  DSN=BP13.F100.DBSSUNIT.RANDOM,                           00380000
//             DISP=SHR                                                 00390000
//SYSIN    DD  DSN=BP13.BATCH.SRC(BP13SA02),                            00400000
//             DISP=SHR                                                 00410000
//*---------------------------------------------------------------------00420000
//* SAS PROGRAM TO PRINT REPORT                                         00430000
//*---------------------------------------------------------------------00440000
//STEP2A EXEC    SAS,COND=(0,NE)                                        00450000
//WORK     DD  UNIT=SYSDA,                                              00460000
//             SPACE=(CYL,(10,5))                                       00470000
//FT42F001 DD  SYSOUT=8,                                                00480001
//             OUTPUT=(*.PRT01.FORMID),DEST=IOM8                        00490000
//P13F100A DD  DSN=BP13.F100.DBSSUNIT.RANDOM,                           00500000
//             DISP=SHR                                                 00510000
//SYSIN    DD  DSN=BP13.BATCH.SRC(BP13SA04),                            00520000
//             DISP=SHR                                                 00530000
//*---------------------------------------------------------------------00540000
//* SORT BP13K025                                                       00550000
//*---------------------------------------------------------------------00560000
//STEP03 EXEC  SORT,COND=(0,NE)                                         00570000
//SYSPRINT DD  SYSOUT=*                                                 00580000
//SORTIN   DD  DSN=BP13.KA25.GROUNIT,                                   00590000
//             DISP=SHR                                                 00600000
//SORTOUT  DD  DSN=&&BP13FA25,                                          00610000
//             DISP=(NEW,PASS),                                         00620000
//             SPACE=(TRK,(5,2),RLSE),                                  00630000
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=0)                        00640000
//SYSIN    DD *                                                         00650000
      SORT FIELDS=(1,10,CH,A)                                           00660000
      INCLUDE COND=(1,10,CH,NE,C'        ')                             00670000
/*                                                                      00680000
//*---------------------------------------------------------------------00690000
//* SORT BP13F100                                                       00700000
//*---------------------------------------------------------------------00710000
//STEP04 EXEC  SORT,COND=(0,NE)                                         00720000
//SYSPRINT DD  SYSOUT=*                                                 00730000
//SORTIN   DD  DSN=BP13.F100.DBSSUNIT.RANDOM,                           00740000
//             DISP=SHR                                                 00750000
//SORTOUT  DD  DSN=BP13.F100.DBSSUNIT.UPDATE,                           00760000
//             DISP=OLD                                                 00770000
//SYSIN    DD *                                                         00780000
    SORT FIELDS=(1,8,A,72,2,A,19,28,A,47,1,A),                          00790000
                FORMAT=CH                                               00800000
/*                                                                      00810000
//*---------------------------------------------------------------------00820000
//* RUN PROGRAM BP13CA02                                                00830000
//*---------------------------------------------------------------------00840000
//STEP05 EXEC    PGM=BP13CA02,COND=(0,NE)                               00850000
//BP13FA25 DD  DSN=&&BP13FA25,                                          00860000
//             DISP=(SHR,PASS)                                          00870000
//BP13F100 DD  DSN=BP13.F100.DBSSUNIT.UPDATE,                           00880000
//             DISP=OLD                                                 00890000
//BP13LA02 DD  SYSOUT=8,                                                00900001
//             OUTPUT=(*.PRT01.FORMID),DEST=IOM8                        00910000
//BP13LA2A DD  SYSOUT=8,                                                00920001
//             OUTPUT=(*.PRT01.FORMID),DEST=IOM8                        00930000
//SYSPRINT DD  SYSOUT=*                                                 00940000
//SYSDBG   DD  SYSOUT=*                                                 00950000
//SYSDBOUT DD  SYSOUT=*                                                 00960000
//SYSOUT   DD  SYSOUT=*                                                 00970000
/*                                                                      00980000
//*---------------------------------------------------------------------00990000
//* SORT BP13F100                                                       01000000
//*---------------------------------------------------------------------01010000
//STEP06 EXEC  SORT,COND=(0,NE)                                         01020000
//SYSPRINT DD  SYSOUT=*                                                 01030000
//SORTIN   DD  DSN=BP13.F100.DBSSUNIT.UPDATE,                           01040000
//             DISP=SHR                                                 01050000
//SORTOUT  DD  DSN=&&BP13F100,                                          01060000
//             DISP=(NEW,PASS),                                         01070000
//             SPACE=(TRK,(10,5),RLSE),                                 01080000
//             DCB=(RECFM=FB,LRECL=800,BLKSIZE=0)                       01090000
//SYSIN    DD *                                                         01100000
    SORT FIELDS=(1,18,A),FORMAT=CH                                      01110000
/*                                                                      01120000
//**************************************************************        01130000
//* DEFINE BP13.K100.DBSSUNIT.UPDATE FILE                               01140000
//**************************************************************        01150000
//STEP01    EXEC PGM=IDCAMS,COND=(0,NE)                                 01160000
//SYSPRINT  DD SYSOUT=*                                                 01170000
//INPUT1    DD DSN=&&BP13F100,DISP=(SHR,PASS)                           01180000
//SYSIN     DD  *                                                       01190000
            DEL 'BP13.K100.DBSSUNIT.UPDATE' CLUSTER PURGE               01200000
            DEF CLUSTER (NAME(BP13.K100.DBSSUNIT.UPDATE) -              01210000
                TRK(20 5)                              -                01220000
                UNIQUE                                -                 01230000
                STORCLAS(PRODRLS)                     -                 01240000
                LOG(NONE)                             -                 01250000
                SHR(2 3))                             -                 01260000
              DATA                                    -                 01270000
                (NAME(BP13.K100.DBSSUNIT.UPDATE.DATA) -                 01280000
                 KEYS(18 0)                           -                 01290000
                 RECSZ(800 800)                       -                 01300000
                 CISZ(4096)                           -                 01310000
                 FSPC(10 10))                         -                 01320000
              INDEX                                   -                 01330000
                (NAME(BP13.K100.DBSSUNIT.UPDATE.INDEX) -                01340000
                 CISZ(4096))                                            01350000
            IF MAXCC = 0  THEN                        -                 01360000
               REPRO IFILE(INPUT1)                    -                 01370000
               ODS(BP13.K100.DBSSUNIT.UPDATE)                           01380000
