//BP13D537 JOB (BP13P),'BP13D537',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//   NOTIFY=CSD0071                                                             
//*--------------------------------------------------------------------         
//*- THIS JOB WILL CONVERT SEQ FILE TO XML FORMAT                               
//*--------------------------------------------------------------------         
//*  YOU ARE VIEWING JCL THAT FILE-AID 8.9 HAS GENERATED TO                     
//*  PERFORM THE REQUIRED FUNCTION.                                             
//*                                                                             
//*  YOU CAN CHANGE THIS JCL IF DESIRED AND USE THE SUBMIT PRIMARY              
//*  COMMAND TO SUBMIT THE JOB. THE CREATE OR REPLACE PRIMARY COMMAND           
//*  CAN BE USED TO KEEP THIS JOBSTREAM FOR FUTURE USE.                         
//*                                                                             
//*  USE THE END COMMAND TO EXIT WITHOUT SUBMITTING THE JOB.                    
//*                                                                             
//*  COPYRIGHT (C) 2004 BY COMPUWARE CORPORATION, ALL RIGHTS RESERVED.          
//*                                                                             
//*--------------------------------------------------------------------         
//JS10     EXEC PGM=FILEAID,REGION=6M                                           
//STEPLIB  DD  DISP=SHR,DSN=CPW.FA.V8R9M0.MVS3.LOAD                             
//SYSPRINT DD  SYSOUT=*                                                         
//SYSLIST  DD  SYSOUT=*                                                         
//DD01     DD  DSN=BP13.F299.SALES,                                             
//             DISP=SHR                                                         
//DD01O    DD  DSN=BP13.F299.XML,                                               
//             DISP=OLD                                                         
//DD01RL   DD  DSN=BP13.BATCH.COPYCOB,                                          
//             DISP=SHR                                                         
//SYSIN    DD  *                                                                
$$DD01 XMLGEN  INVALID=HEX,OUT=0,LAYOUT=BP13XML                                 
/*                                                                              
//                                                                              
