//BP13D207 JOB (BP13P),'SOC',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),         00000010
//             NOTIFY=CSD0071                                           00000020
//********************************************************************* 00000050
//* CHG NO   BY   ON     - DESCRIPTION                                          
//* ----------------------------------                                          
//* BP13XXXX EL27 150514 - ARCHIVE DELETED K230 K240 INTO HISTORY FILES         
//* BP13XXXX EL27 050614 - SORT F230 F240 BEFORE ARCHIVE                        
//*                        EXPAND F998 LENGTH FROM 300 TO 500                   
//* BP13XXXX EL27 200614 - REMOVE DUPLICATES DURING SORTING OF F230 F240        
//* BP139263 PP11 290722 - AUTO OPENING OF FILE                                 
//********************************************************************* 00000050
//*BATCH UPDATE/DELETE FOR VSAM FILES BP13K222, BP13K230, BP13K240      00000060
//*USING TRANSACTION FILES CREATED FROM PREVIOUS JOBS                   00000070
//********************************************************************* 00000080
//* JOBS     PROGRAM  TRANSACTION FILE     MODE       PROGRAM TO        00000090
//*                                                (UPDATE/DELETE)      00000100
//********************************************************************* 00000110
//*BP13A203  BP13C244 BP13.F222.BP13A203         DELETE      BP13C204   00000140
//*          BP13C234 BP13.F230.BP13A203         DELETE      BP13C211   00000150
//*             "     BP13.F240.BP13A203         DELETE      BP13C216   00000160
//*BP13A204  BP13C247 BP13.F230.BP13A204         UPDATE      IDCAMS     00000170
//*             "     BP13.F222.BP13A204.DELETE  DELETE      BP13C204   00000180
//*             "     BP13.F222.BP13A204.WRITE   WRITE       IDCAMS     00000190
//*             "     BP13.F240.BP13A204.DELETE  DELETE      BP13C216   00000200
//*             "     BP13.F240.BP13A204.WRITE   WRITE       IDCAMS     00000210
//*BP13A221  BP13C234 BP13.F230.BP13A221         DELETE      BP13C211   00000240
//*             "     BP13.F240.BP13A221         DELETE      BP13C216   00000250
//*BP13A224  BP13C227 BP13.F230.BP13A224         UPDATE      IDCAMS     00000260
//*BP13A216  BP13C248 BP13.F222.BP13A216         UPDATE      IDCAMS     00000220
//*          BP13C227 BP13.F230.BP13A216         UPDATE      IDCAMS     00000230
//*          BP13C227 BP13.F230.BP13D216         UPDATE      IDCAMS     00000230
//*BP13A227  BP13C248 BP13.F222.BP13A227         UPDATE      IDCAMS     00000120
//*          BP13C227 BP13.F230.BP13A227         UPDATE      IDCAMS     00000130
//*BP13A230  BP13C244 BP13.F222.BP13A230         DELETE      BP13C204   00000140
//*          BP13C234 BP13.F230.BP13A230         DELETE      BP13C211   00000150
//*             "     BP13.F240.BP13A230         DELETE      BP13C216   00000160
//*BP13A232  BP13C244 BP13.F222.BP13A232         DELETE      BP13C204   00000140
//*          BP13C234 BP13.F230.BP13A232         DELETE      BP13C211   00000150
//*             "     BP13.F240.BP13A232         DELETE      BP13C216   00000160
//*BP13A240  BP13C227 BP13.F230.BP13A240         UPDATE      IDCAMS     00000230
//*BP13A270  BP13C248 BP13.F222.BP13A270         UPDATE      IDCAMS             
//*BP13A271  BP13C248 BP13.F222.BP13A271         UPDATE      IDCAMS             
//********************************************************************* 00000350
//*--------------------------------------------------------------------         
//*      VERIFY FILES BEFORE DAILY PRODUCTION RUN                               
//*--------------------------------------------------------------------         
//STEP00  EXEC PGM=IDCAMS,COND=(0,NE)                                           
//INPUT1   DD DSN=BP13.K23H.FLATLIST.HIST,DISP=OLD                              
//INPUT2   DD DSN=BP13.K24H.HEADFLAT.HIST,DISP=OLD                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN   DD *                                                                  
          VFY FILE(INPUT1)                                                      
          VFY FILE(INPUT2)                                                      
          IF LASTCC=12 THEN                                                     
             DO                                                                 
                SET MAXCC=0                                                     
                VFY FILE(INPUT1)                                                
                VFY FILE(INPUT2)                                                
             END                                                                
/*                                                                              
//********************************************************************* 00000350
//* TO LIST CAT ENTRY                                                   00000360
//********************************************************************* 00000370
//S2     EXEC    PGM=IDCAMS                                             00000380
//*                                                                     00000390
//SYSPRINT DD  SYSOUT=*                                                 00000400
//SYSIN    DD  *                                                        00000410
   LISTC ENT(BP13.F222.BP13A203) ALL                                            
   LISTC ENT(BP13.F230.BP13A203) ALL                                            
   LISTC ENT(BP13.F240.BP13A203) ALL                                            
/*                                                                      00000420
//********************************************************************* 00000430
//* TO LIST CAT ENTRY                                                   00000440
//********************************************************************* 00000450
//S3     EXEC    PGM=IDCAMS                                             00000460
//*                                                                     00000470
//SYSPRINT DD  SYSOUT=*                                                 00000480
//SYSIN    DD  *                                                        00000490
   LISTC ENT(BP13.F222.BP13A204.DELETE) ALL                                     
   LISTC ENT(BP13.F222.BP13A204.WRITE) ALL                                      
   LISTC ENT(BP13.F230.BP13A204) ALL                                            
   LISTC ENT(BP13.F240.BP13A204.DELETE) ALL                                     
   LISTC ENT(BP13.F240.BP13A204.WRITE) ALL                                      
/*                                                                      00000500
//********************************************************************* 00000590
//* TO LIST CAT ENTRY                                                   00000600
//********************************************************************* 00000610
//S5     EXEC    PGM=IDCAMS                                             00000620
//*                                                                     00000630
//SYSPRINT DD  SYSOUT=*                                                 00000640
//SYSIN    DD  *                                                        00000650
   LISTC ENT(BP13.F230.BP13A221) ALL                                            
   LISTC ENT(BP13.F240.BP13A221) ALL                                            
/*                                                                      00000660
//********************************************************************* 00000670
//* TO LIST CAT ENTRY                                                   00000680
//********************************************************************* 00000690
//S6     EXEC    PGM=IDCAMS                                             00000700
//*                                                                     00000710
//SYSPRINT DD  SYSOUT=*                                                 00000720
//SYSIN    DD  *                                                        00000730
   LISTC ENT(BP13.F230.BP13A224) ALL                                            
/*                                                                      00000740
//********************************************************************* 00000510
//* TO LIST CAT ENTRY                                                   00000520
//********************************************************************* 00000530
//S7     EXEC    PGM=IDCAMS                                             00000540
//*                                                                     00000550
//SYSPRINT DD  SYSOUT=*                                                 00000560
//SYSIN    DD  *                                                        00000570
   LISTC ENT(BP13.F222.BP13A216) ALL                                            
   LISTC ENT(BP13.F230.BP13A216) ALL                                            
   LISTC ENT(BP13.F230.BP13D216) ALL                                            
/*                                                                      00000580
//********************************************************************* 00000270
//* TO LIST CAT ENTRY                                                   00000280
//********************************************************************* 00000290
//S8     EXEC    PGM=IDCAMS                                             00000300
//*                                                                     00000310
//SYSPRINT DD  SYSOUT=*                                                 00000320
//SYSIN    DD  *                                                        00000330
   LISTC ENT(BP13.F222.BP13A227) ALL                                            
   LISTC ENT(BP13.F230.BP13A227) ALL                                            
/*                                                                      00000340
//********************************************************************* 00000350
//* TO LIST CAT ENTRY                                                   00000360
//********************************************************************* 00000370
//S9     EXEC    PGM=IDCAMS                                             00000380
//*                                                                     00000390
//SYSPRINT DD  SYSOUT=*                                                 00000400
//SYSIN    DD  *                                                        00000410
   LISTC ENT(BP13.F222.BP13A230) ALL                                            
   LISTC ENT(BP13.F230.BP13A230) ALL                                            
   LISTC ENT(BP13.F240.BP13A230) ALL                                            
/*                                                                      00000420
//********************************************************************* 00000350
//* TO LIST CAT ENTRY                                                   00000360
//********************************************************************* 00000370
//S10    EXEC    PGM=IDCAMS                                             00000380
//*                                                                     00000390
//SYSPRINT DD  SYSOUT=*                                                 00000400
//SYSIN    DD  *                                                        00000410
   LISTC ENT(BP13.F222.BP13A232) ALL                                            
   LISTC ENT(BP13.F230.BP13A232) ALL                                            
   LISTC ENT(BP13.F240.BP13A232) ALL                                            
/*                                                                      00000420
//********************************************************************* 00000350
//* TO LIST CAT ENTRY                                                   00000360
//********************************************************************* 00000370
//S11    EXEC    PGM=IDCAMS                                             00000380
//*                                                                     00000390
//SYSPRINT DD  SYSOUT=*                                                 00000400
//SYSIN    DD  *                                                        00000410
   LISTC ENT(BP13.F230.BP13A240) ALL                                            
/*                                                                      00000420
//*********************************************************************         
//* TO LIST CAT ENTRY                                                           
//*********************************************************************         
//S12    EXEC    PGM=IDCAMS                                                     
//*                                                                             
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  *                                                                
   LISTC ENT(BP13.F222.BP13A270) ALL                                            
/*                                                                              
//*********************************************************************         
//* TO LIST CAT ENTRY                                                           
//*********************************************************************         
//S13    EXEC    PGM=IDCAMS                                                     
//*                                                                             
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  *                                                                
   LISTC ENT(BP13.F222.BP13A271) ALL                                            
/*                                                                              
//*---------------------------------------------------------------------00001080
//* BACKUP FILES BEFORE UPDATE                                          00001090
//*---------------------------------------------------------------------00001100
//S14    EXEC    PGM=IDCAMS                                             00001110
//SYSPRINT DD  SYSOUT=*                                                 00001120
//INPUT1   DD  DSN=BP13.F998.BP13D206,                                  00001130
//             DISP=SHR                                                 00001140
//OUTPUT1  DD  DSN=BP13.F998.BP13D206.BACKUP(+1),                       00001160
//             DISP=(NEW,CATLG),                                        00001170
//             UNIT=DISK,                                               00001180
//             SPACE=(CYL,(10,5),RLSE),                                 00001190
//             DCB=(BP13.GDG,BLKSIZE=0,LRECL=500,RECFM=FB)              00001200
//SYSIN    DD  *                                                        00001360
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
/*                                                                      00001370
//*--------------------------------------------------------------------         
//* EMPTY BACKUP FILE                                                           
//*--------------------------------------------------------------------         
//S16      EXEC PGM=IDCAMS                                                      
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DUMMY                                                             
//OUTPUT1  DD DSN=BP13.F998.BP13D206,DISP=OLD                                   
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                     
//*                                                                             
//*--------------------------------------------------------------------         
//* EMPTY BACKUP FILE                                                           
//*--------------------------------------------------------------------         
//S17      EXEC PGM=IDCAMS                                                      
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DUMMY                                                             
//OUTPUT1  DD DSN=BP13.F240.BP13K249.ADD,DISP=OLD                               
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                     
//*                                                                             
//*--------------------------------------------------------------------         
//* EMPTY BACKUP FILE                                                           
//*--------------------------------------------------------------------         
//S18      EXEC PGM=IDCAMS                                                      
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DUMMY                                                             
//OUTPUT1  DD DSN=BP13.F240.BP13K249.DEL,DISP=OLD                               
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                     
//*                                                                             
//IFTEST2 IF (S2.RC = 0) THEN                                           00002100
//*---------------------------------------------------------------------00001630
//* BACKUP FILES BEFORE DELETE                                          00001640
//*---------------------------------------------------------------------00001670
//A203B1 EXEC    SORT                                                   00001680
//SORTIN   DD  DSN=BP13.F222.BP13A203,                                  00001690
//             DISP=SHR                                                 00001700
//SORTOUT  DD  DSN=BP13.F998.BP13D206,                                  00001710
//             DISP=MOD                                                 00001720
//SYSIN    DD  *                                                        00001760
    SORT FIELDS=(1,100,A),FORMAT=CH                                             
    OUTREC FIELDS=(C'BP13F222',C'DELETE',1,100,350X,C'BP13A203',28X)            
/*                                                                      00001770
//*---------------------------------------------------------------------00001630
//* BACKUP FILES BEFORE DELETE                                          00001640
//*---------------------------------------------------------------------00001670
//A203B2 EXEC    SORT                                                   00001680
//SORTIN   DD  DSN=BP13.F230.BP13A203,                                  00001690
//             DISP=SHR                                                 00001700
//SORTOUT  DD  DSN=BP13.F998.BP13D206,                                  00001710
//             DISP=MOD                                                 00001720
//SYSIN    DD  *                                                        00001760
    SORT FIELDS=(1,450,A),FORMAT=CH                                             
    OUTREC FIELDS=(C'BP13F230',C'DELETE',1,450,C'BP13A203',28X)                 
/*                                                                      00001770
//*---------------------------------------------------------------------00001630
//* BACKUP FILES BEFORE DELETE                                          00001640
//*---------------------------------------------------------------------00001670
//A203B3 EXEC    SORT                                                   00001680
//SORTIN   DD  DSN=BP13.F240.BP13A203,                                  00001690
//             DISP=SHR                                                 00001700
//SORTOUT  DD  DSN=BP13.F998.BP13D206,                                  00001710
//             DISP=MOD                                                 00001720
//SYSIN    DD  *                                                        00001760
    SORT FIELDS=(1,450,A),FORMAT=CH                                             
    OUTREC FIELDS=(C'BP13F240',C'DELETE',1,450,C'BP13A203',28X)                 
/*                                                                      00001770
//*---------------------------------------------------------------------00001630
//* SORT FILE BEFORE REPRO TO HISTORY K23H                              00001640
//*---------------------------------------------------------------------00001670
//A203S1 EXEC    SORT                                                   00001680
//SORTIN   DD  DSN=BP13.F230.BP13A203,                                  00001690
//             DISP=SHR                                                 00001700
//SORTOUT  DD  DSN=&&BP13F230,                                          00001710
//             DISP=(NEW,PASS),                                         00001720
//             LIKE=BP13.F230.BP13A203                                  00001720
//SYSIN    DD  *                                                        00001760
    SORT FIELDS=(64,11,A),FORMAT=CH                                             
    SUM FIELDS=NONE                                                             
/*                                                                      00001770
//*---------------------------------------------------------------------00001630
//* SORT FILE BEFORE REPRO TO HISTORY K24H                              00001640
//*---------------------------------------------------------------------00001670
//A203S2 EXEC    SORT                                                   00001680
//SORTIN   DD  DSN=BP13.F240.BP13A203,                                  00001690
//             DISP=SHR                                                 00001700
//SORTOUT  DD  DSN=&&BP13F240,                                          00001710
//             DISP=(NEW,PASS),                                         00001720
//             LIKE=BP13.F240.BP13A203                                  00001720
//SYSIN    DD  *                                                        00001760
    SORT FIELDS=(5,52,A),FORMAT=CH                                              
    SUM FIELDS=NONE                                                             
/*                                                                      00001770
//*--------------------------------------------------------------------         
//* REPRO INTO HISTORY VSAM FILES BEFORE DELETE                                 
//*--------------------------------------------------------------------         
//A203HIST EXEC PGM=IDCAMS                                                      
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=&&BP13F230,                                                   
//            DISP=(SHR,DELETE)                                                 
//OUTPUT1  DD DSN=BP13.K23H.FLATLIST.HIST,                                      
//            DISP=MOD                                                  00001720
//INPUT2   DD DSN=&&BP13F240,                                                   
//            DISP=(SHR,DELETE)                                         00001700
//OUTPUT2  DD DSN=BP13.K24H.HEADFLAT.HIST,                                      
//            DISP=MOD                                                  00001720
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1) REPLACE                               
   REPRO INFILE(INPUT2)  OUTFILE(OUTPUT2) REPLACE                               
/*                                                                              
//*-------------------------------------------------------------------- 00002730
//*    DELETE DATASET                                                   00002740
//*-------------------------------------------------------------------- 00002750
//A203D1 EXEC    PGM=IDCAMS                                             00002760
//SYSPRINT DD  SYSOUT=*                                                 00002770
//SYSIN    DD  *                                                        00002780
    DEL   ('BP13.F222.BP13A203')                                                
    DEL   ('BP13.F230.BP13A203')                                                
    DEL   ('BP13.F240.BP13A203')                                                
/*                                                                      00002790
//ENDTEST2  ENDIF                                                       00002800
/*                                                                      00002810
//IFTEST3 IF (S3.RC = 0) THEN                                           00002820
//*---------------------------------------------------------------------00001630
//* BACKUP FILES BEFORE DELETE                                          00001640
//*---------------------------------------------------------------------00001670
//A204B1 EXEC    SORT                                                   00001680
//SORTIN   DD  DSN=BP13.F222.BP13A204.DELETE,                           00001690
//             DISP=SHR                                                 00001700
//SORTOUT  DD  DSN=BP13.F998.BP13D206,                                  00001710
//             DISP=MOD                                                 00001720
//SYSIN    DD  *                                                        00001760
    SORT FIELDS=(1,100,A),FORMAT=CH                                             
    OUTREC FIELDS=(C'BP13F222',C'DELETE',1,100,350X,C'BP13A204',28X)            
/*                                                                      00001770
//*---------------------------------------------------------------------00001630
//* BACKUP FILES BEFORE DELETE                                          00001640
//*---------------------------------------------------------------------00001670
//A204B2 EXEC    SORT                                                   00001680
//SORTIN   DD  DSN=BP13.F222.BP13A204.WRITE,                            00001690
//             DISP=SHR                                                 00001700
//SORTOUT  DD  DSN=BP13.F998.BP13D206,                                  00001710
//             DISP=MOD                                                 00001720
//SYSIN    DD  *                                                        00001760
    SORT FIELDS=(1,100,A),FORMAT=CH                                             
    OUTREC FIELDS=(C'BP13F222',C'UPDATE',1,100,350X,C'BP13A204',28X)            
/*                                                                      00001770
//*---------------------------------------------------------------------00001630
//* BACKUP FILES BEFORE DELETE                                          00001640
//*---------------------------------------------------------------------00001670
//A204B3 EXEC    SORT                                                   00001680
//SORTIN   DD  DSN=BP13.F230.BP13A204,                                  00001690
//             DISP=SHR                                                 00001700
//SORTOUT  DD  DSN=BP13.F998.BP13D206,                                  00001710
//             DISP=MOD                                                 00001720
//SYSIN    DD  *                                                        00001760
    SORT FIELDS=(1,450,A),FORMAT=CH                                             
    OUTREC FIELDS=(C'BP13F230',C'UPDATE',1,450,C'BP13A204',28X)                 
/*                                                                      00001770
//*---------------------------------------------------------------------00001630
//* BACKUP FILES BEFORE DELETE                                          00001640
//*---------------------------------------------------------------------00001670
//A204B4 EXEC    SORT                                                   00001680
//SORTIN   DD  DSN=BP13.F240.BP13A204.DELETE,                           00001690
//             DISP=SHR                                                 00001700
//SORTOUT  DD  DSN=BP13.F998.BP13D206,                                  00001710
//             DISP=MOD                                                 00001720
//SYSIN    DD  *                                                        00001760
    SORT FIELDS=(1,450,A),FORMAT=CH                                             
    OUTREC FIELDS=(C'BP13F240',C'DELETE',1,450,C'BP13A204',28X)                 
/*                                                                      00001770
//*---------------------------------------------------------------------00001630
//* BACKUP FILES BEFORE DELETE                                          00001640
//*---------------------------------------------------------------------00001670
//A204B5  EXEC    SORT                                                  00001680
//SORTIN   DD  DSN=BP13.F240.BP13A204.WRITE,                            00001690
//             DISP=SHR                                                 00001700
//SORTOUT  DD  DSN=BP13.F998.BP13D206,                                  00001710
//             DISP=MOD                                                 00001720
//SYSIN    DD  *                                                        00001760
    SORT FIELDS=(1,450,A),FORMAT=CH                                             
    OUTREC FIELDS=(C'BP13F240',C'UPDATE',1,450,C'BP13A204',28X)                 
/*                                                                      00001770
//*-------------------------------------------------------------------- 00003770
//*    DELETE DATASET                                                   00003780
//*-------------------------------------------------------------------- 00003790
//A204D1  EXEC    PGM=IDCAMS                                            00003800
//SYSPRINT DD  SYSOUT=*                                                 00003810
//SYSIN    DD  *                                                        00003820
    DEL   ('BP13.F222.BP13A204.DELETE')                                         
    DEL   ('BP13.F222.BP13A204.WRITE')                                          
    DEL   ('BP13.F230.BP13A204')                                                
    DEL   ('BP13.F240.BP13A204.DELETE')                                         
    DEL   ('BP13.F240.BP13A204.WRITE')                                          
/*                                                                      00003830
//ENDTEST3  ENDIF                                                       00003840
/*                                                                      00003850
//IFTEST5 IF (S5.RC = 0) THEN                                           00004890
//*---------------------------------------------------------------------00001630
//* BACKUP FILES BEFORE DELETE                                          00001640
//*---------------------------------------------------------------------00001670
//A221B1  EXEC    SORT                                                  00001680
//SORTIN   DD  DSN=BP13.F230.BP13A221,                                  00001690
//             DISP=SHR                                                 00001700
//SORTOUT  DD  DSN=BP13.F998.BP13D206,                                  00001710
//             DISP=MOD                                                 00001720
//SYSIN    DD  *                                                        00001760
    SORT FIELDS=(1,450,A),FORMAT=CH                                             
    OUTREC FIELDS=(C'BP13F230',C'DELETE',1,450,C'BP13A221',28X)                 
/*                                                                      00001770
//*---------------------------------------------------------------------00001630
//* BACKUP FILES BEFORE DELETE                                          00001640
//*---------------------------------------------------------------------00001670
//A221B2  EXEC    SORT                                                  00001680
//SORTIN   DD  DSN=BP13.F240.BP13A221,                                  00001690
//             DISP=SHR                                                 00001700
//SORTOUT  DD  DSN=BP13.F998.BP13D206,                                  00001710
//             DISP=MOD                                                 00001720
//SYSIN    DD  *                                                        00001760
    SORT FIELDS=(1,450,A),FORMAT=CH                                             
    OUTREC FIELDS=(C'BP13F240',C'DELETE',1,450,C'BP13A221',28X)                 
/*                                                                      00001630
//*---------------------------------------------------------------------00001630
//* SORT FILE BEFORE REPRO TO HISTORY K23H                              00001640
//*---------------------------------------------------------------------00001670
//A221S1 EXEC    SORT                                                   00001680
//SORTIN   DD  DSN=BP13.F230.BP13A221,                                  00001690
//             DISP=SHR                                                 00001700
//SORTOUT  DD  DSN=&&BP13F230,                                          00001710
//             DISP=(NEW,PASS),                                         00001720
//             LIKE=BP13.F230.BP13A221                                  00001720
//SYSIN    DD  *                                                        00001760
    SORT FIELDS=(64,11,A),FORMAT=CH                                             
    SUM FIELDS=NONE                                                             
/*                                                                      00001770
//*---------------------------------------------------------------------00001630
//* SORT FILE BEFORE REPRO TO HISTORY K24H                              00001640
//*---------------------------------------------------------------------00001670
//A221S2 EXEC    SORT                                                   00001680
//SORTIN   DD  DSN=BP13.F240.BP13A221,                                  00001690
//             DISP=SHR                                                 00001700
//SORTOUT  DD  DSN=&&BP13F240,                                          00001710
//             DISP=(NEW,PASS),                                         00001720
//             LIKE=BP13.F240.BP13A221                                  00001720
//SYSIN    DD  *                                                        00001760
    SORT FIELDS=(5,52,A),FORMAT=CH                                              
    SUM FIELDS=NONE                                                             
/*                                                                      00001770
//*--------------------------------------------------------------------         
//* REPRO INTO HISTORY VSAM FILES BEFORE DELETE                                 
//*--------------------------------------------------------------------         
//A221HIST EXEC PGM=IDCAMS                                                      
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=&&BP13F230,                                                   
//            DISP=(SHR,DELETE)                                                 
//OUTPUT1  DD DSN=BP13.K23H.FLATLIST.HIST,                                      
//            DISP=MOD                                                  00001720
//INPUT2   DD DSN=&&BP13F240,                                                   
//            DISP=(SHR,DELETE)                                         00001700
//OUTPUT2  DD DSN=BP13.K24H.HEADFLAT.HIST,                                      
//            DISP=MOD                                                  00001720
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1) REPLACE                               
   REPRO INFILE(INPUT2)  OUTFILE(OUTPUT2) REPLACE                               
/*                                                                      00001770
//*-------------------------------------------------------------------- 00005310
//*    DELETE DATASET                                                   00005320
//*-------------------------------------------------------------------- 00005330
//A221D1 EXEC    PGM=IDCAMS                                             00005340
//SYSPRINT DD  SYSOUT=*                                                 00005350
//SYSIN    DD  *                                                        00005360
    DEL   ('BP13.F230.BP13A221')                                                
    DEL   ('BP13.F240.BP13A221')                                                
//ENDTEST5  ENDIF                                                       00005370
/*                                                                      00005380
//IFTEST6 IF (S6.RC = 0) THEN                                           00005390
//*---------------------------------------------------------------------00001630
//* BACKUP FILES BEFORE DELETE                                          00001640
//*---------------------------------------------------------------------00001670
//A224B1  EXEC    SORT                                                  00001680
//SORTIN   DD  DSN=BP13.F230.BP13A224,                                  00001690
//             DISP=SHR                                                 00001700
//SORTOUT  DD  DSN=BP13.F998.BP13D206,                                  00001710
//             DISP=MOD                                                 00001720
//SYSIN    DD  *                                                        00001760
    SORT FIELDS=(1,450,A),FORMAT=CH                                             
    OUTREC FIELDS=(C'BP13F230',C'UPDATE',1,450,C'BP13A224',28X)                 
/*                                                                      00001770
//*-------------------------------------------------------------------- 00006150
//*    DELETE DATASET                                                   00006160
//*-------------------------------------------------------------------- 00006170
//A224D1 EXEC    PGM=IDCAMS                                             00006180
//SYSPRINT DD  SYSOUT=*                                                 00006190
//SYSIN    DD  *                                                        00006200
    DEL   ('BP13.F230.BP13A224')                                                
/*                                                                      00006210
//ENDTEST6  ENDIF                                                       00006220
/*                                                                      00006230
//IFTEST7 IF (S7.RC = 0) THEN                                           00003860
//*---------------------------------------------------------------------00001630
//* BACKUP FILES BEFORE DELETE                                          00001640
//*---------------------------------------------------------------------00001670
//A216B1 EXEC    SORT                                                   00001680
//SORTIN   DD  DSN=BP13.F222.BP13A216,                                  00001690
//             DISP=SHR                                                 00001700
//SORTOUT  DD  DSN=BP13.F998.BP13D206,                                  00001710
//             DISP=MOD                                                 00001720
//SYSIN    DD  *                                                        00001760
    SORT FIELDS=(1,100,A),FORMAT=CH                                             
    OUTREC FIELDS=(C'BP13F222',C'UPDATE',1,100,350X,C'BP13A216',28X)            
/*                                                                      00001770
//*---------------------------------------------------------------------00001630
//* BACKUP FILES BEFORE DELETE                                          00001640
//*---------------------------------------------------------------------00001670
//A216B2  EXEC    SORT                                                  00001680
//SORTIN   DD  DSN=BP13.F230.BP13A216,                                  00001690
//             DISP=SHR                                                 00001700
//SORTOUT  DD  DSN=BP13.F998.BP13D206,                                  00001710
//             DISP=MOD                                                 00001720
//SYSIN    DD  *                                                        00001760
    SORT FIELDS=(1,450,A),FORMAT=CH                                             
    OUTREC FIELDS=(C'BP13F230',C'UPDATE',1,450,C'BP13A216',28X)                 
/*                                                                      00001770
//*-------------------------------------------------------------------- 00004810
//*    DELETE DATASET                                                   00004820
//*-------------------------------------------------------------------- 00004830
//A216D1 EXEC    PGM=IDCAMS                                             00004840
//SYSPRINT DD  SYSOUT=*                                                 00004850
//SYSIN    DD  *                                                        00004860
    DEL   ('BP13.F222.BP13A216')                                                
    DEL   ('BP13.F230.BP13A216')                                                
    DEL   ('BP13.F230.BP13D216')                                                
//ENDTEST7  ENDIF                                                       00004870
/*                                                                      00004880
//IFTEST8  IF (S8.RC = 0) THEN                                                  
//*---------------------------------------------------------------------00001630
//* BACKUP FILES BEFORE DELETE                                          00001640
//*---------------------------------------------------------------------00001670
//A227B1 EXEC    SORT                                                   00001680
//SORTIN   DD  DSN=BP13.F222.BP13A227,                                  00001690
//             DISP=SHR                                                 00001700
//SORTOUT  DD  DSN=BP13.F998.BP13D206,                                  00001710
//             DISP=MOD                                                 00001720
//SYSIN    DD  *                                                        00001760
    SORT FIELDS=(1,100,A),FORMAT=CH                                             
    OUTREC FIELDS=(C'BP13F222',C'UPDATE',1,100,350X,C'BP13A227',28X)            
/*                                                                      00001770
//*---------------------------------------------------------------------00001630
//* BACKUP FILES BEFORE DELETE                                          00001640
//*---------------------------------------------------------------------00001670
//A227B2 EXEC    SORT                                                   00001680
//SORTIN   DD  DSN=BP13.F230.BP13A227,                                  00001690
//             DISP=SHR                                                 00001700
//SORTOUT  DD  DSN=BP13.F998.BP13D206,                                  00001710
//             DISP=MOD                                                 00001720
//SYSIN    DD  *                                                        00001760
    SORT FIELDS=(1,450,A),FORMAT=CH                                             
    OUTREC FIELDS=(C'BP13F230',C'UPDATE',1,450,C'BP13A227',28X)                 
/*                                                                      00001770
//*-------------------------------------------------------------------- 00002020
//*    DELETE DATASET                                                   00002030
//*-------------------------------------------------------------------- 00002040
//A227D1 EXEC    PGM=IDCAMS                                             00002050
//SYSPRINT DD  SYSOUT=*                                                 00002060
//SYSIN    DD  *                                                        00002070
    DEL   ('BP13.F222.BP13A227')                                                
    DEL   ('BP13.F230.BP13A227')                                                
//ENDTEST8  ENDIF                                                       00002080
/*                                                                      00002090
//IFTEST9 IF (S9.RC = 0) THEN                                           00002100
//*---------------------------------------------------------------------00001630
//* BACKUP FILES BEFORE DELETE                                          00001640
//*---------------------------------------------------------------------00001670
//A230B1 EXEC    SORT                                                   00001680
//SORTIN   DD  DSN=BP13.F222.BP13A230,                                  00001690
//             DISP=SHR                                                 00001700
//SORTOUT  DD  DSN=BP13.F998.BP13D206,                                  00001710
//             DISP=MOD                                                 00001720
//SYSIN    DD  *                                                        00001760
    SORT FIELDS=(1,100,A),FORMAT=CH                                             
    OUTREC FIELDS=(C'BP13F222',C'DELETE',1,100,350X,C'BP13A230',28X)            
/*                                                                      00001770
//*---------------------------------------------------------------------00001630
//* BACKUP FILES BEFORE DELETE                                          00001640
//*---------------------------------------------------------------------00001670
//A230B2 EXEC    SORT                                                   00001680
//SORTIN   DD  DSN=BP13.F230.BP13A230,                                  00001690
//             DISP=SHR                                                 00001700
//SORTOUT  DD  DSN=BP13.F998.BP13D206,                                  00001710
//             DISP=MOD                                                 00001720
//SYSIN    DD  *                                                        00001760
    SORT FIELDS=(1,450,A),FORMAT=CH                                             
    OUTREC FIELDS=(C'BP13F230',C'DELETE',1,450,C'BP13A230',28X)                 
/*                                                                      00001770
//*---------------------------------------------------------------------00001630
//* BACKUP FILES BEFORE DELETE                                          00001640
//*---------------------------------------------------------------------00001670
//A230B3 EXEC    SORT                                                   00001680
//SORTIN   DD  DSN=BP13.F240.BP13A230,                                  00001690
//             DISP=SHR                                                 00001700
//SORTOUT  DD  DSN=BP13.F998.BP13D206,                                  00001710
//             DISP=MOD                                                 00001720
//SYSIN    DD  *                                                        00001760
    SORT FIELDS=(1,450,A),FORMAT=CH                                             
    OUTREC FIELDS=(C'BP13F240',C'DELETE',1,450,C'BP13A230',28X)                 
/*                                                                      00001630
//*---------------------------------------------------------------------00001630
//* SORT FILE BEFORE REPRO TO HISTORY K23H                              00001640
//*---------------------------------------------------------------------00001670
//A230S1 EXEC    SORT                                                   00001680
//SORTIN   DD  DSN=BP13.F230.BP13A230,                                  00001690
//             DISP=SHR                                                 00001700
//SORTOUT  DD  DSN=&&BP13F230,                                          00001710
//             DISP=(NEW,PASS),                                         00001720
//             LIKE=BP13.F230.BP13A230                                  00001720
//SYSIN    DD  *                                                        00001760
    SORT FIELDS=(64,11,A),FORMAT=CH                                             
    SUM FIELDS=NONE                                                             
/*                                                                      00001770
//*---------------------------------------------------------------------00001630
//* SORT FILE BEFORE REPRO TO HISTORY K24H                              00001640
//*---------------------------------------------------------------------00001670
//A230S2 EXEC    SORT                                                   00001680
//SORTIN   DD  DSN=BP13.F240.BP13A230,                                  00001690
//             DISP=SHR                                                 00001700
//SORTOUT  DD  DSN=&&BP13F240,                                          00001710
//             DISP=(NEW,PASS),                                         00001720
//             LIKE=BP13.F240.BP13A230                                  00001720
//SYSIN    DD  *                                                        00001760
    SORT FIELDS=(5,52,A),FORMAT=CH                                              
    SUM FIELDS=NONE                                                             
/*                                                                      00001770
//*--------------------------------------------------------------------         
//* REPRO INTO HISTORY VSAM FILES BEFORE DELETE                                 
//*--------------------------------------------------------------------         
//A230HIST EXEC PGM=IDCAMS                                                      
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=&&BP13F230,                                                   
//            DISP=(SHR,DELETE)                                                 
//OUTPUT1  DD DSN=BP13.K23H.FLATLIST.HIST,                                      
//            DISP=MOD                                                  00001720
//INPUT2   DD DSN=&&BP13F240,                                                   
//            DISP=(SHR,DELETE)                                         00001700
//OUTPUT2  DD DSN=BP13.K24H.HEADFLAT.HIST,                                      
//            DISP=MOD                                                  00001720
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1) REPLACE                               
   REPRO INFILE(INPUT2)  OUTFILE(OUTPUT2) REPLACE                               
/*                                                                      00001770
//*-------------------------------------------------------------------- 00002730
//*    DELETE DATASET                                                   00002740
//*-------------------------------------------------------------------- 00002750
//A230D1 EXEC    PGM=IDCAMS                                             00002760
//SYSPRINT DD  SYSOUT=*                                                 00002770
//SYSIN    DD  *                                                        00002780
    DEL   ('BP13.F222.BP13A230')                                                
    DEL   ('BP13.F230.BP13A230')                                                
    DEL   ('BP13.F240.BP13A230')                                                
/*                                                                      00002790
//ENDTEST9  ENDIF                                                       00002800
/*                                                                      00002810
//IFTESTA IF (S10.RC = 0) THEN                                          00002100
//*---------------------------------------------------------------------00001630
//* BACKUP FILES BEFORE DELETE                                          00001640
//*---------------------------------------------------------------------00001670
//A232B1 EXEC    SORT                                                   00001680
//SORTIN   DD  DSN=BP13.F222.BP13A232,                                  00001690
//             DISP=SHR                                                 00001700
//SORTOUT  DD  DSN=BP13.F998.BP13D206,                                  00001710
//             DISP=MOD                                                 00001720
//SYSIN    DD  *                                                        00001760
    SORT FIELDS=(1,100,A),FORMAT=CH                                             
    OUTREC FIELDS=(C'BP13F222',C'DELETE',1,100,350X,C'BP13A232',28X)            
/*                                                                      00001770
//*---------------------------------------------------------------------00001630
//* BACKUP FILES BEFORE DELETE                                          00001640
//*---------------------------------------------------------------------00001670
//A232B2 EXEC    SORT                                                   00001680
//SORTIN   DD  DSN=BP13.F230.BP13A232,                                  00001690
//             DISP=SHR                                                 00001700
//SORTOUT  DD  DSN=BP13.F998.BP13D206,                                  00001710
//             DISP=MOD                                                 00001720
//SYSIN    DD  *                                                        00001760
    SORT FIELDS=(1,450,A),FORMAT=CH                                             
    OUTREC FIELDS=(C'BP13F230',C'DELETE',1,450,C'BP13A232',28X)                 
/*                                                                      00001770
//*---------------------------------------------------------------------00001630
//* BACKUP FILES BEFORE DELETE                                          00001640
//*---------------------------------------------------------------------00001670
//A232B3 EXEC    SORT                                                   00001680
//SORTIN   DD  DSN=BP13.F240.BP13A232,                                  00001690
//             DISP=SHR                                                 00001700
//SORTOUT  DD  DSN=BP13.F998.BP13D206,                                  00001710
//             DISP=MOD                                                 00001720
//SYSIN    DD  *                                                        00001760
    SORT FIELDS=(1,450,A),FORMAT=CH                                             
    OUTREC FIELDS=(C'BP13F240',C'DELETE',1,450,C'BP13A232',28X)                 
/*                                                                      00001630
//*---------------------------------------------------------------------00001630
//* SORT FILE BEFORE REPRO TO HISTORY K23H                              00001640
//*---------------------------------------------------------------------00001670
//A232S1 EXEC    SORT                                                   00001680
//SORTIN   DD  DSN=BP13.F230.BP13A232,                                  00001690
//             DISP=SHR                                                 00001700
//SORTOUT  DD  DSN=&&BP13F230,                                          00001710
//             DISP=(NEW,PASS),                                         00001720
//             LIKE=BP13.F230.BP13A232                                  00001720
//SYSIN    DD  *                                                        00001760
    SORT FIELDS=(64,11,A),FORMAT=CH                                             
    SUM FIELDS=NONE                                                             
/*                                                                      00001770
//*---------------------------------------------------------------------00001630
//* SORT FILE BEFORE REPRO TO HISTORY K24H                              00001640
//*---------------------------------------------------------------------00001670
//A232S2 EXEC    SORT                                                   00001680
//SORTIN   DD  DSN=BP13.F240.BP13A232,                                  00001690
//             DISP=SHR                                                 00001700
//SORTOUT  DD  DSN=&&BP13F240,                                          00001710
//             DISP=(NEW,PASS),                                         00001720
//             LIKE=BP13.F240.BP13A232                                  00001720
//SYSIN    DD  *                                                        00001760
    SORT FIELDS=(5,52,A),FORMAT=CH                                              
    SUM FIELDS=NONE                                                             
/*                                                                      00001770
//*--------------------------------------------------------------------         
//* REPRO INTO HISTORY VSAM FILES BEFORE DELETE                                 
//*--------------------------------------------------------------------         
//A232HIST EXEC PGM=IDCAMS                                                      
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=&&BP13F230,                                                   
//            DISP=(SHR,DELETE)                                                 
//OUTPUT1  DD DSN=BP13.K23H.FLATLIST.HIST,                                      
//            DISP=MOD                                                  00001720
//INPUT2   DD DSN=&&BP13F240,                                                   
//            DISP=(SHR,DELETE)                                         00001700
//OUTPUT2  DD DSN=BP13.K24H.HEADFLAT.HIST,                                      
//            DISP=MOD                                                  00001720
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1) REPLACE                               
   REPRO INFILE(INPUT2)  OUTFILE(OUTPUT2) REPLACE                               
/*                                                                      00001770
//*-------------------------------------------------------------------- 00002730
//*    DELETE DATASET                                                   00002740
//*-------------------------------------------------------------------- 00002750
//A232D1 EXEC    PGM=IDCAMS                                             00002760
//SYSPRINT DD  SYSOUT=*                                                 00002770
//SYSIN    DD  *                                                        00002780
    DEL   ('BP13.F222.BP13A232')                                                
    DEL   ('BP13.F230.BP13A232')                                                
    DEL   ('BP13.F240.BP13A232')                                                
/*                                                                      00002790
//ENDTESTA  ENDIF                                                       00002800
/*                                                                      00002810
//IFTESTB IF (S11.RC = 0) THEN                                          00003860
//*---------------------------------------------------------------------00001630
//* BACKUP FILES BEFORE DELETE                                          00001640
//*---------------------------------------------------------------------00001670
//A240B1  EXEC    SORT                                                  00001680
//SORTIN   DD  DSN=BP13.F230.BP13A240,                                  00001690
//             DISP=SHR                                                 00001700
//SORTOUT  DD  DSN=BP13.F998.BP13D206,                                  00001710
//             DISP=MOD                                                 00001720
//SYSIN    DD  *                                                        00001760
    SORT FIELDS=(1,450,A),FORMAT=CH                                             
    OUTREC FIELDS=(C'BP13F230',C'UPDATE',1,450,C'BP13A240',28X)                 
/*                                                                      00001770
//*-------------------------------------------------------------------- 00004810
//*    DELETE DATASET                                                   00004820
//*-------------------------------------------------------------------- 00004830
//A240D1 EXEC    PGM=IDCAMS                                             00004840
//SYSPRINT DD  SYSOUT=*                                                 00004850
//SYSIN    DD  *                                                        00004860
    DEL   ('BP13.F230.BP13A240')                                                
//ENDTESTB  ENDIF                                                       00004870
/*                                                                      00004880
//IFTESTC  IF (S12.RC = 0) THEN                                                 
//*---------------------------------------------------------------------        
//* BACKUP FILES BEFORE DELETE                                                  
//*---------------------------------------------------------------------        
//A270B1 EXEC    SORT                                                           
//SORTIN   DD  DSN=BP13.F222.BP13A270,                                          
//             DISP=SHR                                                         
//SORTOUT  DD  DSN=BP13.F998.BP13D206,                                          
//             DISP=MOD                                                         
//SYSIN    DD  *                                                                
    SORT FIELDS=(1,100,A),FORMAT=CH                                             
    OUTREC FIELDS=(C'BP13F222',C'UPDATE',1,100,350X,C'BP13A270',28X)            
/*                                                                              
//*-------------------------------------------------------------------- 00002020
//*    DELETE DATASET                                                   00002030
//*-------------------------------------------------------------------- 00002040
//A270D1 EXEC    PGM=IDCAMS                                             00002050
//SYSPRINT DD  SYSOUT=*                                                 00002060
//SYSIN    DD  *                                                        00002070
    DEL   ('BP13.F222.BP13A270')                                                
//ENDTESTC  ENDIF                                                       00002080
/*                                                                      00002090
//IFTESTD  IF (S13.RC = 0) THEN                                                 
//*---------------------------------------------------------------------        
//* BACKUP FILES BEFORE DELETE                                                  
//*---------------------------------------------------------------------        
//A271B1 EXEC    SORT                                                           
//SORTIN   DD  DSN=BP13.F222.BP13A271,                                          
//             DISP=SHR                                                         
//SORTOUT  DD  DSN=BP13.F998.BP13D206,                                          
//             DISP=MOD                                                         
//SYSIN    DD  *                                                                
    SORT FIELDS=(1,100,A),FORMAT=CH                                             
    OUTREC FIELDS=(C'BP13F222',C'UPDATE',1,100,350X,C'BP13A271',28X)            
/*                                                                              
//*-------------------------------------------------------------------- 00002020
//*    DELETE DATASET                                                   00002030
//*-------------------------------------------------------------------- 00002040
//A271D1 EXEC    PGM=IDCAMS                                             00002050
//SYSPRINT DD  SYSOUT=*                                                 00002060
//SYSIN    DD  *                                                        00002070
    DEL   ('BP13.F222.BP13A271')                                                
//ENDTESTD  ENDIF                                                       00002080
/*                                                                      00002090
//*-------------------------------------------------------------------*         
//* AUTO-OPEN FILES                                                   *         
//*-------------------------------------------------------------------*         
//STEP98   EXEC PGM=IKJEFT01,PARM='OPNFILE',COND=(0,NE)                         
//SYSTSPRT DD  SYSOUT=*                                                         
//SYSEXEC  DD  DSN=SYS3.SYSTEM.CLIST,DISP=SHR                                   
//GETJOBNW DD  SYSOUT=*                                                         
//SYSTSIN  DD  DUMMY                                                            
//*--------------------------------------------------------------------         
//********************** E N D  O F  J O B *************************            
//*-------------------------------------------------------------------*         
//* SEND MESSAGE TO OPERATOR TO OPEN FILES                            *         
//*-------------------------------------------------------------------*         
//STEP99   EXEC WTOG,COND=(0,NE)                                                
   ----> BP13D207 COMPLETED, PLS CHK GROUP AUTO-OPEN BP13E.                     
//*-------------------------------------------------------------------*         
//*    END OF JOB BP13D207                                              00006250
//*-------------------------------------------------------------------- 00006260
