//BP13Y713 JOB (BP13P),'BP13Y713',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//       NOTIFY=CSD0071                                                         
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//*--------------------------------------------------------------------         
//*      VERIFY FILES BEFORE DAILY PRODUCTION RUN                               
//*--------------------------------------------------------------------         
//STEP0A  EXEC PGM=IDCAMS,COND=(0,NE)                                           
//INPUT1   DD DSN=BP13.KD15.DBSSTP,DISP=OLD                                     
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN   DD *                                                                  
          VFY FILE(INPUT1)                                                      
//*=================================================================            
//* 1ST LETTER ON TOP LETTER FOR SURVET FEE/STAMP FEE, SEND OUT BY              
//* HDB                                                                         
//*=================================================================            
//*  PRT01 : 1 COPY                                                             
//*-----------------------------------------------------------------            
//PRT01    EXEC  PGM=IEBGENER                                                   
//SYSUT1   DD  *                                                                
1$DJDE$ BTEXT='DPT=GRPID-EAAL1A CP-1',END;                                      
1$DJDE$ JDE=BP13D,JDL=BP13,END;                                                 
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAAL1A                                     
//SYSUT2   DD  SYSOUT=J,OUTPUT=(*.FORMID),DEST=IOMJ                             
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//*                                                                             
//*-----------------------------------------------------------------            
//* COVERING LETTER BY SOU                                                      
//*-----------------------------------------------------------------            
//PRT04   EXEC PGM=IEBGENER                                                     
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAAL1D CP-1',END;                                      
//*1$DJDE$ JDE=13POT5,JDL=BP13,FORMS=BP13IA,END;                                
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAAL1D                                     
//SYSUT2   DD SYSOUT=J,OUTPUT=(*.FORMID),DEST=IOMJ                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*-----------------------------------------------------------------            
//* COVERING LETTER BY SOU                                                      
//*-----------------------------------------------------------------            
//PRT05   EXEC PGM=IEBGENER                                                     
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAAL1E CP-1',END;                                      
//*1$DJDE$ JDE=13POT5,JDL=BP13,FORMS=BP13KH,END;                                
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAAL1E                                     
//SYSUT2   DD SYSOUT=J,OUTPUT=(*.FORMID),DEST=IOMJ                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*---------------------------------------------------------------------        
//* SORT BY REGN INCLUDE                                                        
//* SCH-ACC-NO NOT = BLANK                                                      
//* LOAN-TAG = H                                                                
//* WTA = HDB                                                                   
//* DBS WITH DTE-BALLOT 200610 (SIM LIAN PROJECT)                               
//* 517 CASES FOR SIM LIAN, PROJ D01                                            
//*---------------------------------------------------------------------        
//STEP04   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K800.APPLN,DISP=SHR                                      
//SORTOUT  DD DSN=&&F800LOAN,DISP=(,PASS),                                      
//        UNIT=SYSDA,DCB=(RECFM=FB,LRECL=2000),                                 
//        SPACE=(CYL,(10,3),RLSE)                                               
//SYSIN    DD  *                                                                
  SORT FIELDS=(4,8,A),FORMAT=CH                                                 
  INCLUDE COND=(1,1,CH,NE,C'C',AND,                                             
                 51,3,CH,EQ,C'PRC',AND,                                         
                155,2,CH,NE,C'  ',AND,                                          
                924,3,CH,EQ,C'DBS',AND,                                         
                963,1,CH,EQ,C'H')                                               
//****          785,6,CH,EQ,C'201201',AND,                                      
//*---------------------------------------------------------------------        
//STEP01   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BM06.F120.FLATINV.PIDB,DISP=SHR                               
//SORTOUT  DD DSN=&&BM06F120,DISP=(,PASS),                                      
//        UNIT=SYSDA,DCB=(RECFM=FB,LRECL=700),                                  
//        SPACE=(CYL,(300,30),RLSE)                                             
//SYSIN    DD  *                                                                
  SORT FIELDS=(180,8,A),FORMAT=CH                                               
  INCLUDE COND=(12,11,CH,EQ,C'624N5  PH1 ')                                     
//*---------------------------------------------------------------------        
//* PRINT DBSS REPORT ON STAMP FEE/SURVEY FEE                                   
//*---------------------------------------------------------------------        
//STEP05    EXEC PGM=BP13CCA1,COND=(0,NE)                                       
//BP13F800  DD DSN=&&F800LOAN,DISP=(OLD,PASS)                                   
//BM06F120  DD DSN=&&BM06F120,DISP=(OLD,PASS)                                   
//SY02F001  DD DSN=SY02.F001.DATE,DISP=SHR                                      
//BP13KD00  DD DSN=BP13.KD00.DBSMAST,DISP=SHR,                                  
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13K820  DD DSN=BP13.K820.OCCUP,DISP=SHR,                                    
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13K830  DD DSN=BP13.K830.ADDR,DISP=SHR,                                     
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13K831  DD DSN=BP13.K830.ADDR.PATH1,DISP=SHR,                               
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13KD25  DD DSN=BP13.KD25.SURVEY,DISP=SHR,                                   
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13K022  DD DSN=BP13.K022.WISOIC,DISP=SHR,                                   
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13K021  DD DSN=BP13.K022.WISOIC.PATH1,DISP=SHR,                             
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13K024  DD DSN=BP13.K024.WISLAST,DISP=SHR,                                  
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13KD35  DD DSN=BP13.KD35.APPSCHDL,DISP=SHR,                                 
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13KD15  DD DSN=BP13.KD15.DBSSTP,DISP=SHR,                                   
//             AMP=('BUFNI=8','BUFND=4')                                        
//AB20K050  DD DSN=AB20.K050.PREMIUM,DISP=SHR,                                  
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13PCA1  DD SYSOUT=J,OUTPUT=(*.PRT04.FORMID),DEST=IOMJ                       
//BP13PCA2  DD SYSOUT=J,OUTPUT=(*.PRT05.FORMID),DEST=IOMJ                       
//BP13LCA1  DD SYSOUT=J,OUTPUT=(*.PRT01.FORMID),DEST=IOMJ                       
//SYSPRINT  DD SYSOUT=*                                                         
//SYSDBG    DD SYSOUT=*                                                         
//SYSDBOUT  DD SYSOUT=*                                                         
//SYSOUT    DD SYSOUT=*                                                         
//*                                                                             
//*---------------------------------------------------------------------        
//* SORT BY REGN INCLUDE                                                        
//* SCH-ACC-NO NOT = BLANK                                                      
//* LOAN-TAG = N                                                                
//* WTA = HDB                                                                   
//* DBS WITH DTE-BALLOT 200610 (SIM LIAN PROJECT)                               
//* 517 CASES FOR SIM LIAN, PROJ D01                                            
//*---------------------------------------------------------------------        
//STEP06   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K800.APPLN,DISP=SHR                                      
//SORTOUT  DD DSN=&&F800NOLN,DISP=(,PASS),                                      
//        UNIT=SYSDA,DCB=(RECFM=FB,LRECL=2000),                                 
//        SPACE=(CYL,(10,3),RLSE)                                               
//SYSIN    DD  *                                                                
  SORT FIELDS=(4,8,A),FORMAT=CH                                                 
  INCLUDE COND=(1,1,CH,NE,C'C',AND,                                             
                 51,3,CH,EQ,C'PRC',AND,                                         
                155,2,CH,NE,C'  ',AND,                                          
                924,3,CH,EQ,C'DBS',AND,                                         
                963,1,CH,EQ,C'N')                                               
//****          785,6,CH,EQ,C'201201',AND,                                      
//*---------------------------------------------------------------------        
//* PRINT DBSS REPORT ON STAMP FEE/SURVEY FEE                                   
//*---------------------------------------------------------------------        
//STEP07    EXEC PGM=BP13CCA1,COND=(0,NE)                                       
//BP13F800  DD DSN=&&F800NOLN,DISP=(OLD,PASS)                                   
//BM06F120  DD DSN=&&BM06F120,DISP=(OLD,PASS)                                   
//SY02F001  DD DSN=SY02.F001.DATE,DISP=SHR                                      
//BP13KD00  DD DSN=BP13.KD00.DBSMAST,DISP=SHR,                                  
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13K820  DD DSN=BP13.K820.OCCUP,DISP=SHR,                                    
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13K830  DD DSN=BP13.K830.ADDR,DISP=SHR,                                     
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13K831  DD DSN=BP13.K830.ADDR.PATH1,DISP=SHR,                               
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13KD25  DD DSN=BP13.KD25.SURVEY,DISP=SHR,                                   
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13K022  DD DSN=BP13.K022.WISOIC,DISP=SHR,                                   
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13K021  DD DSN=BP13.K022.WISOIC.PATH1,DISP=SHR,                             
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13K024  DD DSN=BP13.K024.WISLAST,DISP=SHR,                                  
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13KD35  DD DSN=BP13.KD35.APPSCHDL,DISP=SHR,                                 
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13KD15  DD DSN=BP13.KD15.DBSSTP,DISP=SHR,                                   
//             AMP=('BUFNI=8','BUFND=4')                                        
//AB20K050  DD DSN=AB20.K050.PREMIUM,DISP=SHR,                                  
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13PCA1  DD SYSOUT=J,OUTPUT=(*.PRT04.FORMID),DEST=IOMJ                       
//BP13PCA2  DD SYSOUT=J,OUTPUT=(*.PRT05.FORMID),DEST=IOMJ                       
//BP13LCA1  DD SYSOUT=J,OUTPUT=(*.PRT01.FORMID),DEST=IOMJ                       
//SYSPRINT  DD SYSOUT=*                                                         
//SYSDBG    DD SYSOUT=*                                                         
//SYSDBOUT  DD SYSOUT=*                                                         
//SYSOUT    DD SYSOUT=*                                                         
//*                                                                             
