//BP13A633 JOB (BP13P),'BP13A633',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//             NOTIFY=CSD0071                                                   
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,DISP=SHR                                  
//*=====================================================================        
//* CHGE REQ  BY  DDMMCCYY DESCRIPTION                                          
//* -------- ---- -------- --------------------------------------------         
//* BP134581 SMR2 09072012 NEW JCL                                              
//* BP134718 SMR2 14122012 INCLUDE BP13CF10 - SPLIT CASES W/ & W/O EMAIL        
//* BP134782 IL5  26022013 ENHANCE TO REMOVE PRT REFERENCE FROM PGM             
//*                        BP13CF10                                             
//*=====================================================================        
//*--------------------------------------------------------------------         
//* DELETE DATASETS                                                             
//*--------------------------------------------------------------------         
//STEP00 EXEC  PGM=IDCAMS                                                       
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  *                                                                
    DEL   ('BP13.F740.ETHNIC.A633')                                             
    DEL   ('BP13.F740.ETHNIC.A633.EMAIL')                                       
    DEL   ('BP13.F740.ETHNIC.A633.NOEMAIL')                                     
    DEL   ('BP13.L567.REPORT.A633')                                             
         IF MAXCC < 12 THEN                                                     
            SET MAXCC = 0                                                       
/*                                                                              
//*---------------------------------------------------------------------        
//* INCLUDE NUM-OPTION = 'C1','C2','C3'                                         
//*---------------------------------------------------------------------        
//STEP01 EXEC  SORT,COND=(0,NE)                                                 
//SYSPRINT DD  SYSOUT=*                                                         
//SORTIN   DD  DSN=BP13.K205.CTLREC,DISP=SHR                                    
//SORTOUT  DD  DSN=&&BP13F205,DISP=(NEW,PASS),                                  
//             SPACE=(CYL,(2,1),RLSE),                                          
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=0)                                
//SYSIN    DD *                                                                 
    SORT FIELDS=(1,15,CH,A)                                                     
    INCLUDE COND=(14,2,CH,EQ,C'C1',OR,14,2,CH,EQ,C'C2',OR,                      
                  14,2,CH,EQ,C'C3')                                             
/*                                                                              
//*---------------------------------------------------------------------        
//* SORT BY NT, FT, CATG, QUEUE                                                 
//*---------------------------------------------------------------------        
//STEP02 EXEC  SORT,COND=(0,NE)                                                 
//SYSPRINT DD  SYSOUT=*                                                         
//SORTIN   DD  DSN=BP13.K740.MATUREBA,DISP=SHR                                  
//SORTOUT  DD  DSN=&&BP13F740,DISP=(NEW,PASS),                                  
//             SPACE=(CYL,(5,2),RLSE),                                          
//             DCB=(RECFM=FB,LRECL=500,BLKSIZE=0)                               
//SYSIN    DD *                                                                 
    SORT FIELDS=(187,3,A,211,2,A,225,1,A,235,5,A),FORMAT=CH                     
/*                                                                              
//*---------------------------------------------------------------------        
//* EXTRACT RECORDS WITHIN THE QUEUE RANGE FROM BP13K205                        
//*---------------------------------------------------------------------        
//STEP03 EXEC  PGM=BP13CF57,COND=(0,NE)                                         
//BP13F205 DD  DSN=&&BP13F205,DISP=(SHR,PASS)                                   
//BP13F740 DD  DSN=&&BP13F740,DISP=(SHR,PASS)                                   
//BP13F74A DD  DSN=BP13.F740.ETHNIC.A633,DISP=(NEW,CATLG),                      
//             DCB=(LRECL=500,RECFM=FB,BLKSIZE=27500),                          
//             SPACE=(CYL,(5,2),RLSE)                                           
//SYSPRINT DD  SYSOUT=*                                                         
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
/*                                                                              
//*-----------------------------------------------------------------*           
//* TO SEPERATE CASES WITH & WITHOUT EMAIL ADDRESS                  *           
//*-----------------------------------------------------------------*           
//STEP03A  EXEC PGM=BP13CF10,COND=(0,NE)                                        
//BP13F740 DD DSN=BP13.F740.ETHNIC.A633,DISP=SHR                                
//BP13K857 DD DSN=BP13.K857.EMAIL,DISP=SHR                                      
//BP13K825 DD DSN=BP13.K825.REQOCCP.PREV,DISP=SHR                               
//BP13K830 DD DSN=BP13.K830.ADDR,DISP=SHR                                       
//BP13K831 DD DSN=BP13.K830.ADDR.PATH1,DISP=SHR                                 
//P13F740A DD DSN=BP13.F740.ETHNIC.A633.NOEMAIL,DISP=(NEW,CATLG),               
//            DCB=(LRECL=500,RECFM=FB,BLKSIZE=27500),                           
//            SPACE=(CYL,(5,2),RLSE)                                            
//P13F740B DD DSN=BP13.F740.ETHNIC.A633.EMAIL,DISP=(NEW,CATLG),                 
//            DCB=(LRECL=500,RECFM=FB,BLKSIZE=27500),                           
//            SPACE=(CYL,(5,2),RLSE)                                            
//P13LCF10 DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*---------------------------------------------------------------------        
//* SORT BY NEW TOWN, FLAT TYPE, ETHNIC GROUP, QUEUE POS, REG NO                
//*---------------------------------------------------------------------        
//STEP04 EXEC  SORT,COND=(0,NE)                                                 
//SYSPRINT DD  SYSOUT=*                                                         
//SORTIN   DD  DSN=BP13.F740.ETHNIC.A633,DISP=SHR                               
//SORTOUT  DD  DSN=&&BP13F74B,DISP=(NEW,PASS),                                  
//             SPACE=(CYL,(5,2),RLSE),                                          
//             DCB=(RECFM=FB,LRECL=500,BLKSIZE=0)                               
//SYSIN    DD *                                                                 
    SORT FIELDS=(187,3,A,211,2,A,225,1,A,235,5,A,123,8,A),FORMAT=CH             
/*                                                                              
//*---------------------------------------------------------------------        
//* PRINT EIP RESULT REPORT                                                     
//*---------------------------------------------------------------------        
//STEP05 EXEC  SAS,COND=(0,NE)                                                  
//WORK     DD  UNIT=SYSDA,SPACE=(CYL,(10,5))                                    
//BP13F74B DD  DSN=&&BP13F74B,DISP=(SHR,PASS)                                   
//BP13S567 DD  DSN=BP13.L567.REPORT.A633,DISP=(NEW,CATLG),                      
//             DCB=(LRECL=133,RECFM=FBA,BLKSIZE=27930),                         
//             SPACE=(CYL,(5,2),RLSE)                                           
//SYSIN    DD  DSN=BP13.BATCH.SRC(BP13S567),DISP=SHR                            
/*                                                                              
