//BP13A236 JOB (BP13P),'BP13A236',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),    00000010
//             NOTIFY=CSD0071                                           00000020
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,                                  00000040
//             DISP=SHR                                                 00000050
//* ====================================================================00000060
//* CHG-NO   BY    ON        DESCRIPTION                                00000070
//* ======== === ==========  ===========                                00000080
//* BP132205 LMS 30/08/2002  NEW JCL                                    00000090
//* BP132278 JF4 28/03/2003  CHGE BP13F230/F240 LRECL TO 450.           00000100
//* BP132725 LMS 22/07/2005  ADD PROGRAM BP13C22V.                      00000110
//* BP133610 ESA102/06/2009  TO REPLACE BP13K767 WITH BP13K816                  
//* BP133724 DW5 06/11/2009  CATER FOR EQMS                                     
//* BP133851 ESA112/03/2010  TO ADD READING OF BP13KQ30 IN BP13C227             
//* BP134086 ESD130/12/2010  CATER TO STOP SENDING TXT TO MEDIACORP             
//*                          PERMANENTLY.                                       
//* BP134521 ESA104/05/2012  TO ADD READING OF BM06K100 IN BP13C227             
//* BP134587 ESA102/07/2012  TO ADD READING OF BP13KQ50 IN BP13C227             
//*---------------------------------------------------------------------00000120
//*-------------------------------------------------------------------- 00000130
//*      VERIFY FILES BEFORE DAILY PRODUCTION RUN                       00000140
//*-------------------------------------------------------------------- 00000150
//STEP01 EXEC    PGM=IDCAMS                                             00000160
//INPUT1   DD  DSN=BP13.K254.START.END.POSTDATE,                        00000170
//             DISP=OLD                                                 00000180
//INPUT2   DD  DSN=BP13.K255.START.END,                                 00000190
//             DISP=OLD                                                 00000200
//SYSPRINT DD  SYSOUT=*                                                 00000210
//SYSIN    DD  *                                                        00000220
          VFY FILE(INPUT1)                                                      
          VFY FILE(INPUT2)                                                      
          IF LASTCC=12 THEN DO                                                  
             SET MAXCC=0                                                        
             VFY FILE(INPUT1)                                                   
             VFY FILE(INPUT2)                                                   
          END                                                                   
/*                                                                      00000230
//*---------------------------------------------------------------------00000240
//* TO UPDATE BP13K255 - START AND END DATES OF BOOKING EXERCISE        00000250
//*---------------------------------------------------------------------00000260
//STEP00 EXEC    PGM=BP13C22V,COND=(0,NE)                               00000270
//BP13K254 DD  DSN=BP13.K254.START.END.POSTDATE,                        00000280
//             DISP=SHR                                                 00000290
//BP13K255 DD  DSN=BP13.K255.START.END,                                 00000300
//             DISP=SHR                                                 00000310
//SYSOUT   DD  SYSOUT=*                                                 00000320
//SYSTSPRT DD  SYSOUT=*                                                 00000330
//SYSPRINT DD  SYSOUT=*                                                 00000340
//SYSDBG   DD  SYSOUT=*                                                 00000350
//*---------------------------------------------------------------------00000360
//* SORT EST/N/C/BLK, FLAT-TYPE ORDER                                   00000370
//*---------------------------------------------------------------------00000380
//STEP01 EXEC    SORT,COND=(0,NE)                                       00000390
//SORTIN   DD  DSN=BM06.F800.ALLOUNIT,                                  00000400
//             DISP=SHR                                                 00000410
//SORTOUT  DD  DSN=&&BM06F800,                                          00000420
//             DISP=(NEW,PASS),                                         00000430
//             UNIT=SYSDA,                                              00000440
//             SPACE=(CYL,(30,5),RLSE),                                 00000450
//             DCB=(BLKSIZE=0,LRECL=800,RECFM=FB)                       00000460
//SYSIN    DD  *                                                        00000470
     SORT FIELDS=(559,2,A,546,2,A,291,8,A,544,2,A,23,5,A,1,11,A),               
          FORMAT=CH                                                             
     SUM FIELDS=NONE                                                            
/*                                                                      00000480
//*---------------------------------------------------------------------00000490
//* REFORMAT THE FLATLIST FILE TO INTV FILE FORMAT                      00000500
//*---------------------------------------------------------------------00000510
//STEP02 EXEC    PGM=BP13C227,COND=(0,NE)                               00000520
//BM06F800 DD  DSN=&&BM06F800,                                          00000530
//             DISP=(OLD,PASS)                                          00000540
//BP13F205 DD  DSN=BP13.F205.ADFTREC,                                   00000550
//             DISP=SHR                                                 00000560
//BM06K510 DD  DSN=BM06.K510.ESTCDE,                                    00000570
//             DISP=SHR                                                 00000580
//BM06K100 DD  DSN=BM06.K100.BLOCK,                                     00000570
//             DISP=SHR                                                 00000580
//BP13K060 DD  DSN=BP13.K060.CODETAB,                                   00000590
//             DISP=SHR                                                 00000600
//BP13K222 DD  DSN=BP13.K222.SUMALLOC,                                  00000610
//             DISP=SHR                                                 00000620
//BP13K270 DD  DSN=BP13.K270.BOOKPGM,                                   00000630
//             DISP=SHR                                                 00000640
//BP13K813 DD  DSN=BP13.K813.BTOBE,                                     00000650
//             DISP=SHR                                                 00000660
//BP13KQ30 DD  DSN=BP13.KQ30.PAIR,                                      00000650
//             DISP=SHR                                                 00000660
//BP13KQ31 DD  DSN=BP13.KQ30.PAIR.PATH1,                                00000650
//             DISP=SHR                                                 00000660
//BP13KQ50 DD  DSN=BP13.KQ50.GROUNIT,                                           
//             DISP=SHR                                                         
//BP13F230 DD  DSN=&&P13F230A,                                          00000670
//             DISP=(NEW,PASS),                                         00000680
//             UNIT=SYSDA,                                              00000690
//             SPACE=(CYL,(5,3),RLSE),                                  00000700
//             DCB=(BLKSIZE=0,LRECL=450,RECFM=FB)                       00000710
//P13F230B DD  DSN=&&P13F230B,                                          00000720
//             DISP=(NEW,PASS),                                         00000730
//             UNIT=SYSDA,                                              00000740
//             SPACE=(CYL,(5,3),RLSE),                                  00000750
//             DCB=(BLKSIZE=0,LRECL=450,RECFM=FB)                       00000760
//SYSDBG   DD  SYSOUT=*                                                 00000770
//SYSDBOUT DD  SYSOUT=*                                                 00000780
//SYSOUT   DD  SYSOUT=*                                                 00000790
/*                                                                      00000800
//*---------------------------------------------------------------------00000810
//*   REPRO FROM BP13F230 TO SEQUENTIAL BACKUP FILE                     00000820
//*---------------------------------------------------------------------00000830
//STEP03 EXEC    PGM=IDCAMS,COND=(0,NE)                                 00000840
//SYSPRINT DD  SYSOUT=*                                                 00000850
//INPUT    DD  DSN=BP13.F230.FLATLIST.ADHOC,                            00000860
//             DISP=SHR                                                 00000870
//OUTPUT   DD  DSN=BP13.F230.FLATLIST.ADHOC.BACKUP(+1),                 00000880
//             DISP=(NEW,CATLG),                                        00000890
//             SPACE=(CYL,(2,1),RLSE),                                  00000900
//             DCB=(BP13.GDG,BLKSIZE=0,LRECL=130,RECFM=FB)              00000910
//INPUT1   DD  DSN=BP13.F230.STARTEND.ADHOC,                            00000920
//             DISP=SHR                                                 00000930
//OUTPUT1  DD  DSN=BP13.F230.STARTEND.ADHOC.BACKUP(+1),                 00000940
//             DISP=(NEW,CATLG),                                        00000950
//             SPACE=(CYL,(2,1),RLSE),                                  00000960
//             DCB=(BP13.GDG,BLKSIZE=0,LRECL=130,RECFM=FB)              00000970
//SYSIN    DD  *                                                        00000980
     REPRO INFILE(INPUT)  OUTFILE(OUTPUT)                                       
     REPRO INFILE(INPUT1) OUTFILE(OUTPUT1)                                      
/*                                                                      00000990
//*---------------------------------------------------------------------00001000
//* SORT EST/N/C/BLK, FLAT-TYPE ORDER (TO INCLUDE INTV05 ONLY)          00001010
//*---------------------------------------------------------------------00001020
//STEP04 EXEC    SORT,COND=(0,NE)                                       00001030
//SORTIN   DD  DSN=&&P13F230B,                                          00001040
//             DISP=(SHR,PASS)                                          00001050
//SORTOUT  DD  DSN=&&P13F230D,                                          00001060
//             DISP=(NEW,PASS),                                         00001070
//             UNIT=SYSDA,                                              00001080
//             SPACE=(CYL,(5,3),RLSE),                                  00001090
//             DCB=(BLKSIZE=0,LRECL=450,RECFM=FB)                       00001100
//SYSIN    DD  *                                                        00001110
     SORT FIELDS=(7,3,A,10,10,A,20,20,A,40,2,A),FORMAT=CH                       
     INCLUDE COND=(5,2,CH,EQ,C'05')                                             
     SUM FIELDS=NONE                                                            
/*                                                                      00001120
//*---------------------------------------------------------------------00001130
//* EDIT RECORDS WITH NUM-SELECTION = '3R ' (FOR RECID = '01' '02' '03')00001140
//*---------------------------------------------------------------------00001150
//STEP05 EXEC    PGM=BP13C279,COND=(0,NE)                               00001160
//BP13F230 DD  DSN=&&P13F230D,                                          00001170
//             DISP=(SHR,PASS)                                          00001180
//P13F230O DD  DSN=BP13.F230.STARTEND.ADHOC,                            00001190
//             DISP=SHR                                                 00001200
//SYSDBG   DD  SYSOUT=*                                                 00001210
//SYSDBOUT DD  SYSOUT=*                                                 00001220
//SYSOUT   DD  SYSOUT=*                                                 00001230
/*                                                                      00001240
//*---------------------------------------------------------------------00001250
//* SORT EST/N/C/BLK, FLAT-TYPE ORDER                                   00001260
//*---------------------------------------------------------------------00001270
//STEP06 EXEC    SORT,COND=(0,NE)                                       00001280
//SORTIN   DD  DSN=&&P13F230A,                                          00001290
//             DISP=(SHR,DELETE)                                        00001300
//SORTOUT  DD  DSN=&&P13F230C,                                          00001310
//             DISP=(NEW,PASS),                                         00001320
//             UNIT=SYSDA,                                              00001330
//             SPACE=(CYL,(5,3),RLSE),                                  00001340
//             DCB=(BLKSIZE=0,LRECL=450,RECFM=FB)                       00001350
//SYSIN    DD  *                                                        00001360
     SORT FIELDS=(7,8,A,97,10,A,30,27,A,5,2,A,59,5,A,57,2,A),FORMAT=CH          
/*                                                                      00001370
//*---------------------------------------------------------------------00001380
//* EDIT RECORDS WITH NUM-SELECTION = '3R ' (FOR RECID = '05')          00001390
//*---------------------------------------------------------------------00001400
//STEP07 EXEC    PGM=BP13C279,COND=(0,NE)                               00001410
//BP13F230 DD  DSN=&&P13F230C,                                          00001420
//             DISP=(SHR,PASS)                                          00001430
//P13F230O DD  DSN=BP13.F230.FLATLIST.ADHOC,                            00001440
//             DISP=SHR                                                 00001450
//SYSDBG   DD  SYSOUT=*                                                 00001460
//SYSDBOUT DD  SYSOUT=*                                                 00001470
//SYSOUT   DD  SYSOUT=*                                                 00001480
/*                                                                      00001490
//*---------------------------------------------------------------------00001610
//*  TO REPLACE RECORDS IN FILE                                         00001620
//*-------------------------------------------------------------------- 00001630
//STEP10 EXEC    PGM=IDCAMS,COND=(0,NE)                                 00001640
//SYSPRINT DD  SYSOUT=*                                                 00001650
//INPUT1   DD  DSN=BP13.F230.FLATLIST.ADHOC,                            00001660
//             DISP=SHR                                                 00001670
//OUTPUT1  DD  DSN=BP13.F230.FLATLIST.START,                            00001680
//             DISP=SHR                                                 00001690
//SYSIN    DD  *                                                        00001700
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
//*---------------------------------------------------------------------00001710
//*     TO CLEAR FILE                                                   00001720
//*---------------------------------------------------------------------00001730
//STEP11 EXEC    PGM=IEBGENER,COND=(0,NE)                               00001740
//SYSPRINT DD  SYSOUT=*                                                 00001750
//SYSUT1   DD  DSN=NULLFILE,                                            00001760
//             DCB=BP13.F230.FLATLIST.SENDALL                           00001770
//SYSUT2   DD  DSN=BP13.F230.FLATLIST.SENDALL,                          00001780
//             DISP=OLD                                                 00001790
//SYSIN    DD  DUMMY                                                    00001800
//IFTEST IF (STEP07.RC = 0) THEN                                        00004810
//*---------------------------------------------------------------------00004920
//*  ACCUMULATE THE CONTROL REC INTO CTLREC-ACC FILE                    00004930
//*---------------------------------------------------------------------00004940
//STEP14 EXEC    PGM=IDCAMS                                             00004950
//SYSPRINT DD  SYSOUT=*                                                 00004960
//INPUT1   DD  DSN=BP13.F205.ADFTREC,                                   00004970
//             DISP=SHR                                                 00004980
//OUTPUT1  DD  DSN=BP13.F205.ACCUM,                                     00004990
//             DISP=MOD                                                 00005000
//SYSIN    DD  *                                                        00005010
      REPRO INFILE(INPUT1) OUTFILE(OUTPUT1)                                     
/*                                                                      00005020
//*---------------------------------------------------------------------00005030
//*  TO CLEAR UP DATASET                                                00005040
//*---------------------------------------------------------------------00005050
//STEP15 EXEC    PGM=IDCAMS                                             00005060
//SYSPRINT DD  SYSOUT=*                                                 00005070
//INPUT1   DD  DUMMY                                                    00005080
//OUTPUT1  DD  DSN=BP13.F205.ADFTREC,                                   00005090
//             DISP=OLD                                                 00005100
//SYSIN    DD  *                                                        00005110
      REPRO INFILE(INPUT1) OUTFILE(OUTPUT1)                                     
/*                                                                      00005120
//ENDTEST  ENDIF                                                        00005130
//*-------------------------------------------------------------------- 00005140
//*   END OF BP13A236                                                   00005150
//*-------------------------------------------------------------------- 00005160
