//BP13M729 JOB (BP13P),'BP13M729',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),    00000010
//         NOTIFY=CSD0071                                               00000020
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,DISP=SHR                          00000040
//*====================================================================         
//* CREATE DEBARMENT REC AFTER SIGNING S&P FOR TAKING HDB LOAN (Z1)             
//* AND CREDIT ASSESSMENT (CA)                                                  
//*====================================================================         
//* BP133070 210807 LSB NEW JOB TO DEBAR DBSS FLAT Z1, CA                       
//* BP133091 151207 LMS EXPANSION OF BP13KD00 FROM 1200 TO 1600                 
//* BP135171 110214 RJE TO CATER FOR DB2 UPGRADE                                
//*====================================================================         
//******************************************************************            
//*  SEND DYNAMIC JDE AHEAD OF THE PRINT DATASET - MA&B UNIT                    
//*-----------------------------------------------------------------            
//PRT01   EXEC PGM=IEBGENER                                                     
//SYSUT1   DD *                                                                 
$DJDE$ JDE=BP13D,JDL=BP13,COPIES=1,END;                                         
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAAACO                                     
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*-------------------------------------------------------------------*         
//* REBUILD VSAM FILE BP13.K010.DEBAR                                 *         
//*-------------------------------------------------------------------*         
//STEP01   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.BLANK.CHAR300,DISP=OLD                                   
//SYSIN    DD  *                                                                
          DEL (BP13.K010.DEBAR) CL PURGE                                        
          DEF CLUSTER                                -                          
              (NAME(BP13.K010.DEBAR)                -                           
              CYL(50 10)                             -                          
              STORCLAS(PRODRLS)                      -                          
              LOG(NONE)                              -                          
              UNIQUE                                 -                          
              SHR(2 3))                              -                          
            DATA                                     -                          
              (NAME(BP13.K010.DEBAR.DATA)           -                           
              KEYS(44 0)                             -                          
              RECSZ(300 300)                         -                          
              CISZ(8192)                             -                          
              FSPC(10 10))                           -                          
            INDEX                                    -                          
              (NAME(BP13.K010.DEBAR.INDEX)           -                          
              CISZ(8192))                                                       
      IF MAXCC = 0 THEN                              -                          
         REPRO IFILE(INPUT1)                         -                          
               ODS(BP13.K010.DEBAR)                                             
//*-----------------------------------------------------------------            
//* OUTREC F410 FROM BP13KD00 TO CREATE DEBARMENT REC                           
//* OUTREC LOAN-GRANTED, DTE-SNP-SIGNED                                         
//*-----------------------------------------------------------------            
//STEP02   EXEC SORT,CYL=30,COND=(0,NE)                                         
//SORTIN   DD DSN=BP13.KD00.DBSMAST,DISP=SHR                                    
//SORTOUT  DD DSN=&&BP13F410,DISP=(,PASS),                                      
//            SPACE=(CYL,(20,5),RLSE),                                          
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                               
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,8,A),FORMAT=CH                                                 
  INCLUDE COND=(289,7,CH,GT,C'0000000')                                         
  OUTREC FIELDS=(1,8,645X,289,9,176X,1037,8,1154X)                              
//*-------------------------------------------------------------------*         
//* TAG DEBARMENT FOR NUM-CA-TAG = CA, CD                             *         
//*-------------------------------------------------------------------*         
//STEP03   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K               
//BP13F410 DD DSN=&&BP13F410,DISP=(OLD,PASS)                                    
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//   AMP=('BUFND=23')                                                           
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR,                                     
//   AMP=('BUFND=23')                                                           
//BP04K010 DD DSN=BP13.K010.DEBAR,DISP=SHR                                      
//BP13K665 DD DSN=BP13.K665.DEBARREF.SOC,DISP=SHR                               
//BP13L631 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSPRINT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSTSIN DD *                                                                  
 DSN SYSTEM(DSN)                                                                
  RUN PROGRAM(BP13C631) PLAN(BP13PCC) -                                         
     LIB('BP13.BATCH.LOADCOB')                                                  
 END                                                                            
//*-----------------------------------------------------------------            
//* INCLUDE LOAN GRANTED > ZEROS                                                
//*-----------------------------------------------------------------            
//STEP04   EXEC SORT,CYL=30,COND=(0,NE)                                         
//SORTIN   DD DSN=BP13.KD00.DBSMAST,DISP=SHR                                    
//SORTOUT  DD DSN=&&BP13FD00,DISP=(,PASS),                                      
//         DCB=(RECFM=FB,LRECL=1600,BLKSIZE=0),                                 
//         SPACE=(CYL,(5,3),RLSE)                                               
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,8,A),FORMAT=CH                                                 
  INCLUDE COND=(289,7,CH,GT,C'0000000')                                         
//*---------------------------------------------------------------------        
//* TAG Z1(APPLICANT) Z2(SPOUSE) FOR TAKING HDB LOAN                            
//*---------------------------------------------------------------------        
//STEP05   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K               
//BP13FD00 DD DSN=&&BP13FD00,DISP=(OLD,PASS)                                    
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//         AMP=('BUFND=8','BUFNI=4')                                            
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR,                                     
//         AMP=('BUFND=8','BUFNI=4')                                            
//BP04K010 DD DSN=BP13.K010.DEBAR,DISP=SHR                                      
//BP13K665 DD DSN=BP13.K665.DEBARREF.SOC,DISP=SHR                               
//BP13LC84 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//P13LC84B DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSPRINT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSTSIN DD *                                                                  
 DSN SYSTEM(DSN)                                                                
  RUN PROGRAM(BP13CC84) PLAN(BP13PCC) -                                         
     LIB('BP13.BATCH.LOADCOB')                                                  
 END                                                                            
/*                                                                              
//*-------------------------------------------------------------------*         
//* SORT K010 TO F010 FOR DEBARMENT SYSTEM                            *         
//*-------------------------------------------------------------------*         
//STEP06   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K010.DEBAR,DISP=SHR                                      
//SORTOUT  DD DSN=BP13.F010.DEBAR.SOC,DISP=MOD                                  
//SYSIN   DD *                                                                  
    SORT FIELDS=(1,44,A),FORMAT=CH                                              
    INCLUDE COND=(34,2,CH,NE,C'XX')                                             
//*                                                                             
