//BP13AY07 JOB (BP13P),'BP13AY07',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//         NOTIFY=CSD0071                                                       
//JOBLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                    
//*===================================================================          
//* CHG-NO   BY   ON                                                            
//*-------------------------------------------                                  
//* BP133641 LSB  250809 - SORT K618 BY DTE-OPEN-BTO/NT                         
//* BP133712 PCL3 300909 - ADD BP13CY42                                         
//* BP133728 LSB  251109 - ADD P13F730B TO BP13CY02                             
//* BP133891 LSB  180510 - ADD BP13F205 TO BP13CY02                             
//* BP134875 LSB  240413 - CHG BP13CY38, BP13S077                               
//* BP135251 LSB  140514 - CHG BP13K816 TO BP13K813                             
//*===================================================================          
//* REPORT ON TAKE UP RATE FOR BE/BTO, UNIT OFFER, NON-SELECTION                
//*===================================================================          
//*  PRT01 : 1 COPY                      MPU UNIT                               
//*-----------------------------------------------------------------            
//PRT01    EXEC  PGM=IEBGENER                                                   
//SYSUT1   DD  *                                                                
$DJDE$ JDE=BP13D,JDL=BP13,END;                                                  
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAMPPA1A                                   
//SYSUT2   DD  SYSOUT=2,OUTPUT=(*.FORMID)                                       
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//*                                                                             
//*-----------------------------------------------------------------            
//* INCLUDE OPTION = 07 (TRANS-CD= Y7)                                          
//*-----------------------------------------------------------------            
//STEP01   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K205.CTLREC,DISP=SHR                                     
//SORTOUT  DD DSN=&&BP13F205,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(1,1),RLSE),                                
//            DCB=(LRECL=80,RECFM=FB)                                           
//SYSIN    DD *                                                                 
  SORT FIELDS=(1,15,A),FORMAT=CH                                                
  INCLUDE COND=(14,2,CH,EQ,C'Y7')                                               
//*-----------------------------------------------------------------            
//* INCLUDE BE/BTO/SBF REQUESTS FROM BALLOT HISTORY FILE                        
//*-----------------------------------------------------------------            
//STEP02   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K595.BALLOT.LOG,DISP=SHR,                                
//         AMP=('BUFND=4','BUFNI=8')                                            
//SORTOUT  DD DSN=&&F595HIST,DISP=(NEW,PASS),                                   
//            UNIT=(SYSDA,3),SPACE=(CYL,(250,30),RLSE),                         
//            DCB=(LRECL=500,RECFM=FB)                                          
//SYSIN    DD *                                                                 
  SORT FIELDS=(123,8,A),FORMAT=CH                                               
  INCLUDE COND=(260,1,CH,NE,C' ',AND,                                           
                334,6,CH,GE,C'200805',AND,                                      
               (376,3,CH,EQ,C'BE ',OR,376,3,CH,EQ,C'BTO',OR,                    
                376,3,CH,EQ,C'SBF'))                                            
//*-----------------------------------------------------------------            
//* EXTRACT BP13F595 BASED ON END-QTR-DATE                                      
//*---------------------------------------------------------------------        
//STEP03   EXEC PGM=BP13CY64,COND=(0,NE)                                        
//BP13F595 DD  DSN=&&F595HIST,DISP=(OLD,PASS)                           00230000
//BP13F205 DD DSN=&&BP13F205,DISP=(OLD,PASS)                                    
//P13F595A DD DSN=&&F595SP05,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(150,30),RLSE),                             
//            DCB=(LRECL=500,RECFM=FB)                                          
//P13F595B DD DSN=&&F595CY64,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(150,30),RLSE),                             
//            DCB=(LRECL=500,RECFM=FB)                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//*-----------------------------------------------------------------            
//* UPDATE BOOKING PROFILE FOR ALL CASES, COUNT NON-SELECTION                   
//* COUNT PAST REQUEST                                                          
//* FOR GRO CASE, MOVE 'WF' TOI F730-BOOK-STATUS                                
//*--------------------------------------------------------------------         
//STEP04   EXEC PGM=BP13CY38,COND=(0,NE)                                        
//BP13F205 DD DSN=&&BP13F205,DISP=(OLD,PASS)                                    
//BP13F730 DD DSN=&&F595CY64,DISP=(OLD,PASS)                                    
//BP13K813 DD DSN=BP13.K813.BTOBE,DISP=SHR                                      
//BP13KH12 DD DSN=BP13.KH12.NOTBKCNT.HISTORY,DISP=SHR,                          
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K595 DD DSN=BP13.K595.BALLOT.LOG,DISP=SHR,                                
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K591 DD DSN=BP13.K595.BALLOT.LOG.PATH1,DISP=SHR,                          
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K592 DD DSN=BP13.K595.BALLOT.LOG.PATH2,DISP=SHR,                          
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K593 DD DSN=BP13.K595.BALLOT.LOG.PATH3,DISP=SHR,                          
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K594 DD DSN=BP13.K595.BALLOT.LOG.PATH4,DISP=SHR,                          
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13FH13 DD DSN=BP13.FH13.BKFLAT,DISP=SHR                                     
//SYSPRINT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//*-----------------------------------------------------------------            
//* OMIT NT = BLANK                                                             
//*-----------------------------------------------------------------            
//STEP05  EXEC SORT,COND=(0,NE)                                                 
//SORTIN   DD DSN=BP13.FH13.BKFLAT,DISP=SHR                                     
//SORTOUT  DD DSN=&&BP13FH13,DISP=(,PASS),                                      
//            UNIT=SYSDA,                                                       
//            DCB=(BLKSIZE=0,LRECL=200,RECFM=FB),                               
//            SPACE=(CYL,(20,10),RLSE)                                          
//SYSIN    DD *                                                                 
  SORT FIELDS=(19,3,A,15,2,A,9,6,A),FORMAT=CH                                   
  OMIT COND=(19,3,CH,EQ,C'   ')                                                 
//*-----------------------------------------------------------------            
//* PRINT BOOKING PROFILE, TAKE-UP RATE NON-SELN                                
//*-----------------------------------------------------------------            
//STEP06   EXEC SAS,COND=(0,NE)                                                 
//WORK     DD UNIT=SYSDA,SPACE=(CYL,(60,20))                                    
//BP13FH13 DD DSN=&&BP13FH13,DISP=(OLD,PASS)                                    
//BP13K813 DD DSN=BP13.K813.BTOBE,DISP=SHR                                      
//P13F077A DD DSN=BP13.FH13.BKFLAT.REPORTA,DISP=SHR                             
//P13F077B DD DSN=BP13.FH13.BKFLAT.REPORTB,DISP=SHR                             
//P13F077C DD DSN=BP13.FH13.BKFLAT.REPORTC,DISP=SHR                             
//P13F077D DD DSN=BP13.FH13.BKFLAT.REPORTD,DISP=SHR                             
//P13F077E DD DSN=BP13.FH13.BKFLAT.REPORTE,DISP=SHR                             
//P13L077A DD DSN=BP13.L077.P13L077A,DISP=SHR                                   
//P13L077B DD DSN=BP13.L077.P13L077B,DISP=SHR                                   
//P13L077C DD DSN=BP13.L077.P13L077C,DISP=SHR                                   
//P13L077D DD DSN=BP13.L077.P13L077D,DISP=SHR                                   
//P13L077E DD DSN=BP13.L077.P13L077E,DISP=SHR                                   
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S077),DISP=SHR                             
