//BP13M715  JOB (BP13P),'BP13M715',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),           
//        NOTIFY=CSD0071                                                        
//JOBLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                    
//*====================================================================         
//* 29TH SEND TO CPFB ON REVISED INSTALMENT                                     
//* CATER FOR FEB 28 DAYS                                                       
//*====================================================================         
//*-------------------------------------------------------------------*         
//* PASS INSTALMENT REVISION TO CTS SYSTEM FOR CPFB TO EFFECT THE NEW           
//* INSTALMENT IN THE NEXT MONTH                                                
//*-------------------------------------------------------------------*         
//STEP01   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F860.HDBWDL.PPMTH,DISP=SHR                               
//OUTPUT1  DD DSN=BP13.AB02.F860.HDBWDL,DISP=MOD                                
//*                                                                             
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                     
//*                                                                             
