//BP13D909 JOB (BP13P),'BP13D909',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//         NOTIFY=CSD0071                                                       
//JOBLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                    
//*=================================================================            
//*  FOR PROJECT D03 ( AMK)                                                     
//*  SAME JCL AS BP13D901 ( PROJECT TAP, KWN)                                   
//*=================================================================            
//* BP133137 ED1 31102007 BP13SC12 - REMOVED BP13L12C REPORT                    
//*                       BP13SC13 - ADDED BP13K800, REPORTS DIVIDED            
//*                                  INTO P13LC13A AND P13LC13B                 
//*                       BP13CC41 - ADDED REPORT P13LC41D, P13LC41E            
//*                       BP13CC40 - ADDED BP27K800                             
//* BP133137 LSB 250208 - INCLUDE ONLY PROJECT 02 HOIHUP                        
//* BP133137 ED1 070408 - ADD P13FD78B IN BP13CC40 FOR BP13SC13 INPUT           
//* BP133181 LSB 110708 - ONLY PRINT LC41C , LC41D                              
//* BP133387 JB8 181208 - ADD BP13K800 IN BP13SC13 FOR PRJCT CODE               
//* BP134779 PCL 290513 - TO UPDATE INTO EMAIL/FILE REPORT FORMAT FOR           
//*                       P13LC41C & P13LC41D                                   
//*=================================================================            
//* TO SEND DYNAMIC JDE AHEAD OF THE PRINT DATASETS                             
//* PRT01 : 1 COPY          MANAGEMENT ACCOUNTING & BUDGETING UNIT              
//*-----------------------------------------------------------------            
//PRT01    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
$DJDE$ JDE=BP13S,JDL=BP13,END;                                                  
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALAG1A                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*                                                                             
//*-----------------------------------------------------------------            
//* TO SEND DYNAMIC JDE AHEAD OF THE PRINT DATASETS                             
//* PRT02 : 1 COPY          MANAGEMENT ACCOUNTING & BUDGETING UNIT              
//*-----------------------------------------------------------------            
//PRT02    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
$DJDE$ JDE=BP13S,JDL=BP13,COPIES=2,END;                                         
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALAG2A                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*                                                                             
//*=================================================================            
//* SORT FILES BY SCH-ACC-NO. & OMIT RECORDS W/ S&P RECVD BLANK                 
//*-----------------------------------------------------------------            
//STEP01   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BM06.F120.FLATINV.PIDB,DISP=SHR                               
//SORTOUT  DD DSN=&&BM06F120,DISP=(,PASS),                                      
//            UNIT=SYSDA,SPACE=(CYL,(340,50),RLSE),                             
//            DCB=(BLKSIZE=0,LRECL=700,RECFM=FB)                                
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  SORT FIELDS=(1,11,A),FORMAT=CH                                                
  INCLUDE COND=(602,2,CH,EQ,C'85')                                              
/*                                                                              
//*-----------------------------------------------------------------            
//* SORT FILES BY SCH-ACC-NO.                                                   
//* OMIT SNP RECEIVED DATE                                                      
//* OMIT PROJECT D01                                                            
//*-----------------------------------------------------------------            
//STEP02   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.KD00.DBSMAST,DISP=SHR,                                   
//            AMP=('BUFND=4','BUFNI=8')                                         
//SORTOUT  DD DSN=&&BP13FD00,DISP=(,PASS),                                      
//            UNIT=SYSDA,SPACE=(CYL,(200,50),RLSE),                             
//            DCB=(BLKSIZE=0,LRECL=1600,RECFM=FB)                               
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  SORT FIELDS=(11,11,A),FORMAT=CH                                               
  INCLUDE COND=(22,3,CH,EQ,C'D04')                                              
/*                                                                              
//*-----------------------------------------------------------------            
//* MATCH BP13FD00 AND BM06F120 TO EXTRACT ADDRESS                              
//* P13FD78A - DTE-SNP-RECV NOT SPACES                                          
//* P13FD78B - ALL CASES FOR BP13SC13 REPORT                                    
//*-----------------------------------------------------------------            
//STEP03   EXEC PGM=BP13CC40,COND=(0,NE)                                        
//BM06F120 DD DSN=&&BM06F120,DISP=(OLD,DELETE)                                  
//BP13FD00 DD DSN=&&BP13FD00,DISP=(OLD,PASS)                                    
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K022 DD DSN=BP13.K022.WISOIC,DISP=SHR                                     
//BP13K021 DD DSN=BP13.K022.WISOIC.PATH1,DISP=SHR                               
//BP27K800 DD DSN=BP27.K800.HLAPPLN,DISP=SHR,                                   
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13KD30 DD DSN=BP13.KD30.PPDUEDTE,DISP=SHR,                                  
//         AMP=('BUFND=4','BUFNI=8')                                            
//P13FD78A DD DSN=&&BP13FD78,DISP=(,PASS),                                      
//            UNIT=SYSDA,SPACE=(CYL,(20,10),RLSE),                              
//            DCB=(BLKSIZE=0,LRECL=200,RECFM=FB)                                
//P13FD78B DD DSN=&&FD78SC13,DISP=(,PASS),                                      
//            UNIT=SYSDA,SPACE=(CYL,(20,10),RLSE),                              
//            DCB=(BLKSIZE=0,LRECL=200,RECFM=FB)                                
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
/*                                                                              
//*-----------------------------------------------------------------            
//* SORT BY OIC, DATE OTP & REGN NO. RESPECTIVELY                               
//*-----------------------------------------------------------------            
//STEP04   EXEC SORT,CYL=3,COND=(0,NE)                                          
//SORTIN   DD DSN=&&BP13FD78,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&FD78SORT,DISP=(,PASS),                                      
//            UNIT=SYSDA,SPACE=(CYL,(20,10),RLSE),                              
//            DCB=(BLKSIZE=0,LRECL=200,RECFM=FB)                                
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  SORT FIELDS=(1,5,A,6,8,A,14,8,A),FORMAT=CH                                    
/*                                                                              
//*-----------------------------------------------------------------            
//* PRINT REPORT S&P RECVD                                                      
//* P13LC41A FOR ELIGIBLE CASES WITHOUT S&P APPT DATE/TIME                      
//* P13LC41B FOR NON-ELIGIBLE CASES                                             
//* P13LC41C FOR RETURN S&P DATE = BLANK, OTP-EXP <= PP DUE DTE                 
//* P13LC41D FOR RETURN S&P DATE = BLANK, OTP-EXP >  PP DUE DTE                 
//* P13LC41E FOR RETURN S&P DATE AVAILABLE                                      
//*-----------------------------------------------------------------            
//* SKIP THIS STEP FROM 11/7/2008                                               
//*-----------------------------------------------------------------            
//STEP05   EXEC PGM=BP13CC41,COND=(0,NE)                                        
//BP13FD78 DD DSN=&&FD78SORT,DISP=(OLD,PASS)                                    
//P13FD78A DD DUMMY                                                             
//P13LC41A DD SYSOUT=2,OUTPUT=(*.PRT02.FORMID)                                  
//P13LC41B DD SYSOUT=2,OUTPUT=(*.PRT02.FORMID)                                  
//P13LC41C DD DUMMY                                                             
//P13LC41D DD DUMMY                                                             
//P13LC41E DD DUMMY                                                             
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//*-----------------------------------------------------------------            
//* SORT DTE-SNP-SENT, REGN NO                                                  
//*-----------------------------------------------------------------            
//STEP04A  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&BP13FD78,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&FD78ST04,DISP=(,PASS),                                      
//            UNIT=SYSDA,SPACE=(CYL,(20,10),RLSE),                              
//            DCB=(BLKSIZE=0,LRECL=200,RECFM=FB)                                
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  SORT FIELDS=(84,8,A,14,8,A),FORMAT=CH                                         
/*                                                                              
//*-----------------------------------------------------------------            
//* PRINT REPORT S&P RECVD                                                      
//* P13LC41A FOR ELIGIBLE CASES WITHOUT S&P APPT DATE/TIME                      
//* P13LC41B FOR NON-ELIGIBLE CASES                                             
//* P13LC41C FOR RETURN S&P DATE = BLANK                                        
//* P13LC41D FOR RETURN S&P DATE = BLANK, OTP-EXP >  PP DUE DTE                 
//* P13LC41E FOR RETURN S&P DATE AVAILABLE                                      
//*-----------------------------------------------------------------            
//* SKIP LC41E     FROM 11/7/2008                                               
//*-----------------------------------------------------------------            
//STEP5A   EXEC PGM=BP13CC41,COND=(0,NE)                                        
//BP13FD78 DD DSN=&&FD78ST04,DISP=(OLD,DELETE)                                  
//P13FD78A DD DSN=&&FD78SC12,DISP=(,PASS),                                      
//            UNIT=SYSDA,SPACE=(CYL,(20,10),RLSE),                              
//            DCB=(BLKSIZE=0,LRECL=200,RECFM=FB)                                
//P13LC41A DD DUMMY                                                             
//P13LC41B DD DUMMY                                                             
//*P13LC41C DD SYSOUT=2,OUTPUT=(*.PRT02.FORMID)                                 
//*P13LC41D DD SYSOUT=2,OUTPUT=(*.PRT02.FORMID)                                 
//P13LC41C DD DSN=BP13.L41C.BP13CC41.D909,DISP=SHR                              
//P13LC41D DD DSN=BP13.L41D.BP13CC41.D909,DISP=SHR                              
//P13LC41E DD SYSOUT=*                                                          
//*P13LC41E DD SYSOUT=2,OUTPUT=(*.PRT02.FORMID)                                 
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//*-----------------------------------------------------------------            
//* SORT BY DATE OPT, S&P RECV, S&P APPMT DATE                                  
//* OMIT IF S&P APPMT DATE = SPACES                                             
//* OMIT    DTE-SNP-SIGN NOT = SAPCES                                           
//*-----------------------------------------------------------------            
//STEP06   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&FD78SC12,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&FD78LC12,DISP=(,PASS),                                      
//            UNIT=SYSDA,SPACE=(CYL,(20,5),RLSE),                               
//            DCB=(BLKSIZE=0,LRECL=200,RECFM=FB)                                
//SYSIN    DD  *                                                                
      SORT FIELDS=(6,8,A,64,8,A,72,8,A),FORMAT=CH                               
//*-----------------------------------------------------------------            
//* PRINT REPORT SHOW S&P APPOINTMENT DATE/TIME                                 
//*-----------------------------------------------------------------            
//STEP07   EXEC  SAS,COND=(0,NE)                                                
//BP13FD78 DD DSN=&&FD78LC12,DISP=(OLD,PASS)                                    
//BP13L12A DD SYSOUT=2,OUTPUT=(*.PRT02.FORMID)                                  
//BP13L12B DD SYSOUT=2,OUTPUT=(*.PRT02.FORMID)                                  
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13SC12),DISP=SHR                             
//*-------------------------------------------------------------------*         
//* INCLUDE DTE-OPT NOT  = SPACES                                               
//* SORT BY DTE-OTP, DTE-SNP-RECEIVED                                           
//*-------------------------------------------------------------------*         
//STEP08   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&FD78SC13,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&FD78LC13,DISP=(,PASS),                                      
//            UNIT=SYSDA,SPACE=(CYL,(20,5),RLSE),                               
//            DCB=(BLKSIZE=0,LRECL=200,RECFM=FB)                                
//SYSIN     DD  *                                                               
   SORT FIELDS=(6,8,A,64,8,A,14,8,A),FORMAT=CH                                  
//*-------------------------------------------------------------------*         
//* PRINT REPORT SHOW S&P APPOINTMENT DATE/TIME                                 
//*-------------------------------------------------------------------*         
//STEP09   EXEC  SAS,COND=(0,NE)                                                
//BP13FD78 DD DSN=&&FD78LC13,DISP=(OLD,PASS)                                    
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//P13LC13A DD DSN=BP13.LC13.REPORTA,DISP=MOD                                    
//P13LC13B DD DSN=BP13.LC13.REPORTB,DISP=MOD                                    
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13SC13),DISP=SHR                             
//*-------------------------------------------------------------------*         
//*  SEND MAINFRAME EMAIL (BP13.L41C.BP13CC41)                                  
//*-----------------------------------------------------------------            
//STEP10   EXEC SENDMAIL,COND=(4,LT)                                            
//INPUT    DD DSN=BP13.L41C.BP13CC41.D909,DISP=SHR                              
//*-------------------------------------------------------------------*         
//*  SEND MAINFRAME EMAIL (BP13.L41D.BP13CC41)                                  
//*-----------------------------------------------------------------            
//STEP11   EXEC SENDMAIL,COND=(4,LT)                                            
//INPUT    DD DSN=BP13.L41D.BP13CC41.D909,DISP=SHR                              
