//BP13AHHY JOB (BP13P),'BP13AHHY',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//         NOTIFY=CSD0071                                                       
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//*****************************************************************             
//* CHG-NO   BY   ON    - DESCRIPTION                                           
//* ---------------------------------                                           
//* BP130652 SRA 991012 - EXPAND F500,F510,F520 RECL FROM 300 TO 500            
//* BP132756 LSB 050928 - ADD BP13C721 TO SHOW DIFF HH/5YR FROM HIST            
//* BP135279 SMR 140403 - REMOVE COMMENT ON BP13C721                            
//* BP138301 AM2 040620 - HARDCOPY REPORTS CONVERSION                           
//******************************************************************            
//*=================================================================            
//* PRINT REPORT TO COMPARE THE HOUSEHOLD TYPE DETERMINE DURING THE             
//* 1ST ROUND NAD 2ND ROUND                                                     
//*-----------------------------------------------------------------            
//* SORT OUT THE 1ST ROUND HOUSEHOLD CHECK RECORDS                              
//*-----------------------------------------------------------------            
//STEP01   EXEC SORT,COND=(0,NE)                                                
//*SORTIN   DD DSN=BP13.F500.SEQUENCE.BFHHTY,DISP=SHR                           
//SORTIN   DD DSN=BP13.K730.MATURERQ,DISP=SHR                                   
//SORTOUT  DD DSN=&&BP13F500,DISP=(,PASS),                                      
//            UNIT=SYSDA,SPACE=(CYL,(130,10),RLSE),                             
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                            
//SYSIN    DD *                                                                 
      SORT FIELDS=(123,8,A),FORMAT=CH                                           
//*-----------------------------------------------------------------            
//* SORT OUT THE 2ND ROUND HOUSEHOLD CHECK RECORDS                              
//*-----------------------------------------------------------------            
//STEP02   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F500.SEQUENCE,DISP=SHR                                   
//*SORTIN   DD DSN=BP13.K730.MATURERQ,DISP=SHR                                  
//SORTOUT  DD DSN=&&BP13F520,DISP=(,PASS),                                      
//            UNIT=SYSDA,SPACE=(CYL,(130,10),RLSE),                             
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                            
//SYSIN    DD *                                                                 
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
//*-----------------------------------------------------------------            
//* PRINT REPORT TO SHOW THE DIFFERENCE IN HOUSEHOLD TYPE                       
//*-----------------------------------------------------------------            
//STEP03   EXEC PGM=BP13C675,COND=(0,NE)                                        
//BP13F500 DD DSN=&&BP13F500,DISP=(OLD,PASS)                                    
//BP13F520 DD DSN=&&BP13F520,DISP=(OLD,PASS)                                    
//BP13K595 DD DSN=BP13.K595.BALLOT.LOG,DISP=SHR,                                
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13L675 DD SYSOUT=8,DEST=IOM8                                                
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* SORT NRIC 1 AND NRIC 2                                                      
//*---------------------------------------------------------------------        
//STEP04   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F500.SEQUENCE,DISP=SHR                                   
//SORTOUT  DD DSN=&&BP13F730,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(100,50),RLSE),                             
//            DCB=(LRECL=500,RECFM=FB)                                          
//SYSIN    DD *                                                                 
    SORT FIELDS=(41,9,A,82,9,A),FORMAT=CH                                       
//*---------------------------------------------------------------------        
//* COMPARE HOUSEHOLD TYPE AND 5-YR TAG IN BP13K730 WITH BP13K595               
//*---------------------------------------------------------------------        
//STEP05   EXEC PGM=BP13C721,COND=(0,NE)                                        
//BP13F730 DD DSN=&&BP13F730,DISP=(OLD,PASS)                                    
//BP13K595 DD DSN=BP13.K595.BALLOT.LOG,DISP=SHR,                                
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13K596 DD DSN=BP13.K595.BALLOT.LOG.PATH1,DISP=SHR,                          
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13K597 DD DSN=BP13.K595.BALLOT.LOG.PATH2,DISP=SHR,                          
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13K591 DD DSN=BP13.K595.BALLOT.LOG.PATH1,DISP=SHR,                          
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13K592 DD DSN=BP13.K595.BALLOT.LOG.PATH2,DISP=SHR,                          
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13L721 DD SYSOUT=8,DEST=IOM8                                                
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//******************************************************************            
//* END BP13AHHY                                                                
//******************************************************************            
