//BP13A567 JOB (BP13P),'BP13A567',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),    JOB02565
//       NOTIFY=CSD0071                                                         
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//*-------------------------------------------------------------------*         
//* DESCRIPTION :  RUN MQ TRIGGER PROGRAM                             *         
//*-------------------------------------------------------------------*         
//* SORT BP13F203 BY APPT TYPE, INCLUDE ONLY APPT TYPE = AQ           *         
//* AND FLAT TYP = WIA, WIB, WIC AND FIRST PHASE APPLICANTS           *         
//*-------------------------------------------------------------------*         
//STEP01   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K203.SMS,DISP=SHR                                        
//SORTOUT  DD DSN=&&BP13F203,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,                                                       
//            SPACE=(CYL,(50,10),RLSE),                                         
//            DCB=(RECFM=FB,LRECL=200,BLKSIZE=0)                                
//SYSIN    DD *                                                                 
      SORT FIELDS=(12,8,CH,A),FORMAT=CH                                         
      INCLUDE COND=(9,2,CH,EQ,C'AT',AND,                                        
                    1,3,CH,EQ,C'WIH',AND,                                       
                    34,1,CH,NE,C'2')                                            
//*-------------------------------------------------------------------*         
//*  CHECK CANCELLED CASES IN BP13K800                                *         
//*-------------------------------------------------------------------*         
//STEP1A   EXEC PGM=BP13CB09,COND=(0,NE)                                00581021
//BP13F203 DD DSN=&&BP13F203,DISP=(SHR,PASS)                                    
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR                                      
//P13F203A DD DSN=&&P13F203A,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,                                                       
//            SPACE=(CYL,(50,10),RLSE),                                         
//            DCB=(RECFM=FB,LRECL=200,BLKSIZE=0)                                
//BP13K764 DD DSN=BP13.K764.SALES,DISP=SHR                                      
//SYSDBG   DD SYSOUT=*                                                  00585021
//SYSDBOUT DD SYSOUT=*                                                  00585021
//SYSOUT   DD SYSOUT=*                                                  00585021
//*-------------------------------------------------------------------*         
//* SORT BP13F203 BY QUEUE NO.                                        *         
//*-------------------------------------------------------------------*         
//STEP1B   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&P13F203A,DISP=(SHR,PASS)                                    
//SORTOUT  DD DSN=BP13.F203.SMS.AQ,DISP=OLD                                     
//SYSIN    DD *                                                                 
      SORT FIELDS=(34,5,CH,A),FORMAT=CH                                         
//*-------------------------------------------------------------------*         
//* SORT BP13F203 OMIT RECS WITHOUT HP NO.                            *         
//*-------------------------------------------------------------------*         
//STEP02   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F203.SMS.AQ,DISP=SHR                                     
//SORTOUT  DD DSN=BP13.F203.SMS.AQSMS,DISP=OLD                                  
//SYSIN    DD *                                                                 
      SORT FIELDS=(34,5,CH,A),FORMAT=CH                                         
      OMIT COND=(118,1,CH,EQ,C' ')                                              
//*--------------------------------------------------------------------*        
//* STEP03:  GET FIRST 500 RECS                                        *        
//*--------------------------------------------------------------------*        
//STEP03   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F203.SMS.AQSMS,DISP=SHR                                  
//OUTPUT1  DD DSN=BP13.F203.SMS.AQSMS.F050,DISP=OLD                             
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1) COUNT(500)                          
//*--------------------------------------------------------------------*        
//* STEP04:  GET NEXT 500 RECS                                         *        
//*--------------------------------------------------------------------*        
//STEP04   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F203.SMS.AQSMS,DISP=SHR                                  
//OUTPUT1  DD DSN=BP13.F203.SMS.AQSMS.F150,DISP=OLD                             
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1) COUNT(500) SKIP(500)                
//*--------------------------------------------------------------------*        
//* STEP05:  GET NEXT 500 RECS                                         *        
//*--------------------------------------------------------------------*        
//STEP05   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F203.SMS.AQSMS,DISP=SHR                                  
//OUTPUT1  DD DSN=BP13.F203.SMS.AQSMS.F250,DISP=OLD                             
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1) COUNT(500) SKIP(1000)               
//*--------------------------------------------------------------------*        
//*--------------------------------------------------------------------*        
//* STEP06:  GET NEXT 500 RECS                                         *        
//*--------------------------------------------------------------------*        
//STEP06   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F203.SMS.AQSMS,DISP=SHR                                  
//OUTPUT1  DD DSN=BP13.F203.SMS.AQSMS.F350,DISP=OLD                             
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1) COUNT(500) SKIP(1500)               
//*--------------------------------------------------------------------*        
//* STEP07:  GET NEXT 500 RECS                                         *        
//*--------------------------------------------------------------------*        
//STEP07   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F203.SMS.AQSMS,DISP=SHR                                  
//OUTPUT1  DD DSN=BP13.F203.SMS.AQSMS.F450,DISP=OLD                             
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1) COUNT(500) SKIP(2000)               
//*--------------------------------------------------------------------*        
//* STEP08:  GET NEXT 500 RECS                                         *        
//*--------------------------------------------------------------------*        
//STEP08   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F203.SMS.AQSMS,DISP=SHR                                  
//OUTPUT1  DD DSN=BP13.F203.SMS.AQSMS.F550,DISP=OLD                             
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1) COUNT(500) SKIP(2500)               
//*--------------------------------------------------------------------*        
//* STEP09:  GET NEXT 500 RECS                                         *        
//*--------------------------------------------------------------------*        
//STEP09   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F203.SMS.AQSMS,DISP=SHR                                  
//OUTPUT1  DD DSN=BP13.F203.SMS.AQSMS.F650,DISP=OLD                             
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1) COUNT(500) SKIP(3000)               
//*--------------------------------------------------------------------*        
//* STEP10:  GET NEXT 500 RECS                                         *        
//*--------------------------------------------------------------------*        
//STEP10   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F203.SMS.AQSMS,DISP=SHR                                  
//OUTPUT1  DD DSN=BP13.F203.SMS.AQSMS.F700,DISP=OLD                             
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1) COUNT(500) SKIP(3500)               
//*--------------------------------------------------------------------*        
//* STEP11:  GET NEXT 500 RECS                                         *        
//*--------------------------------------------------------------------*        
//STEP11   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F203.SMS.AQSMS,DISP=SHR                                  
//OUTPUT1  DD DSN=BP13.F203.SMS.AQSMS.F750,DISP=OLD                             
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1) COUNT(500) SKIP(4000)               
//*--------------------------------------------------------------------*        
//* STEP12:  GET NEXT 500 RECS                                         *        
//*--------------------------------------------------------------------*        
//STEP12   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F203.SMS.AQSMS,DISP=SHR                                  
//OUTPUT1  DD DSN=BP13.F203.SMS.AQSMS.F800,DISP=OLD                             
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1) COUNT(500) SKIP(4500)               
//*--------------------------------------------------------------------*        
//* STEP13:  GET NEXT 500 RECS                                         *        
//*--------------------------------------------------------------------*        
//STEP13   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F203.SMS.AQSMS,DISP=SHR                                  
//OUTPUT1  DD DSN=BP13.F203.SMS.AQSMS.F850,DISP=OLD                             
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1) COUNT(500) SKIP(5000)               
//*--------------------------------------------------------------------*        
//* STEP14:  GET NEXT 500 RECS                                         *        
//*--------------------------------------------------------------------*        
//STEP14   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F203.SMS.AQSMS,DISP=SHR                                  
//OUTPUT1  DD DSN=BP13.F203.SMS.AQSMS.F900,DISP=OLD                             
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1) COUNT(500) SKIP(5500)               
//*--------------------------------------------------------------------*        
//* STEP15:  GET NEXT 500 RECS                                         *        
//*--------------------------------------------------------------------*        
//STEP15   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F203.SMS.AQSMS,DISP=SHR                                  
//OUTPUT1  DD DSN=BP13.F203.SMS.AQSMS.F95A,DISP=OLD                             
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1) COUNT(500) SKIP(6000)               
//*--------------------------------------------------------------------*        
//* STEP16:  GET NEXT 500 RECS                                         *        
//*--------------------------------------------------------------------*        
//STEP16   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F203.SMS.AQSMS,DISP=SHR                                  
//OUTPUT1  DD DSN=BP13.F203.SMS.AQSMS.F95B,DISP=OLD                             
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1) COUNT(500) SKIP(6500)               
//*--------------------------------------------------------------------*        
//* STEP25:  GET NEXT 2000 RECS FOR EMAIL                              *        
//*--------------------------------------------------------------------*        
//STEP25   EXEC PGM=IDCAMS                                                      
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F203.SMS.AQ,DISP=SHR                                     
//OUTPUT1  DD DSN=BP13.F203.SMS.AQ.F200,DISP=OLD                                
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1) COUNT(2000)                         
//*--------------------------------------------------------------------*        
//* STEP26:  GET NEXT 2000 RECS FOR EMAIL                              *        
//*--------------------------------------------------------------------*        
//IFTEST2 IF (STEP25.RC = 0) THEN                                               
//STEP26   EXEC PGM=IDCAMS                                                      
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F203.SMS.AQ,DISP=SHR                                     
//OUTPUT1  DD DSN=BP13.F203.SMS.AQ.F300,DISP=OLD                                
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1) COUNT(2000) SKIP(2000)              
//ENDTEST2  ENDIF                                                               
//*--------------------------------------------------------------------*        
//* STEP27:  GET NEXT 2000 RECS FOR EMAIL                              *        
//*--------------------------------------------------------------------*        
//IFTEST3 IF (STEP26.RC = 0) THEN                                               
//STEP27   EXEC PGM=IDCAMS                                                      
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F203.SMS.AQ,DISP=SHR                                     
//OUTPUT1  DD DSN=BP13.F203.SMS.AQ.F400,DISP=OLD                                
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1) COUNT(2000) SKIP(4000)              
//ENDTEST3  ENDIF                                                               
//*--------------------------------------------------------------------*        
//* STEP28:  GET NEXT 2000 RECS FOR EMAIL                              *        
//*--------------------------------------------------------------------*        
//IFTEST4 IF (STEP27.RC = 0) THEN                                               
//STEP28   EXEC PGM=IDCAMS                                                      
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F203.SMS.AQ,DISP=SHR                                     
//OUTPUT1  DD DSN=BP13.F203.SMS.AQ.F500,DISP=OLD                                
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1) COUNT(2000) SKIP(6000)              
//ENDTEST4  ENDIF                                                               
//*--------------------------------------------------------------------*        
//* STEP28:  GET NEXT 2000 RECS FOR EMAIL                              *        
//*--------------------------------------------------------------------*        
//IFTEST5 IF (STEP28.RC = 0) THEN                                               
//STEP29   EXEC PGM=IDCAMS                                                      
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F203.SMS.AQ,DISP=SHR                                     
//OUTPUT1  DD DSN=BP13.F203.SMS.AQ.F600,DISP=OLD                                
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1) COUNT(2000) SKIP(8000)              
//ENDTEST5  ENDIF                                                               
