//BP13ACCE JOB (BP13P),'BP13ACCE',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//         NOTIFY=CSD0071                                                       
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//*=====================================================================        
//* SHORTLIST 300% - PRIORITY (FOR CCA APPLICATIONS WITH CARE NEEDS)            
//*=====================================================================        
//* CHG REF  BY   ON       DESCRIPTION                                          
//* -------- ---- -------- ---------------------------------------------        
//* BP138600 IL5  10022021 NEW JCL FOR CCA                                      
//*=====================================================================        
//* VERIFY FILES BEFORE JOB RUN                                                 
//*---------------------------------------------------------------------        
//STEP0A   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//INPUT1   DD DSN=BP13.K010.TENDER,DISP=OLD                                     
//INPUT2   DD DSN=BP13.K740.MATUREBA,DISP=OLD                                   
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
          VFY FILE(INPUT1)                                                      
          VFY FILE(INPUT2)                                                      
//*=====================================================================        
//* REPRO VSAM FILE TO SEQUENTIAL FILE                                          
//*---------------------------------------------------------------------        
//STEP0B   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.K010.TENDER,DISP=SHR                                     
//OUTPUT1  DD DSN=BP13.F010.TENDER.ACCE,DISP=OLD                                
//INPUT2   DD DSN=BP13.K740.MATUREBA,DISP=SHR                                   
//OUTPUT2  DD DSN=BP13.F740.MATUREBA.ACCE,DISP=OLD                              
//SYSIN    DD *                                                                 
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
   REPRO INFILE(INPUT2)  OUTFILE(OUTPUT2)                                       
//*---------------------------------------------------------------------        
//* SORT UNSUCC PRIORITY AND PUBLIC CASES FOR PA PIGEONHOLONG                   
//*---------------------------------------------------------------------        
//STEP0C   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K740.MATUREBA,DISP=SHR,                                  
//            AMP=('BUFND=23')                                                  
//SORTOUT  DD DSN=BP13.F740.MATUREBA.ARE2.R01,DISP=OLD                          
//SYSIN    DD *                                                                 
   SORT FIELDS=(123,8,A),FORMAT=CH                                              
   INCLUDE COND=(226,3,CH,EQ,C'   ',AND,213,3,CH,NE,C'GRO',AND,                 
                 245,1,CH,EQ,C' ')                                              
//*-------------------------------------------------------------------*         
//* TO PREPARE FLAT AND ETHINIC QUOTA FOR SHORTLISTING 2ND HUNDRED %            
//*-------------------------------------------------------------------*         
//STEP0D   EXEC PGM=BP13C52B,COND=(0,NE)                                        
//BP13F010 DD DSN=BP13.F010.TENDER.PA.MAXCAT,DISP=SHR                           
//BP13K010 DD DSN=BP13.K010.TENDER,DISP=OLD                                     
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*=====================================================================        
//* SORT NOT SHORTLISTED APPLICATIONS                                           
//*---------------------------------------------------------------------        
//STEP01   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K740.MATUREBA,DISP=SHR                                   
//SORTOUT  DD DSN=BP13.F740.MATUREBA.PA,DISP=OLD                                
//SYSIN    DD *                                                                 
   SORT FIELDS=(123,8,A),FORMAT=CH                                              
   INCLUDE COND=(226,3,CH,EQ,C'   ',AND,213,3,CH,NE,C'GRO',AND,                 
                 245,1,CH,EQ,C' ')                                              
//*=====================================================================        
//* SORT DAILY APPLICATIONS BY REFERENCE NUMBER                                 
//*---------------------------------------------------------------------        
//STEP02A  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F740.MATUREBA.PA,DISP=SHR                                
//SORTOUT  DD DSN=&&F740U532,DISP=(NEW,PASS),                                   
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            SPACE=(CYL,(70,10),RLSE)                                          
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,28,A),FORMAT=CH                                               
//*---------------------------------------------------------------------        
//* TO PROCESS THE PIGEON-HOLDING FOR MATURE PA CASES, THE PROGRAM WI           
//* ONLY ALLOCATE THE PRIORITY SUPPLY QUOTA FOR ALL SCHEME                      
//*---------------------------------------------------------------------        
//STEP02B  EXEC PGM=BP13U532,COND=(0,NE)                                        
//STEPLIB  DD DSN=BP13.BATCH.LOADCOB.BALLOT,DISP=SHR                            
//BP13K010 DD DSN=BP13.K010.TENDER,DISP=OLD                                     
//BP13F740 DD DSN=&&F740U532,DISP=(OLD,PASS)                                    
//BP13K740 DD DSN=BP13.K740.MATUREBA,DISP=OLD,                                  
//            AMP=('BUFND=23')                                                  
//BP13F525 DD DSN=BP13.F525.APPL,DISP=MOD                                       
//BP13L532 DD SYSOUT=8,DEST=IOM8                                                
//P13L532A DD SYSOUT=8,DEST=IOM8                                                
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*---------------------------------------------------------------------        
//* SORT OUT 1F FLATS TO PRINT FLAT SUPPLY AFTER PIGEONHOLING                   
//*---------------------------------------------------------------------        
//STEP03A  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K010.TENDER,DISP=SHR                                     
//SORTOUT  DD DSN=&&K010AFN,DISP=(,PASS),                                       
//         UNIT=(SYSDA,1),SPACE=(CYL,(5,3),RLSE),                               
//         DCB=(RECFM=FB,LRECL=600,BLKSIZE=0)                                   
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,5,A),FORMAT=CH                                                
   INCLUDE COND=(4,2,CH,EQ,C'1F')                                               
//*---------------------------------------------------------------------        
//* PRINT TENDER PROGRAM SUMMARY REPORT AFTER  PIGEON-HOLING                    
//*---------------------------------------------------------------------        
//STEP03B   EXEC PGM=BP13C524,COND=(0,NE)                                       
//SYSPRINT  DD SYSOUT=*                                                         
//BP13F010  DD DSN=&&K010AFN,DISP=(OLD,PASS)                                    
//BP13F713  DD DSN=BP13.F713.PIGEON.MATUREPA,DISP=SHR                           
//BP13L524  DD SYSOUT=8,DEST=IOM8                                               
//SYSDBG    DD SYSOUT=*                                                         
//SYSDBOUT  DD SYSOUT=*                                                         
//SYSOUT    DD SYSOUT=*                                                         
/*                                                                              
//*---------------------------------------------------------------------        
//* SORT DAILY APPLICATIONS BY REFERENCE NUMBER                                 
//*------------------------------------------------------------------           
//STEP04A  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K740.MATUREBA,DISP=SHR                                   
//SORTOUT  DD DSN=&&F740S8,DISP=(NEW,PASS),                                     
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            SPACE=(CYL,(70,10),RLSE)                                          
//SYSIN    DD *                                                                 
   SORT FIELDS=(187,3,A,211,1,A,123,8,A),FORMAT=CH                              
//*------------------------------------------------------------------           
//* PRINT REPORT ON TOTAL CUMULATIVE SUCC BY ALLOC-SCHEME                       
//*------------------------------------------------------------------           
//STEP05B  EXEC PGM=BP13C525,COND=(0,NE)                                        
//BP13F730 DD DSN=&&F740S8,DISP=(OLD,DELETE)                                    
//P13L525A DD SYSOUT=*                                                          
//P13L525B DD SYSOUT=8,DEST=IOM8                                                
//P13L525C DD SYSOUT=8,DEST=IOM8                                                
//SYSIN    DD *                                                                 
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------00000030
//*- UNSUCC ROUND 1                                                     00000030
//*---------------------------------------------------------------------00000030
//STEP06   EXEC  PGM=BP13C71H,COND=(0,NE)                               00000030
//BP13F740 DD DSN=BP13.F740.MATUREBA.ARE2.R01,DISP=SHR                  00002680
//BP13F713 DD DSN=BP13.F713.PIGEON.COHORT01,DISP=SHR                    00002710
//BP13K740 DD  DSN=BP13.K740.MATUREBA,DISP=SHR,                                 
//         AMP=('BUFND=4','BUFNI=8')                                            
//SYSOUT   DD  SYSOUT=*                                                 00002880
//SYSPRINT DD  SYSOUT=*                                                 00002890
//SYSDBG   DD  SYSOUT=*                                                 00001760
//SYSDBOUT DD  SYSOUT=*                                                 00001770
//*-----------------------------------------------------------------    01491002
//* SORT BY REGN                                                        01492002
//* INCLUDE ALL UNSUCCESSFUL APPLICATIONS                               01493002
//*-----------------------------------------------------------------    01494002
//STEP07A EXEC SORT,COND=(0,NE)                                         01495002
//SORTIN  DD DSN=BP13.F740.MATUREBA.ARE2.R01,DISP=SHR                   01496003
//SORTOUT DD DSN=&&F740REGN,DISP=(,PASS),                               01497002
//        UNIT=(SYSDA,1),SPACE=(CYL,(130,20),RLSE),                     01498002
//        DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                        01499002
//SYSIN   DD  *                                                         01499102
    SORT FIELDS=(123,8,A),FORMAT=CH                                     01499202
//* -------- ---- -------- --------------------------------------------         
//* TO UPDATE RESULT STATUS = 'U' AND BOOK STATUS = 'NS' FOR                    
//* BTO APPLICATIONS                                                            
//*--------------------------------------------------------------------         
//STEP07B   EXEC PGM=BP13C71D,COND=(0,NE)                                       
//BP13F740  DD DSN=&&F740REGN,DISP=(OLD,DELETE)                                 
//BP13K740  DD DSN=BP13.K740.MATUREBA,DISP=SHR                                  
//SYSPRINT  DD SYSOUT=*                                                         
//SYSDBG    DD SYSOUT=*                                                         
//SYSDBOUT  DD SYSOUT=*                                                         
//SYSOUT    DD SYSOUT=*                                                         
//*---------------------------------------------------------------------        
//* POPULATE QUEUE NO TO BP13K703                                               
//* OUTREC 1ST HUNDRED PERCENT (REQ-STAT = '1')                                 
//* SORT BY NT, FT, RANDOM #                                                    
//*---------------------------------------------------------------------        
//STEP08A EXEC  SORT,COND=(0,NE)                                                
//SYSPRINT DD  SYSOUT=*                                                         
//SORTIN   DD  DSN=BP13.K740.MATUREBA,DISP=SHR                                  
//SORTOUT  DD  DSN=&&BP13F740,DISP=(NEW,PASS),                                  
//             SPACE=(CYL,(10,5),RLSE),                                         
//             DCB=(RECFM=FB,LRECL=500,BLKSIZE=0)                               
//SYSIN    DD  *                                                                
  SORT FIELDS=(187,3,A,211,2,A,1,28,A),FORMAT=CH                                
  INCLUDE COND=(260,1,CH,EQ,C'S')                                               
  OUTREC FIELDS=(1,259,C'1',261,240)                                            
//*---------------------------------------------------------------------        
//* POPULATE QUEUE NO TO BP13K703                                               
//* OUTREC 2ND HUNDRED PERCENT (REQ-STAT = '2')                                 
//* SORT BY NT, FT, RANDOM #                                                    
//*---------------------------------------------------------------------        
//STEP08B EXEC  SORT,COND=(0,NE)                                                
//SYSPRINT DD  SYSOUT=*                                                         
//SORTIN   DD  DSN=BP13.K740.MATUREBA,DISP=SHR                                  
//SORTOUT  DD  DSN=&&BP13F740,DISP=(MOD,PASS),                                  
//             SPACE=(CYL,(10,5),RLSE),                                         
//             DCB=(RECFM=FB,LRECL=500,BLKSIZE=0)                               
//SYSIN    DD  *                                                                
  SORT FIELDS=(187,3,A,211,2,A,1,28,A),FORMAT=CH                                
  INCLUDE COND=(260,1,CH,EQ,C'R')                                               
  OUTREC FIELDS=(1,259,C'2',261,240)                                            
//*---------------------------------------------------------------------        
//* POPULATE QUEUE NO TO BP13K703                                               
//* OUTREC 3RD HUNDRED PERCENT (REQ-STAT = '3')                                 
//* SORT BY NT, FT, RANDOM #                                                    
//*---------------------------------------------------------------------        
//STEP08C EXEC  SORT,COND=(0,NE)                                                
//SYSPRINT DD  SYSOUT=*                                                         
//SORTIN   DD  DSN=BP13.K740.MATUREBA,DISP=SHR                                  
//SORTOUT  DD  DSN=&&BP13F740,DISP=(MOD,PASS),                                  
//             SPACE=(CYL,(10,5),RLSE),                                         
//             DCB=(RECFM=FB,LRECL=500,BLKSIZE=0)                               
//SYSIN    DD  *                                                                
  SORT FIELDS=(187,3,A,211,2,A,1,28,A),FORMAT=CH                                
  INCLUDE COND=(260,1,CH,EQ,C'W')                                               
  OUTREC FIELDS=(1,259,C'3',261,240)                                            
//*---------------------------------------------------------------------        
//* POPULATE QUEUE NO TO BP13K703                                               
//* SORT BY NT, FT, REQ-STAT, RANDOM #                                          
//*---------------------------------------------------------------------        
//STEP08D EXEC  SORT,COND=(0,NE)                                                
//SYSPRINT DD  SYSOUT=*                                                         
//SORTIN   DD  DSN=&&BP13F740,DISP=(OLD,DELETE)                                 
//SORTOUT  DD  DSN=&&F740CF99,DISP=(NEW,PASS),                                  
//             SPACE=(CYL,(10,5),RLSE),                                         
//             DCB=(RECFM=FB,LRECL=500,BLKSIZE=0)                               
//SYSIN    DD  *                                                                
  SORT FIELDS=(187,3,A,211,2,A,260,1,A,1,28,A),FORMAT=CH                        
//*---------------------------------------------------------------------        
//* POPULATE QUEUE NO TO BP13K703                                               
//* DETERMINE START QUEUE PER REQ-STAT/NT/FT                                    
//*---------------------------------------------------------------------        
//STEP08E  EXEC PGM=BP13CF99,COND=(0,NE)                                        
//BP13F740 DD DSN=&&F740CF99,DISP=(OLD,DELETE)                                  
//BP13K703 DD DSN=BP13.K703.SOCDATE,DISP=OLD                                    
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
