//BP13M508 JOB (BP13P),'BP13M508',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//             NOTIFY=CSD0071                                                   
//*=================================================================*           
//* CHG-NO   BY   ON       DESCRIPTION                              *           
//* -------- --- --------  ---------                                *           
//* BP130583 CLT 19981111  TO PRINT BP13L122 TWICE A MONTH ON 1ST   *           
//*                        AND 15TH.                                *           
//* BP130732 SSS 19991004  ROUTE REPORT TO APPLICATION TEAM         *           
//* BP130791 CLT 20000204  PRINT REPORT FOR ALL REGN-DEP FIELDS > 0 *           
//*                        IRREGARDLESS OF ELIG SCHEME.             *           
//*=================================================================*           
//* TO SEND DYNAMIC JDE AHEAD OF THE PRINT DATASET                  *           
//* PRT01   : 1 COPY  DUPLEX                  : APPLICATION TEAM    *           
//*-----------------------------------------------------------------*           
//PRT01    EXEC  PGM=IEBGENER,COND=(0,NE)                                       
//SYSUT1   DD  *                                                                
$DJDE$ JDE=BP13D,JDL=BP13,END;                                                  
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALAP1                                    
//SYSUT2   DD  SYSOUT=2,OUTPUT=(*.FORMID)                                       
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//*                                                                             
//*-----------------------------------------------------------------*           
//* SORT OUT CANCELLATION CASES, BUT K800-AMT-REGN-DEPOSIT-CASH OR  *           
//* K800-AMT-REGN-DEPOSIT-CPF1/2/3/4 > 0                            *           
//*-----------------------------------------------------------------*           
//STEP01   EXEC  SORT,CYL=30,COND=(0,NE)                                        
//SORTIN   DD  DSN=BP13.K800.APPLN,DISP=SHR,                                    
//             AMP=('BUFND=8','BUFNI=4')                                        
//SORTOUT  DD  DSN=&&F800FS,DISP=(,PASS),                                       
//             UNIT=SYSDA,SPACE=(CYL,(50,30),RLSE),                             
//             DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                              
//SYSIN    DD  *                                                                
  SORT FIELDS=(4,8,A),FORMAT=CH                                                 
  INCLUDE COND=(1,1,CH,EQ,C'C',AND,(791,5,CH,GT,C'00000',OR,                    
                                    798,5,CH,GT,C'00000',OR,                    
                                    805,5,CH,GT,C'00000',OR,                    
                                    812,5,CH,GT,C'00000',OR,                    
                                    819,5,CH,GT,C'00000'))                      
//*                                                                             
//*------------------------------------------------------------------*          
//* PRINT CANCELLATION CASES, BUT REGN-DEPOSIT NOT = ZEROS           *          
//*------------------------------------------------------------------*          
//STEP02   EXEC  SAS,COND=(0,NE)                                                
//BP13L122 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//BP13F800 DD DSN=&&F800FS,DISP=(OLD,PASS)                                      
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S122),DISP=SHR                             
//*                                                                             
//*------------------------------------------------------------------*          
//* PRINT MONTHLY REPORT FOR CASES CANCELLED UNDER CODE 'C6' AND                
//* REGN RFN = 'Y'                                                              
//*------------------------------------------------------------------*          
//STEP03   EXEC  SAS,COND=(0,NE)                                                
//BP13L642 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//BP13F651 DD DSN=BP13.F651.MTHVRCH,DISP=SHR                                    
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S642),DISP=SHR                             
//*-------------------------------------------------------------------*         
//*  NULL FILE                                                         *        
//*--------------------------------------------------------------------*        
//STEP04   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=NULLFILE,DISP=SHR                                             
//OUTPUT1  DD DSN=BP13.F651.MTHVRCH,DISP=OLD                                    
//SYSIN    DD *                                                                 
   REPRO INFILE(INPUT1) OUTFILE(OUTPUT1)                                        
//*-----------------------------------------------------------------*           
//*                             END OF JOB                          *           
//*-----------------------------------------------------------------*           
