//BP13D107 JOB (BP13P),'SOC',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),                 
//       NOTIFY=CSD0071                                                         
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//* ============================================================== *            
//*                                                                *            
//*             D A I L Y    F I N A N C I A L    J O B            *            
//*                                                                *            
//* ============================================================== *            
//* CHG REF  BY   ON       DESCRIPTION                                          
//* -------- --   ------   -----------                                          
//* BP132801 CT2  011206   PROCESS AG07F630 FOR DBSS CHG CASES                  
//* BP133398 JB8  180509   EXPAND KD10 LENGTH FR 450 TO 1400                    
//* BP133905 JB8  020810   BACKUP BP13KD85                                      
//* BP133905 JB8  141010   TO OUTPUT VOUCHER REPORT IN BP13CB9A                 
//* BP134041 LSB  181010   ADD EMAIL WHEN HOUSING GRANT IS APPROVED             
//* BP134058 PCL3 181010   ADD CHECKING IN BP13KD07 IN BP13CB04                 
//* BP134790 PCL4 060514   OMIT 6' REGN NO IN STEP11                            
//* BP135762 MRN1 130415   BP13CB0A TO UPD DTE_PAYMENT IN GRANT_ASMNT           
//*                        AND WRITE TO F125 FOR FIN HIST (SERS GRANT)          
//* BP135978 MRN1 310815   PROCESS INTRAY AND REVERSAL (CB0C)                   
//* BP136028 MRN1 151215   CATER FOR REG                                        
//* BP136147 MRN1 120216   CATER FOR SUG, AHG/SHG                               
//* BP136181 CT2  220416   REMOVE GRANT PROCESSING AND PUT IN BP13D115          
//* ================================================================            
//* SEND DYNAMIC JDE AHEAD OF THE PRINT DATASET                                 
//* PRT01 : CLASS = 2, COPIES = 1 ** (SALES - AGM TEAM)                         
//*-----------------------------------------------------------------            
//PRT01    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
$DJDE$ JDE=BP13D,JDL=BP13,END;                                                  
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALAG1                                    
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*-----------------------------------------------------------------            
//*  SEND DYNAMIC JDE AHEAD OF THE PRINT DATASETS                               
//*  PRT02 : COPIES = 1            ** (SALES - EC  TEAM)                        
//*-----------------------------------------------------------------            
//PRT02    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
$DJDE$ JDE=BP13D,JDL=BP13,END;                                                  
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALEC                                     
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*-----------------------------------------------------------------            
//*  SEND DYNAMIC JDE AHEAD OF THE PRINT DATASETS                  *            
//*  PRT03 : COPIES = 1            ** (SALES - ALLOCATION TEAM)    *            
//*-----------------------------------------------------------------            
//PRT03    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
$DJDE$ JDE=BP13D,JDL=BP13,END;                                                  
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAAL1A                                     
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*                                                                             
//*-----------------------------------------------------------------            
//* SORT VOUCHER RECORD BY VR-NO WITH IBG DATA                                  
//* AG07.F640.SOC = BACKUP IN BP13D408                                          
//*-----------------------------------------------------------------            
//STEP06   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.AG07.F640.SOC(0),DISP=SHR                                
//SORTOUT  DD DSN=&&AG07F640,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(8,5),RLSE),                                
//            DCB=(BLKSIZE=27900,LRECL=100,RECFM=FB)                            
//SYSIN    DD *                                                                 
    SORT FIELDS=(9,11,A),FORMAT=CH                                              
    SUM FIELDS=NONE                                                             
//*-------------------------------------------------------------------*         
//* SORT BY VOUCHER NO                                                          
//*-------------------------------------------------------------------*         
//STEP07   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.KD85.SURVCHR,DISP=SHR                                    
//SORTOUT  DD DSN=&&BP13FD85,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(8,5),RLSE),                                
//            DCB=(LRECL=80,RECFM=FB)                                           
//SYSIN    DD *                                                                 
    SORT FIELDS=(30,11,A),FORMAT=CH                                             
    INCLUDE COND=(30,11,CH,NE,C'           ')                                   
//*                                                                             
//*-------------------------------------------------------------------*         
//* BACKUP BP13KD85                                                             
//*-------------------------------------------------------------------*         
//STEP08   EXEC PGM=BP13CB9A,COND=(0,NE)                                        
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//BP13FD85 DD DSN=&&BP13FD85,DISP=(OLD,PASS)                                    
//AG07F640 DD DSN=&&AG07F640,DISP=(OLD,PASS)                                    
//BP13KD85 DD DSN=BP13.KD85.SURVCHR,DISP=OLD                                    
//BP13KA10 DD DSN=BP13.KA10.PRJCT,DISP=SHR                                      
//BP13F125 DD DSN=BP13.F125.DBSSSRV,DISP=OLD                                    
//P13FD85A DD DSN=BP13.FD85.SURVCHR,DISP=MOD                                    
//BP13LB9A DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*-------------------------------------------------------------------*         
//* MERGE DAILY FINANCIAL TRANS WITH SALES AGRMT HIST TRANS           *         
//*-------------------------------------------------------------------*         
//STEP09   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F125.DBSSSRV,DISP=SHR                                    
//SORTOUT  DD DSN=&&BP13F126,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(TRK,(20,5),RLSE),                               
//            DCB=(BLKSIZE=27900,LRECL=150,RECFM=FB)                            
//SYSIN    DD *                                                                 
     SORT FIELDS=(5,19,A),FORMAT=CH                                             
/*                                                                              
//*-------------------------------------------------------------------*         
//*  WRITE FINANCIAL TRANS FOR DAY TO TRANS LOG FILE                  *         
//*-------------------------------------------------------------------*         
//STEP10   EXEC PGM=BP13C107,COND=(0,NE)                                        
//BP13F125 DD DSN=&&BP13F126,DISP=(OLD,PASS)                                    
//BP13K130 DD DSN=BP13.K130.SOCHIST,DISP=SHR,                                   
//            AMP=('BUFND=4','BUFNI=8')                                         
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*-------------------------------------------------------------------*         
//* ACCUMULATE DAILY PAYMENT TRANS TO MTHLY PAYMENT TRANS             *         
//*-------------------------------------------------------------------*         
//STEP11   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F125.DBSSSRV,DISP=SHR                                    
//SORTOUT  DD DSN=BP13.F136.MTHTRAN.DBSS,DISP=MOD                               
//SYSIN    DD *                                                                 
     SORT FIELDS=(1,2,A,5,19,A),FORMAT=CH                                       
     INCLUDE COND=(5,1,CH,NE,C'6')                                              
//*                                                                             
//*-------------------------------------------------------------------*         
//*          E N D      O F     J O B                                 *         
//*-------------------------------------------------------------------*         
