//BP13RMGP JOB (BP13P),'BP13RMGP',MSGCLASS=N,CLASS=I,                           
//       MSGLEVEL=(1,1),NOTIFY=CSD0071                                          
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,DISP=SHR                                  
//*=================================================================            
//* DELINK MGPS APPLICATIONS IN BP13K800                                        
//*=================================================================            
//* CHG-NO   BY    ON   - DESCRIPTION                                           
//*--------------------------------------                                       
//* BP134581 IL5 020712 - NEW                                                   
//* BP134679 IL5 021112  CHANGE TO EXPANSION OF ZONE FIELD                      
//* BP135664 ESA1120515  ADD UPDATE OF BP13.K313.TRANS.HLE                      
//* BP136894 ESA1211117  ADD BP13K200 IN BP13CF59                               
//* BP137200 LSB 040418  ADD F915, K820 FOR BP13CF59                            
//*---------------------------------------------------------------------        
//*      VERIFY FILES BEFORE DAILY PRODUCTION RUN                               
//*---------------------------------------------------------------------        
//STEP01   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//INPUT1   DD DSN=BP13.K800.APPLN,DISP=OLD                                      
//INPUT2   DD DSN=BP13.K313.TRANS.HLE,DISP=OLD                                  
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
          VFY FILE(INPUT1)                                                      
          VFY FILE(INPUT2)                                                      
//*=================================================================            
//*  TO DELETE SEQ. DATASET                                                     
//*-------------------------------------------------------------------*         
//STEP00   EXEC PGM=IDCAMS                                                      
//SYSPRINT DD   SYSOUT=*                                                        
//SYSIN    DD   *                                                               
     DEL ('BP13.F800.MGPS.DELINK')                                              
     DEL ('BP13.F205.MGPREC')                                                   
     IF MAXCC < 12 THEN                                                         
        SET MAXCC = 0                                                           
/*                                                                              
//*-------------------------------------------------------------------*         
//* SORT BP13.K205.CTLREC, INCLUDE OPTION = MP                                  
//*-----------------------------------------------------------------            
//STEP01   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K205.CTLREC,DISP=SHR                                     
//SORTOUT  DD DSN=BP13.F205.MGPREC,DISP=(NEW,CATLG),                            
//            SPACE=(CYL,(1,1),RLSE),                                           
//            DCB=(LRECL=80,RECFM=FB)                                           
//SYSIN    DD *                                                                 
  SORT FIELDS=(1,15,A),FORMAT=CH                                                
  INCLUDE COND=(14,2,CH,EQ,C'MP')                                               
//*-----------------------------------------------------------------            
//* SORT OUT LIVE MGPS APPLICATIONS THAT HAVE NOT BOOKED A FLAT                 
//*---------------------------------------------------------------------        
//STEP02   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD  DSN=BP13.K800.APPLN,DISP=SHR,                                    
//         AMP=('BUFND=4','BUFNI=8')                                            
//SORTOUT  DD  DSN=&&BP13F800,DISP=(,PASS),                                     
//             UNIT=SYSDA,SPACE=(CYL,(350,50),RLSE),                            
//             DCB=(RECFM=FB,LRECL=2000)                                        
//SYSIN    DD  *                                                                
  SORT FIELDS=(4,8,A),FORMAT=CH                                                 
   INCLUDE COND=(155,1,CH,EQ,C' ',AND,                                          
                 1,1,CH,NE,C'C',AND,                                            
                (1592,1,CH,EQ,C'C',OR,1592,1,CH,EQ,C'P'),AND,                   
                 924,3,CH,EQ,C'BTO')                                            
//*--------------------------------------------------------------------         
//* MATCH BP13F205 AND BP13F800                                                 
//*--------------------------------------------------------------------         
//STEP03   EXEC PGM=SORT,COND=(0,NE)                                            
//SORTJNF1 DD DSN=BP13.F205.MGPREC,DISP=SHR                                     
//SORTJNF2 DD DSN=&&BP13F800,DISP=(SHR,PASS)                                    
//MATCH    DD DSN=BP13.F800.MGPS.DELINK,DISP=(NEW,CATLG),                       
//            SPACE=(CYL,(10,5),RLSE),                                          
//            DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                               
//SYSIN DD *                                                                    
   SORT FIELDS=COPY                                                             
   JOINKEYS FILE=F1,FIELDS=(1,3,A)                                              
   JOINKEYS FILE=F2,FIELDS=(914,3,A)                                            
   REFORMAT FIELDS=(F2:1,2000)                                                  
   OUTFILE FNAMES=MATCH                                                         
/*                                                                              
//SYSUDUMP DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* TO UPDATE MGPS CDE AND JT-REGNUM TO SPACES                                  
//*---------------------------------------------------------------------        
//STEP04   EXEC PGM=BP13CF59,COND=(0,NE)                                        
//BP13F800 DD DSN=BP13.F800.MGPS.DELINK,DISP=SHR                                
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR,                                     
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K200 DD DSN=BP13.K200.BKAPPMT,DISP=SHR,                                   
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K201 DD DSN=BP13.K200.BKAPPMT.PATH1,DISP=SHR,                             
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13F313 DD DSN=&&BP13F313,DISP=(NEW,PASS),                                   
//            DCB=(RECFM=FB,LRECL=100,BLKSIZE=0),                               
//            SPACE=(CYL,(10,5),RLSE)                                           
//BP13F915  DD DSN=BP13.F915.CDBTRANS,DISP=MOD                                  
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*--------------------------------------------------------------------         
//* SORT BP13F313                                                               
//*--------------------------------------------------------------------         
//STEP4A   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&BP13F313,DISP=(OLD,DELETE)                                  
//SORTOUT  DD DSN=&&P13F313A,DISP=(NEW,PASS),                                   
//            DCB=(RECFM=FB,LRECL=100,BLKSIZE=0),                               
//            SPACE=(CYL,(10,5),RLSE)                                           
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,18,A),FORMAT=CH                                               
//*--------------------------------------------------------------------         
//* REPRO TO BP13K313                                                           
//*--------------------------------------------------------------------         
//STEP05   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//INPUT    DD DSN=&&P13F313A,DISP=(OLD,DELETE)                                  
//OUTPUT   DD DSN=BP13.K313.TRANS.HLE,DISP=SHR                                  
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
   REPRO INFILE(INPUT) OUTFILE(OUTPUT) REPLACE                                  
/*                                                                              
//*--------------------------------------------------------------------         
//*  ACCUMULATE THE CONTROL REC INTO CTLREC-ACC FILE                            
//*--------------------------------------------------------------------         
//STEP06 EXEC  PGM=IDCAMS                                                       
//SYSPRINT DD  SYSOUT=*                                                         
//INPUT1   DD  DSN=BP13.F205.MGPREC,                                            
//             DISP=SHR                                                         
//OUTPUT1  DD  DSN=BP13.F205.ACCUM,                                             
//             DISP=MOD                                                         
//SYSIN    DD  *                                                                
      REPRO INFILE(INPUT1) OUTFILE(OUTPUT1)                                     
/*                                                                              
