//BP13A621 JOB (BP13P),'BP13A621',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),    JOB06869
//         NOTIFY=CSD0071                                                       
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//*==================================================================           
//* CHG REF  BY  ON       DESCRIPTION                                           
//* -------- --- ------   -----------                                           
//* BP133484 IL5 081226 - NEW                                                   
//* BP133561 IL5 090420 - TO WRITE RECORDS TO BP13.F500.SEQUENCE                
//* BP133604 IL5 090510 - TO OMIT CANCELLED APPLICATIONS                        
//* BP137102 AM2 181218 - SORT OUT NUM-OPTION S6 FOR BP13C54D                   
//*-----------------------------------------------------------------            
//*  SORT OUT ONLY S6 NUM-OPTION M555 OPTION 6                                  
//*  THIS JCL IS FOR WIA, 3R, BE, BTO EXERCISES                                 
//*-----------------------------------------------------------------            
//STEPA    EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K205.CTLREC,DISP=SHR                                     
//SORTOUT  DD DSN=&&P13K205,DISP=(NEW,PASS),                                    
//            SPACE=(TRK,(1,1),RLSE),UNIT=SYSDA,                                
//            DCB=(RECFM=FB,LRECL=80,BLKSIZE=0)                                 
//SYSIN    DD *                                                                 
  SORT FIELDS=(1,15,A),FORMAT=CH                                                
  INCLUDE COND=(14,2,CH,EQ,C'S6')                                               
//*------------------------------------------------------------------           
//* PROGRAM TRIGGER VIA ONLINE BP13B555                                         
//* EXTRACT RELEVANT EXERCISE CASES                                             
//*------------------------------------------------------------------           
//STEP1A   EXEC PGM=BP13C54D,COND=(0,NE)                                        
//BP13F205 DD DSN=&&P13K205,DISP=(OLD,DELETE)                                   
//BP13K595 DD DSN=BP13.K595.BALLOT.LOG,DISP=SHR                                 
//BP13K757 DD DSN=BP13.K757.BTO,DISP=SHR                                        
//BP13K730 DD DSN=BP13.K730.MATURERQ,DISP=SHR                                   
//BP13F500 DD DSN=&&P13F500,DISP=(NEW,PASS),                                    
//            DCB=(BLKSIZE=27500,LRECL=500,RECFM=FB),                           
//            UNIT=SYSDA,SPACE=(CYL,(80,10),RLSE)                               
//BP13L54D DD DSN=BP13.L54D.FNDRQST,DISP=OLD                                    
//BP13L54E DD DSN=BP13.L54E.CANAPPL,DISP=OLD                                    
//BP13L54F DD DSN=BP13.L54F.CANINCL,DISP=OLD                                    
//BP13L54G DD DSN=BP13.L54G.CANEXCL,DISP=OLD                                    
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBUG  DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*-----------------------------------------------------------------            
//STEP1B   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&P13F500,DISP=(OLD,DELETE)                                   
//SORTOUT  DD DSN=BP13.F500.SEQUENCE,DISP=OLD                                   
//SYSIN    DD *                                                                 
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
    OMIT COND=(260,1,CH,EQ,C'C')                                                
//*--------------------------------------------------------------------         
//* TO WRITE RECORDS INTO BP13.F500.SEQUENCE AND BP13.F558.UPGOCP               
//* FOR HOUSEHOLD CHECK                                                         
//*---------------------------------------------------------------------        
//* OUTPUT LESSEE-CHECK = 'Y'                                                   
//*---------------------------------------------------------------------        
//STEP02   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K825.REQOCCP,DISP=SHR,                                   
//            AMP=('BUFND=23')                                                  
//SORTOUT  DD DSN=&&BP13F825,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(50,5),RLSE),                               
//            DCB=(RECFM=FB,LRECL=400,BLKSIZE=0)                                
//SYSIN    DD *                                                                 
  SORT FIELDS=(1,8,A),FORMAT=CH                                                 
  INCLUDE COND=(131,1,CH,EQ,C'Y')                                               
  OUTREC FIELDS=(1,200,200X)                                                    
/*                                                                              
//*---------------------------------------------------------------------        
//* OUTREC BP13F558 FROM BP13K820 SOC OCCUPIER FILE TO DETERMINE HHTY           
//* INCLUDE LESSEE-CHECK = 'Y' CASE FROM SOC-OCCUP FILE                         
//* INCLUDE APPLN1, APPLN2, APPLN3, APPLN4, OCCUPIER TAG AS "Y"                 
//*---------------------------------------------------------------------        
//STEP03   EXEC PGM=BP13C577,COND=(0,NE)                                        
//BP13F500 DD DSN=BP13.F500.SEQUENCE,DISP=SHR                                   
//BP13F820 DD DSN=&&BP13F825,DISP=(OLD,PASS)                                    
//BP13F558 DD DSN=BP13.F558.UPGOCCP,DISP=OLD                                    
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
