//BP13AA01 JOB (BP13P),'BP13AA01',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),    00000010
//             NOTIFY=CSD0071                                           00000020
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,                                  00000030
//             DISP=SHR                                                 00000040
//*=====================================================================00000050
//* PRINT REPORT ON FLATLIST                                            00000060
//*=====================================================================00000130
//* CHG REF  BY   DATE       DESCRIPTION                                00000140
//*---------------------------------------------------------------------00000150
//* BP132789 LMS1 20060209  NEW JOB                                     00000160
//*=====================================================================00000170
//*    TO SEND DYNAMIC JDE AHEAD OF THE PRINT DATASET                   00000180
//*---------------------------------------------------------------------00000190
//STEP00 EXEC    PGM=IEBGENER,COND=(0,NE)                               00000200
//SYSUT1   DD  *                                                        00000210
1$DJDE$ BTEXT='DPT=GRPID-EAAL1A CP-1',END;                                      
1$DJDE$ JDE=BP13S,COPIES=1,JDL=BP13,END;                                        
//FORMID   OUTPUT FORMS=1WS1,GROUPID=EAAL1A                             00000220
//SYSUT2   DD  SYSOUT=J,                                                00000230
//             OUTPUT=(*.FORMID),DEST=IOMJ                              00000240
//SYSPRINT DD  SYSOUT=*                                                 00000250
//SYSIN    DD  DUMMY                                                    00000260
/*                                                                      00000270
//*---------------------------------------------------------------------00000400
//* SORT THE FLATLIST FILE BY PROJECT CODE, BLOCK, UNIT NUMBER          00000410
//* SORT OUT E09 PROJECT                                                00000410
//*---------------------------------------------------------------------00000420
//STEP02 EXEC    SORT,COND=(0,NE)                                       00000430
//SYSOUT   DD  SYSOUT=*                                                 00000440
//SORTIN   DD  DSN=BP13.KA63.PPTYUNIT,                                  00000450
//             DISP=SHR                                                 00000460
//SORTOUT  DD  DSN=BP13.FA70.FLATLIST,                                  00000470
//             DISP=SHR                                                 00000480
//SYSIN    DD  *                                                        00000520
    SORT FIELDS=(1,20,A),FORMAT=CH                                              
    OUTREC FIELDS=(1,20,60X)                                                    
    INCLUDE COND=(1,3,CH,EQ,C'E30')                                             
/*                                                                      00000530
//*---------------------------------------------------------------------00000540
//* TO PRINT REPORT ON FLATLIST FOR FLAT APPORTIONMENT                  00000550
//*---------------------------------------------------------------------00000560
//STEP03 EXEC    PGM=BP13CA01,COND=(0,NE)                               00000570
//BP13FA70 DD  DSN=BP13.FA70.FLATLIST,                                  00000580
//             DISP=SHR                                                 00000590
//BP13LA01 DD  SYSOUT=J,                                                00000600
//             OUTPUT=(*.STEP00.FORMID),DEST=IOMJ                       00000610
//SYSPRINT DD  SYSOUT=*                                                 00000620
/*                                                                      00000530
//*---------------------------------------------------------------------        
//* RE-FORMAT FLATLIST FILE TO EC UNIT FILE (FOR FLAT APPORTIONMENT )           
//*---------------------------------------------------------------------        
//STEP04 EXEC    SORT,COND=(0,NE)                                               
//SYSOUT   DD  SYSOUT=*                                                         
//SORTIN   DD  DSN=BP13.FA70.FLATLIST,                                          
//             DISP=SHR                                                         
//SORTOUT  DD  DSN=BP13.F100.DBSSLIST,                                          
//             DISP=SHR                                                         
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,17,A),FORMAT=CH                                                
  OUTREC FIELDS=(1,17,54X,19,2,727X)                                            
/*                                                                              
