//BP13D600  JOB (BP13P),'BP13D600',CLASS=I,MSGCLASS=N,                          
//    MSGLEVEL=(1,1),NOTIFY=CSD0071                                             
//*=================================================================*           
//* CHGE REQ  DATE        BY   DESCRIPTION                          *           
//* --------  ----        ---  -----------                          *           
//* BP130594  31/12/1998  CLT1 TO CATER FOR REFUND OF BOOKING FEES  *           
//*                            VIA IBG                              *           
//* BP130418  31/08/1998  LJL1 Y2K COMPLIANCE CHANGES               *           
//* BP130883  27/10/2000  CLT  REMOVE CALLING OF BP13C904           *           
//* BP132625  14/01/2004  CLT  ADD BP13K022/K024 FOR BP13C659       *           
//* BP133172  24/06/2008  JB8  CHANGE FORMATE (BP13F680 TO AG07F235)*           
//* BP134220  04/05/2010  LJL1 TO STOP PRINTING REFUND LETTER FOR   *           
//*                            OPTION FEE. (BP13C659)               *           
//* BP134810  07/06/2013  JGO1 UPDATE SORT CONDITION ON STEP 1      *           
//*                            TO CHECK CDE-PRINT FIELD.            *           
//* BP135096  05/12/2013  LJL1 TO STOP PRINTING OF VOUCHERS TO      *           
//*                            FACILITATE CHANGE FROM 'SU' TO 'SS'. *           
//* BP135096  06/12/2013  JGO1 ADD INPUT TO BP13C645 FOR AG07       *           
//*                            SUBROUTINE ( CHANGE SU TO SS )       *           
//* BP135616  09/03/2015  JGO1 CHANGE LENGTH OF K650/F650 TO 500    *           
//* BP135616  21/07/2015  RJB1 CATER FOR THE NEW FIELDS ON STEPS    *           
//*                            STEP0A AN STEP0B                     *           
//* BP136994  10/10/2017  PCL4 TO READ BP13K800/BP13K893 TO BP13C649*           
//* BP137937  25/07/2019  KV5  WRITE '*' RECORDS TO BP13L649 &      *           
//*                            ' ' RECORDS TO P13L649A IN BP13C649  *           
//*=================================================================*           
//JOBLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                    
//*********************************************************************         
//*    TO SEND DYNAMIC JDE AHEAD OF THE PRINT DATASETS                          
//*    PRT01 : CLASS = 2, COPIES = 1 ** (SALES - AGREEMENT TEAM)                
//*********************************************************************         
//PRT01    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAALAG1 CP-1',END;                                     
1$DJDE$ JDE=BP13D,JDL=BP13,END;                                                 
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALAG1                                    
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID),DEST=IOM2                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*********************************************************************         
//*    TO SEND DYNAMIC JDE AHEAD OF THE PRINT DATASETS  (SIMPLEX)               
//*    PRT02 : CLASS = 2, COPIES = 2 ** (SALES - AGREEMENT TEAM)                
//*********************************************************************         
//PRT02    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAALAG2A CP-1',END;                                    
1$DJDE$ JDE=13C645,JDL=BP13,COPIES=1,END;                                       
//FORMID   OUTPUT FORMS=1OS2,GROUPID=EAALAG2A                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID),DEST=IOM2                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*********************************************************************         
//*    TO SEND DYNAMIC JDE AHEAD OF THE PRINT DATASETS  (SIMPLEX)               
//*    PRT03 : CLASS = 2, COPIES = 2 ** (SALES - AGREEMENT TEAM)                
//*********************************************************************         
//PRT03    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAALAG2B CP-2',END;                                    
1$DJDE$ JDE=13C659,JDL=BP13,COPIES=2,END;                                       
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALAG2B                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID),DEST=IOM2                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*--------------------------------------------------------------------         
//*  REPRO VSAM FILE TO SEQUENTIAL FILES                                        
//*--------------------------------------------------------------------         
//STEP00 EXEC PGM=IDCAMS,COND=(0,NE)                                            
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.K650.PREPVRCH,DISP=SHR                                   
//OUTPUT1  DD DSN=BP13.F650.PREPVRCH,DISP=SHR                                   
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
//*--------------------------------------------------------------------         
//* SORT OUT NON-IBG CASES FOR USED IN OTHER STEPS                              
//*--------------------------------------------------------------------         
//STEP0A   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K650.PREPVRCH,DISP=SHR                                   
//SORTOUT  DD DSN=&&BP13K650,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,                                                       
//            DCB=(BLKSIZE=27500,LRECL=500,RECFM=FB),                           
//            SPACE=(CYL,(3,1),RLSE)                                            
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD  *                                                                
   SORT FIELDS=(27,8,A,1,8,A),FORMAT=CH                                         
   INCLUDE COND=(301,35,CH,EQ,C'    ')                                          
//*--------------------------------------------------------------------         
//* SORT OUT IBG CASES FOR USED IN OTHER STEPS                                  
//*--------------------------------------------------------------------         
//STEP0B   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K650.PREPVRCH,DISP=SHR                                   
//SORTOUT  DD DSN=&&BP13K650,DISP=(MOD,PASS)                                    
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD  *                                                                
   SORT FIELDS=(27,8,A,1,8,A),FORMAT=CH                                         
   INCLUDE COND=(301,35,CH,NE,C'    ')                                          
//*--------------------------------------------------------------------         
//* SORT OUT THOSE CASES THAT ARE NOT PRINTED ON VOUCHERS FOR SOCA CASE         
//*--------------------------------------------------------------------         
//STEP01   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&BP13K650,DISP=(SHR,PASS)                                    
//SORTOUT  DD DSN=&&BP13F650,DISP=(NEW,PASS),                                   
//            UNIT=(SYSDA,1),                                                   
//            DCB=(BLKSIZE=27500,LRECL=500,RECFM=FB),                           
//            SPACE=(CYL,(3,1),RLSE)                                            
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD  *                                                                
   MERGE FIELDS=COPY                                                            
   INCLUDE COND=(193,3,CH,EQ,C'SA ',AND,                                        
                 195,1,CH,EQ,C' ')                                              
//*--------------------------------------------------------------------         
//* PRINT VOUCHERS FOR REFUND OF BOOKING FEES  FOR SOCA CASES                   
//* USING PAYMENT GROUP VOUCHER                                                 
//*--------------------------------------------------------------------         
//STEP02   EXEC PGM=BP13C645,COND=(0,NE)                                        
//BP13F650 DD DSN=&&BP13F650,DISP=(OLD,PASS)                                    
//SY08K010 DD DSN=SY08.K010.USERID,DISP=SHR,                                    
//            AMP=('BUFNI=8')                                                   
//BP13K330 DD DSN=BP13.K330.ACCUMAO,DISP=SHR,                                   
//            AMP=('BUFNI=8')                                                   
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFNI=8')                                                   
//BP13F651 DD DSN=BP13.F651.INTVRCH,DISP=SHR                                    
//BP13L645 DD SYSOUT=8,DEST=IOM8                                                
//BP13K650 DD DSN=BP13.K650.PREPVRCH,DISP=SHR                                   
//AG07F235 DD DSN=BP13.F235.EGPVR.SOC,DISP=MOD                                  
//AG07K962 DD DSN=AG07.K962.GRPVRNO,DISP=SHR                                    
//AG07K930 DD DSN=AG07.K930.DDDCODE,DISP=SHR                                    
//SYSOUT   DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
/*                                                                              
//*--------------------------------------------------------------------         
//*  SORT OUT THOSE CASES THAT ARE NOT PRINTED ON VOUCHERS  FOR SA-TP           
//*--------------------------------------------------------------------         
//STEP03   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&BP13K650,DISP=(SHR,PASS)                                    
//SORTOUT  DD DSN=&&BP13F651,DISP=(NEW,PASS),                                   
//            UNIT=(SYSDA,1),                                                   
//            DCB=(BLKSIZE=27500,LRECL=500,RECFM=FB),                           
//            SPACE=(CYL,(3,1),RLSE)                                            
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD  *                                                                
   MERGE FIELDS=COPY                                                            
   INCLUDE COND=(193,2,CH,EQ,C'TP',AND,                                         
                 195,1,CH,EQ,C'P')                                              
//*--------------------------------------------------------------------         
//* PRINT VOUCHERS FOR REFUND OF BOOKING FEES  FOR SA-TP CASES                  
//* USING PAYMENT GROUP VOUCHER                                                 
//*--------------------------------------------------------------------         
//STEP04   EXEC PGM=BP13C645,COND=(0,NE)                                        
//BP13F650 DD DSN=&&BP13F651,DISP=(OLD,PASS)                                    
//SY08K010 DD DSN=SY08.K010.USERID,DISP=SHR,                                    
//            AMP=('BUFNI=8')                                                   
//BP13K330 DD DSN=BP13.K330.ACCUMAO,DISP=SHR,                                   
//            AMP=('BUFNI=8')                                                   
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFNI=8')                                                   
//BP13F651 DD DSN=BP13.F651.INTVRCH,DISP=MOD                                    
//BP13L645 DD SYSOUT=8,DEST=IOM8                                                
//BP13K650 DD DSN=BP13.K650.PREPVRCH,DISP=SHR                                   
//AG07F235 DD DSN=BP13.F235.EGPVR.SOC,DISP=MOD                                  
//AG07K962 DD DSN=AG07.K962.GRPVRNO,DISP=SHR                                    
//AG07K930 DD DSN=AG07.K930.DDDCODE,DISP=SHR                                    
//SYSOUT   DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
/*                                                                              
//*--------------------------------------------------------------------         
//*  SORT OUT THOSE CASES THAT ARE NOT PRINTED ON VOUCHERS  FOR AA              
//*--------------------------------------------------------------------         
//STEP05   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&BP13K650,DISP=(SHR,PASS)                                    
//SORTOUT  DD DSN=&&BP13F65A,DISP=(NEW,PASS),                                   
//            UNIT=(SYSDA,1),                                                   
//            DCB=(BLKSIZE=27500,LRECL=500,RECFM=FB),                           
//            SPACE=(CYL,(3,1),RLSE)                                            
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD  *                                                                
   MERGE FIELDS=COPY                                                            
   INCLUDE COND=(193,2,CH,EQ,C'AA',AND,                                         
                 195,1,CH,EQ,C'P')                                              
//*--------------------------------------------------------------------         
//* PRINT VOUCHERS FOR REFUND OF BOOKING FEES  FOR AA   CASES                   
//* USING PAYMENT GROUP VOUCHER                                                 
//*--------------------------------------------------------------------         
//STEP06   EXEC PGM=BP13C645,COND=(0,NE)                                        
//BP13F650 DD DSN=&&BP13F65A,DISP=(OLD,PASS)                                    
//SY08K010 DD DSN=SY08.K010.USERID,DISP=SHR,                                    
//            AMP=('BUFNI=8')                                                   
//BP13K330 DD DSN=BP13.K330.ACCUMAO,DISP=SHR,                                   
//            AMP=('BUFNI=8')                                                   
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFNI=8')                                                   
//BP13F651 DD DSN=BP13.F651.INTVRCH,DISP=MOD                                    
//BP13L645 DD SYSOUT=8,DEST=IOM8                                                
//BP13K650 DD DSN=BP13.K650.PREPVRCH,DISP=SHR                                   
//AG07F235 DD DSN=BP13.F235.EGPVR.SOC,DISP=MOD                                  
//AG07K962 DD DSN=AG07.K962.GRPVRNO,DISP=SHR                                    
//AG07K930 DD DSN=AG07.K930.DDDCODE,DISP=SHR                                    
//SYSOUT   DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
/*                                                                              
//*--------------------------------------------------------------------         
//*  SORT OUT THOSE CASES THAT ARE NOT PRINTED ON VOUCHERS  FOR AA              
//*--------------------------------------------------------------------         
//STEP07   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&BP13K650,DISP=(SHR,PASS)                                    
//SORTOUT  DD DSN=&&STEP07,DISP=(NEW,PASS),                                     
//            UNIT=(SYSDA,1),                                                   
//            DCB=(BLKSIZE=27500,LRECL=500,RECFM=FB),                           
//            SPACE=(CYL,(3,1),RLSE)                                            
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD  *                                                                
   MERGE FIELDS=COPY                                                            
   INCLUDE COND=(193,2,CH,EQ,C'BB',AND,                                         
                 195,1,CH,EQ,C'P')                                              
//*--------------------------------------------------------------------         
//* PRINT VOUCHERS FOR REFUND OF BOOKING FEES  FOR AA   CASES                   
//* USING PAYMENT GROUP VOUCHER                                                 
//*--------------------------------------------------------------------         
//STEP08   EXEC PGM=BP13C645,COND=(0,NE)                                        
//BP13F650 DD DSN=&&STEP07,DISP=(OLD,PASS)                                      
//SY08K010 DD DSN=SY08.K010.USERID,DISP=SHR,                                    
//            AMP=('BUFNI=8')                                                   
//BP13K330 DD DSN=BP13.K330.ACCUMAO,DISP=SHR,                                   
//            AMP=('BUFNI=8')                                                   
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFNI=8')                                                   
//BP13F651 DD DSN=BP13.F651.INTVRCH,DISP=MOD                                    
//BP13L645 DD SYSOUT=8,DEST=IOM8                                                
//BP13K650 DD DSN=BP13.K650.PREPVRCH,DISP=SHR                                   
//AG07F235 DD DSN=BP13.F235.EGPVR.SOC,DISP=MOD                                  
//AG07K962 DD DSN=AG07.K962.GRPVRNO,DISP=SHR                                    
//AG07K930 DD DSN=AG07.K930.DDDCODE,DISP=SHR                                    
//SYSOUT   DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
/*                                                                              
//*--------------------------------------------------------------------         
//*  SORT OUT THOSE CASES THAT ARE NOT PRINTED ON VOUCHERS  FOR AA              
//*--------------------------------------------------------------------         
//STEP09   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&BP13K650,DISP=(SHR,PASS)                                    
//SORTOUT  DD DSN=&&STEP09,DISP=(NEW,PASS),                                     
//            UNIT=(SYSDA,1),                                                   
//            DCB=(BLKSIZE=27500,LRECL=500,RECFM=FB),                           
//            SPACE=(CYL,(3,1),RLSE)                                            
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD  *                                                                
   MERGE FIELDS=COPY                                                            
   INCLUDE COND=(193,2,CH,EQ,C'RP',AND,                                         
                 195,1,CH,EQ,C'P')                                              
//*--------------------------------------------------------------------         
//* PRINT VOUCHERS FOR REFUND OF BOOKING FEES  FOR AA   CASES                   
//* USING PAYMENT GROUP VOUCHER                                                 
//*--------------------------------------------------------------------         
//STEP10   EXEC PGM=BP13C645,COND=(0,NE)                                        
//BP13F650 DD DSN=&&STEP09,DISP=(OLD,PASS)                                      
//SY08K010 DD DSN=SY08.K010.USERID,DISP=SHR,                                    
//            AMP=('BUFNI=8')                                                   
//BP13K330 DD DSN=BP13.K330.ACCUMAO,DISP=SHR,                                   
//            AMP=('BUFNI=8')                                                   
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFNI=8')                                                   
//BP13F651 DD DSN=BP13.F651.INTVRCH,DISP=MOD                                    
//BP13L645 DD SYSOUT=8,DEST=IOM8                                                
//BP13K650 DD DSN=BP13.K650.PREPVRCH,DISP=SHR                                   
//AG07F235 DD DSN=BP13.F235.EGPVR.SOC,DISP=MOD                                  
//AG07K962 DD DSN=AG07.K962.GRPVRNO,DISP=SHR                                    
//AG07K930 DD DSN=AG07.K930.DDDCODE,DISP=SHR                                    
//SYSOUT   DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
/*                                                                              
//*--------------------------------------------------------------------         
//*  SORT OUT THOSE CASES THAT ARE NOT PRINTED ON VOUCHERS  FOR AA              
//*--------------------------------------------------------------------         
//STEP9A   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&BP13K650,DISP=(SHR,PASS)                                    
//SORTOUT  DD DSN=&&STEP9A,DISP=(NEW,PASS),                                     
//            UNIT=(SYSDA,1),                                                   
//            DCB=(BLKSIZE=27500,LRECL=500,RECFM=FB),                           
//            SPACE=(CYL,(3,1),RLSE)                                            
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD  *                                                                
   MERGE FIELDS=COPY                                                            
   INCLUDE COND=(1,2,CH,NE,C'  ',AND,                                           
                 193,2,CH,EQ,C'  ',AND,                                         
                 195,1,CH,EQ,C'P')                                              
//*--------------------------------------------------------------------         
//* PRINT VOUCHERS FOR REFUND OF BOOKING FEES  FOR AA   CASES                   
//* USING PAYMENT GROUP VOUCHER                                                 
//*--------------------------------------------------------------------         
//STEP10A  EXEC PGM=BP13C645,COND=(0,NE)                                        
//BP13F650 DD DSN=&&STEP9A,DISP=(OLD,PASS)                                      
//SY08K010 DD DSN=SY08.K010.USERID,DISP=SHR,                                    
//            AMP=('BUFNI=8')                                                   
//BP13K330 DD DSN=BP13.K330.ACCUMAO,DISP=SHR,                                   
//            AMP=('BUFNI=8')                                                   
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFNI=8')                                                   
//BP13F651 DD DSN=BP13.F651.INTVRCH,DISP=MOD                                    
//BP13L645 DD SYSOUT=8,DEST=IOM8                                                
//BP13K650 DD DSN=BP13.K650.PREPVRCH,DISP=SHR                                   
//AG07F235 DD DSN=BP13.F235.EGPVR.SOC,DISP=MOD                                  
//AG07K962 DD DSN=AG07.K962.GRPVRNO,DISP=SHR                                    
//AG07K930 DD DSN=AG07.K930.DDDCODE,DISP=SHR                                    
//SYSOUT   DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
/*                                                                              
//*--------------------------------------------------------------------         
//*  EMPTY PREP FILE (BP13F651) TO ENSURE THAT THE VOUCHER INTERFACE            
//*  WILL NOT BE DONE TWICE.                                                    
//*--------------------------------------------------------------------         
//STEP23   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.EMPTY.CHAR500,DISP=OLD                                   
//OUTPUT1  DD DSN=BP13.F651.INTVRCH,DISP=OLD                                    
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                     
//*-----------------------------------------------------------------            
//* BACKUP FILE BP13.F235.EGPVR.SOC                                             
//*-----------------------------------------------------------------            
//STEP23A  EXEC PGM=IDCAMS                                                      
//SYSPRINT DD SYSOUT=*                                                          
//INPUT01  DD DSN=BP13.F235.EGPVR.SOC,DISP=SHR                                  
//OUTPUT01 DD DSN=BP13.F235.EGPVR.BKUP,DISP=MOD                                 
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT01)  OUTFILE(OUTPUT01)                                     
//*--------------------------------------------------------------------         
//*  REPRO VSAM FILE TO SEQUENTIAL FILES  TO BE IMPLEMENTED LATER               
//*--------------------------------------------------------------------         
//STEP24  EXEC PGM=IDCAMS,COND=(0,NE)                                           
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.K650.PREPVRCH,DISP=SHR                                   
//OUTPUT1  DD DSN=BP13.F650.PREPVRCH.DAILY.NEW(+1),DISP=(NEW,CATLG),            
//          UNIT=DISK,SPACE=(CYL,(10,5)),                                       
//          DCB=(BP13.GDG,BLKSIZE=27500,LRECL=500,RECFM=FB)                     
//SYSIN    DD  *                                                                
         REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                 
//*--------------------------------------------------------------------         
//*  SORT OUT THOSE CASES THAT ARE NOT PRINTED ON VOUCHERS  FOR AA              
//*--------------------------------------------------------------------         
//STEP25  EXEC SORT,COND=(0,NE)                                                 
//SORTIN   DD DSN=BP13.K650.PREPVRCH,DISP=SHR                                   
//SORTOUT  DD DSN=&&STEP25,DISP=(NEW,PASS),                                     
//            UNIT=(SYSDA,1),                                                   
//            DCB=(BLKSIZE=27500,LRECL=500,RECFM=FB),                           
//            SPACE=(CYL,(3,1),RLSE)                                            
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,8,A),FORMAT=CH                                                
   INCLUDE COND=(193,2,CH,EQ,C'AA',AND,                                         
                 195,1,CH,EQ,C' ')                                              
//*---------------------------------------------------------------------        
//* PRINT VOUCHERS FOR REFUND OF BOOKING FEES FOR AA CASES                      
//*---------------------------------------------------------------------        
//STEP26  EXEC PGM=BP13C649,COND=(0,NE)                                         
//BP13F650 DD DSN=&&STEP25,DISP=(OLD,PASS)                                      
//BP13K650 DD DSN=BP13.K650.PREPVRCH,DISP=SHR,                                  
//            AMP=('BUFNI=8')                                                   
//BP13K410 DD DSN=BP13.K410.ACCUMSO,DISP=SHR,                                   
//            AMP=('BUFNI=8')                                                   
//AB03K045 DD DSN=AB03.K045.TXHIST1,DISP=SHR,                                   
//            AMP=('BUFNI=8')                                                   
//AB03K046 DD DSN=AB03.K046.TXHIST2,DISP=SHR,                                   
//            AMP=('BUFNI=8')                                                   
//AB03K047 DD DSN=AB03.K047.TXHIST3,DISP=SHR,                                   
//            AMP=('BUFNI=8')                                                   
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFNI=8')                                                   
//BP13K893 DD DSN=BP13.K893.APPLN.HISTORY,DISP=SHR,                             
//            AMP=('BUFNI=8')                                                   
//BP13L649 DD SYSOUT=*                                                          
//P13L649A DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//*  SORT OUT THOSE CASES THAT ARE NOT PRINTED ON VOUCHERS  FOR SA-TP           
//*---------------------------------------------------------------------        
//STEP27   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K650.PREPVRCH,DISP=SHR                                   
//SORTOUT  DD DSN=&&STEP27,DISP=(NEW,PASS),                                     
//          UNIT=(SYSDA,1),                                                     
//          DCB=(BLKSIZE=27500,LRECL=500,RECFM=FB),                             
//          SPACE=(CYL,(3,1),RLSE)                                              
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,8,A),FORMAT=CH                                                
   INCLUDE COND=(193,2,CH,EQ,C'TP',AND,                                         
                 195,1,CH,EQ,C' ')                                              
//*---------------------------------------------------------------------        
//* PRINT VOUCHERS FOR REFUND OF BOOKING FEES FOR SA-TP CASES                   
//*---------------------------------------------------------------------        
//STEP28  EXEC PGM=BP13C649,COND=(0,NE)                                         
//BP13F650 DD DSN=&&STEP27,DISP=(OLD,PASS)                                      
//BP13K650 DD DSN=BP13.K650.PREPVRCH,DISP=SHR,                                  
//            AMP=('BUFNI=8')                                                   
//BP13K410 DD DSN=BP13.K410.ACCUMSO,DISP=SHR,                                   
//            AMP=('BUFNI=8')                                                   
//AB03K045 DD DSN=AB03.K045.TXHIST1,DISP=SHR,                                   
//            AMP=('BUFNI=8')                                                   
//AB03K046 DD DSN=AB03.K046.TXHIST2,DISP=SHR,                                   
//            AMP=('BUFNI=8')                                                   
//AB03K047 DD DSN=AB03.K047.TXHIST3,DISP=SHR,                                   
//            AMP=('BUFNI=8')                                                   
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFNI=8')                                                   
//BP13K893 DD DSN=BP13.K893.APPLN.HISTORY,DISP=SHR,                             
//            AMP=('BUFNI=8')                                                   
//BP13L649 DD SYSOUT=*                                                          
//P13L649A DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*--------------------------------------------------------------------         
//*  SORT OUT THOSE CASES THAT ARE NOT PRINTED ON VOUCHERS  FOR BB              
//*--------------------------------------------------------------------         
//STEP29  EXEC SORT,COND=(0,NE)                                                 
//SORTIN   DD DSN=BP13.K650.PREPVRCH,DISP=SHR                                   
//SORTOUT  DD DSN=&&STEP29,DISP=(NEW,PASS),                                     
//            UNIT=(SYSDA,1),                                                   
//            DCB=(BLKSIZE=27500,LRECL=500,RECFM=FB),                           
//            SPACE=(CYL,(3,1),RLSE)                                            
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,8,A),FORMAT=CH                                                
   INCLUDE COND=(193,2,CH,EQ,C'BB',AND,                                         
                 195,1,CH,EQ,C' ')                                              
//*---------------------------------------------------------------------        
//* PRINT VOUCHERS FOR REFUND OF BOOKING FEES FOR BB CASES                      
//*---------------------------------------------------------------------        
//STEP30  EXEC PGM=BP13C649,COND=(0,NE)                                         
//BP13F650 DD DSN=&&STEP29,DISP=(OLD,PASS)                                      
//BP13K650 DD DSN=BP13.K650.PREPVRCH,DISP=SHR,                                  
//            AMP=('BUFNI=8')                                                   
//BP13K410 DD DSN=BP13.K410.ACCUMSO,DISP=SHR,                                   
//            AMP=('BUFNI=8')                                                   
//AB03K045 DD DSN=AB03.K045.TXHIST1,DISP=SHR,                                   
//            AMP=('BUFNI=8')                                                   
//AB03K046 DD DSN=AB03.K046.TXHIST2,DISP=SHR,                                   
//            AMP=('BUFNI=8')                                                   
//AB03K047 DD DSN=AB03.K047.TXHIST3,DISP=SHR,                                   
//            AMP=('BUFNI=8')                                                   
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFNI=8')                                                   
//BP13K893 DD DSN=BP13.K893.APPLN.HISTORY,DISP=SHR,                             
//            AMP=('BUFNI=8')                                                   
//BP13L649 DD SYSOUT=*                                                          
//P13L649A DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*--------------------------------------------------------------------         
//*  SORT OUT THOSE CASES THAT ARE NOT PRINTED ON VOUCHERS  FOR RP              
//*--------------------------------------------------------------------         
//STEP31  EXEC SORT,COND=(0,NE)                                                 
//SORTIN   DD DSN=BP13.K650.PREPVRCH,DISP=SHR                                   
//SORTOUT  DD DSN=&&STEP31,DISP=(NEW,PASS),                                     
//            UNIT=(SYSDA,1),                                                   
//            DCB=(BLKSIZE=27500,LRECL=500,RECFM=FB),                           
//            SPACE=(CYL,(3,1),RLSE)                                            
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,8,A),FORMAT=CH                                                
   INCLUDE COND=(193,2,CH,EQ,C'RP',AND,                                         
                 195,1,CH,EQ,C' ')                                              
//*---------------------------------------------------------------------        
//* PRINT VOUCHERS FOR REFUND OF BOOKING FEES FOR BB CASES                      
//*---------------------------------------------------------------------        
//STEP32  EXEC PGM=BP13C649,COND=(0,NE)                                         
//BP13F650 DD DSN=&&STEP31,DISP=(OLD,PASS)                                      
//BP13K650 DD DSN=BP13.K650.PREPVRCH,DISP=SHR,                                  
//            AMP=('BUFNI=8')                                                   
//BP13K410 DD DSN=BP13.K410.ACCUMSO,DISP=SHR,                                   
//            AMP=('BUFNI=8')                                                   
//AB03K045 DD DSN=AB03.K045.TXHIST1,DISP=SHR,                                   
//            AMP=('BUFNI=8')                                                   
//AB03K046 DD DSN=AB03.K046.TXHIST2,DISP=SHR,                                   
//            AMP=('BUFNI=8')                                                   
//AB03K047 DD DSN=AB03.K047.TXHIST3,DISP=SHR,                                   
//            AMP=('BUFNI=8')                                                   
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFNI=8')                                                   
//BP13K893 DD DSN=BP13.K893.APPLN.HISTORY,DISP=SHR,                             
//            AMP=('BUFNI=8')                                                   
//BP13L649 DD SYSOUT=*                                                          
//P13L649A DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*--------------------------------------------------------------------         
//*  SORT OUT THOSE CASES THAT ARE NOT PRINTED ON VOUCHERS  FOR RP              
//*--------------------------------------------------------------------         
//STEP33  EXEC SORT,COND=(0,NE)                                                 
//SORTIN   DD DSN=BP13.K650.PREPVRCH,DISP=SHR                                   
//SORTOUT  DD DSN=&&STEP33,DISP=(NEW,PASS),                                     
//            UNIT=(SYSDA,1),                                                   
//            DCB=(BLKSIZE=27500,LRECL=500,RECFM=FB),                           
//            SPACE=(CYL,(3,1),RLSE)                                            
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,8,A),FORMAT=CH                                                
   INCLUDE COND=(1,2,CH,NE,C'  ',AND,                                           
                 193,2,CH,EQ,C'  ',AND,                                         
                 195,1,CH,EQ,C' ')                                              
//*---------------------------------------------------------------------        
//* PRINT VOUCHERS FOR REFUND OF BOOKING FEES FOR BB CASES                      
//*---------------------------------------------------------------------        
//STEP34  EXEC PGM=BP13C649,COND=(0,NE)                                         
//BP13F650 DD DSN=&&STEP33,DISP=(OLD,PASS)                                      
//BP13K650 DD DSN=BP13.K650.PREPVRCH,DISP=SHR,                                  
//            AMP=('BUFNI=8')                                                   
//BP13K410 DD DSN=BP13.K410.ACCUMSO,DISP=SHR,                                   
//            AMP=('BUFNI=8')                                                   
//AB03K045 DD DSN=AB03.K045.TXHIST1,DISP=SHR,                                   
//            AMP=('BUFNI=8')                                                   
//AB03K046 DD DSN=AB03.K046.TXHIST2,DISP=SHR,                                   
//            AMP=('BUFNI=8')                                                   
//AB03K047 DD DSN=AB03.K047.TXHIST3,DISP=SHR,                                   
//            AMP=('BUFNI=8')                                                   
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFNI=8')                                                   
//BP13K893 DD DSN=BP13.K893.APPLN.HISTORY,DISP=SHR,                             
//            AMP=('BUFNI=8')                                                   
//BP13L649 DD SYSOUT=*                                                          
//P13L649A DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* END OF BP13D600.                                                            
//*---------------------------------------------------------------------        
