//BP13A591 JOB (BP13P),'BP13A591',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//         NOTIFY=CSD0071,TYPRUN=HOLD                                           
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//*=================================================================            
//*      VERIFY FILES BEFORE JOB RUN                                            
//*=================================================================            
//* CHG-NO   BY   ON    - DESCRIPTION                                           
//* ---------------------------------                                           
//* BP130243 LSB 960121 - DO NOT HARDCODE 'RE' FOR THE NT-CODE                  
//* BP130243 LSB 960125 - ADD NEW PGM BP13C584 TO UPDATE SUCC-NT                
//* BP130418 CLT 980922 - Y2K COMPLIANCE CHANGES                                
//* BP130652     990826 - EXPAND F500,F520,K520 RECL 300 TO 500                 
//* BP132293 SK  030210 - READ BP13K703 FOR BP13C705                            
//* BP132818 BA3 060126 - TO CHANGE SORTING OF REF NO FROM 6 BYTES              
//*                       TO 8 BYTES.                                           
//*=================================================================            
//STEPA    EXEC PGM=IDCAMS,COND=(0,NE)                                          
//INPUT1   DD DSN=BP13.K730.MATURERQ,DISP=OLD                                   
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
          VFY FILE(INPUT1)                                                      
//******************************************************************            
//* CHG-NO   BY   ON    - DESCRIPTION                                           
//* ---------------------------------                                           
//* BP130230 LSB 970115 - EXPAND WORK SPACES                                    
//*=================================================================            
//*  SEND DYNAMIC JOB DESCRIPTOR ENTRIES AHEAD OF THE PRINT DATASET             
//*-----------------------------------------------------------------            
//PRT01    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
$DJDE$ JDE=BP13D,JDL=BP13,END;                                                  
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALAP1A                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*=====================================================================        
//* SORT THE SEQUENCE FILE UPDATED WITH HOUSEHOLD TYPE IN REGN-NO ORDER         
//*---------------------------------------------------------------------        
//STEPB1   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K730.MATURERQ,DISP=SHR                                   
//SORTOUT  DD DSN=&&BP13F500,DISP=(,PASS),                                      
//            UNIT=(SYSDA,3),SPACE=(CYL,(80,20),RLSE),                          
//            DCB=(RECFM=FB,LRECL=500)                                          
//SYSIN    DD *                                                                 
   SORT FIELDS=(123,8,A),FORMAT=CH                                              
   INCLUDE COND=(123,1,CH,EQ,C'Q')                                              
//*---------------------------------------------------------------------        
//* TO CREATE THE BALLOT FILE FOR NON-MATURE NEW TOWN REQUESTS                  
//* THE FILE IS READY FOR PIGEONHOLING/ONLINE UPDATE OF WEIGHTAGE               
//*      DEL (BP13.K520.BP13A518) CL PURGE                                      
//*---------------------------------------------------------------------        
//STEPB2   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT    DD DSN=&&BP13F500,DISP=(OLD,PASS)                                    
//SYSIN    DD *                                                                 
         DEF CL (NAME(BP13.K520.BP13A518)        -                              
                 CYL(80 10)                      -                              
                 UNIQUE                          -                              
                 SPEED                           -                              
                 IMBED                           -                              
                 SHR(2 3))                       -                              
                 DATA                            -                              
                 (NAME(BP13.K520.BP13A518.DATA)  -                              
                 KEYS(8 122)                     -                              
                 RECSZ(500 500)                  -                              
                 FSPC(10 10)                     -                              
                 CISZ(4096))                                                    
         IF LASTCC = 0 THEN                      -                              
           REPRO IFILE(INPUT)                    -                              
                 ODS(BP13.K520.BP13A518)                                        
//*=====================================================================        
//*   TO CREATE A FILE WITH NRIC1 AND REGN NO                                   
//*   EXTRACTED FROM BP13K800                                                   
//*---------------------------------------------------------------------        
//STEP01A  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFND=8','BUFNI=4')                                         
//SORTOUT  DD DSN=&&P13OUTR,DISP=(,PASS),                                       
//            SPACE=(CYL,(100,20),RLSE),UNIT=SYSDA,                             
//            DCB=(RECFM=FB,LRECL=30)                                           
//SYSIN    DD *                                                                 
     SORT FIELDS=(4,8,A),FORMAT=CH                                              
     OUTREC FIELDS=(4,8,88,9,13X)                                               
//*---------------------------------------------------------------------        
//*   ACCUM FILE WITH NRIC2 AND REGN NO                                         
//*   EXTRACTED FROM BP13K800                                                   
//*---------------------------------------------------------------------        
//STEP01B  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFND=8','BUFNI=4')                                         
//SORTOUT  DD DSN=&&P13OUTR,DISP=(MOD,PASS)                                     
//SYSIN    DD *                                                                 
     SORT FIELDS=(4,8,A),FORMAT=CH                                              
     OMIT COND=(97,9,CH,EQ,C'         ')                                        
     OUTREC FIELDS=(4,8,97,9,13X)                                               
//*---------------------------------------------------------------------        
//*   ACCUM FILE WITH NRIC3 AND REGN NO                                         
//*   EXTRACTED FROM BP13K800                                                   
//*---------------------------------------------------------------------        
//STEP02A  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFND=8','BUFNI=4')                                         
//SORTOUT  DD DSN=&&P13OUTR,DISP=(MOD,PASS)                                     
//SYSIN    DD *                                                                 
     SORT FIELDS=(4,8,A),FORMAT=CH                                              
     OMIT COND=(106,9,CH,EQ,C'         ')                                       
     OUTREC FIELDS=(4,8,106,9,13X)                                              
//*---------------------------------------------------------------------        
//*   ACCUM FILE WITH NRIC4 AND REGN NO                                         
//*   EXTRACTED FROM BP13K800                                                   
//*---------------------------------------------------------------------        
//STEP02B  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFND=8','BUFNI=4')                                         
//SORTOUT  DD DSN=&&P13OUTR,DISP=(MOD,PASS)                                     
//SYSIN    DD *                                                                 
     SORT FIELDS=(4,8,A),FORMAT=CH                                              
     OMIT COND=(115,9,CH,EQ,C'         ')                                       
     OUTREC FIELDS=(4,8,115,9,13X)                                              
//*---------------------------------------------------------------------        
//*   SORT P13F586 IN NRIC SEQUENCE                                             
//*---------------------------------------------------------------------        
//STEP03   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&P13OUTR,DISP=(OLD,PASS)                                     
//SORTOUT  DD DSN=&&BP13MR,DISP=(,PASS),                                        
//            SPACE=(CYL,(100,10),RLSE),UNIT=SYSDA,                             
//            DCB=(RECFM=FB,LRECL=30)                                           
//SYSIN    DD *                                                                 
      SORT FIELDS=(9,9,A),FORMAT=CH                                             
//*---------------------------------------------------------------------        
//*   SORT NRIC FROM BP13K825                                                   
//*     (OMIT LESSEE-CHK TAG = 'N')                                             
//*---------------------------------------------------------------------        
//STEP05   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K825.REQOCCP,DISP=SHR,                                   
//            AMP=('BUFND=8','BUFNI=4')                                         
//SORTOUT  DD DSN=&&P13SOC,DISP=(,PASS),                                        
//            SPACE=(CYL,(20,5),RLSE),UNIT=SYSDA,                               
//            DCB=(RECFM=FB,LRECL=30)                                           
//SYSIN    DD *                                                                 
     SORT FIELDS=(9,9,A),FORMAT=CH                                              
     INCLUDE COND=(1,1,CH,EQ,C'Q',AND,                                          
                   131,1,CH,EQ,C'Y')                                            
     OUTREC FIELDS=(8X,9,9,1,8,5X)                                              
//*---------------------------------------------------------------------        
//*   SORT P13REQ  IN NRIC SEQUENCE                                             
//*---------------------------------------------------------------------        
//STEP06   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&P13SOC,DISP=(OLD,PASS)                                      
//SORTOUT  DD DSN=&&P13REQ,DISP=(,PASS),                                        
//            SPACE=(CYL,(100,10),RLSE),UNIT=SYSDA,                             
//            DCB=(RECFM=FB,LRECL=30)                                           
//SYSIN    DD *                                                                 
      SORT FIELDS=(9,9,A),FORMAT=CH                                             
//*---------------------------------------------------------------------        
//*   MATCHED REQUEST REC WITH NRIC IN RFF MASTER, IF MATCHED,                  
//*   OUTPUT NRIC AND REGN NO                                                   
//*---------------------------------------------------------------------        
//STEP07   EXEC PGM=BP13C580,COND=(0,NE)                                        
//BP13REQ  DD DSN=&&P13REQ,DISP=(OLD,PASS)                                      
//BP13MR   DD DSN=&&BP13MR,DISP=(OLD,PASS)                                      
//BP13F587 DD DSN=&&BP13F587,DISP=(,PASS),                                      
//            SPACE=(CYL,(200,10),RLSE),UNIT=SYSDA,                             
//            DCB=(RECFM=FB,LRECL=30)                                           
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//*  SORT REGN/NRIC FILE BY NRIC , REGN  ORDER                                  
//*---------------------------------------------------------------------        
//STEP08   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&BP13F587,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&P13F586C,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(100,20),RLSE),                             
//            DCB=(RECFM=FB,LRECL=30)                                           
//SYSIN    DD *                                                                 
   SORT FIELDS=(9,9,A,1,8,A),FORMAT=CH,FILSZ=E1500                              
//*---------------------------------------------------------------------        
//*   TO  MATCH THE REGN NO IN BP13K800 WITH BM06K110                           
//*   UPDATE INELIGIBLE TAG 'SS' OR 'SL' OR 'RJ' OR 'RE' TO REQ FILE            
//*---------------------------------------------------------------------        
//STEP09   EXEC PGM=BP13C573,COND=(0,NE)                                        
//BP13K520 DD DSN=BP13.K520.BP13A518,DISP=SHR                                   
//BP13F586 DD DSN=&&P13F586C,DISP=(OLD,PASS)                                    
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFND=8','BUFNI=4')                                         
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR,                                   
//            AMP=('BUFND=8','BUFNI=4')                                         
//BM06K111 DD DSN=BM06.K110.FLATINV.PATH1,DISP=SHR,                             
//            AMP=('BUFND=8','BUFNI=4')                                         
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//*   SORT BP13K780 BY NT, FT, NRIC SEQUENCE                                    
//*---------------------------------------------------------------------        
//STEP10   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K520.BP13A518,DISP=SHR,                                  
//            AMP=('BUFND=8','BUFNI=4')                                         
//SORTOUT  DD DSN=&&INELIG,DISP=(,PASS),                                        
//            SPACE=(CYL,(80,10),RLSE),UNIT=SYSDA,                              
//            DCB=(RECFM=FB,LRECL=500)                                          
//SYSIN    DD *                                                                 
      SORT FIELDS=(41,9,A),FORMAT=CH                                            
      OMIT    COND=(258,2,CH,EQ,C'  ')                                          
//*---------------------------------------------------------------------        
//*   INCLUDE INELIGIBLE REQUESTS - SHORTLIST (SL)                              
//*---------------------------------------------------------------------        
//STEP10A  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&INELIG,DISP=(OLD,PASS)                                      
//SORTOUT  DD DSN=&&SLIST,DISP=(,PASS),                                         
//            SPACE=(CYL,(80,10),RLSE),UNIT=SYSDA,                              
//            DCB=(RECFM=FB,LRECL=500)                                          
//SYSIN    DD *                                                                 
      SORT FIELDS=(123,8,A),FORMAT=CH                                           
      INCLUDE COND=(258,2,CH,EQ,C'SL')                                          
//*---------------------------------------------------------------------        
//*   INCLUDE INELIGIBLE REQUESTS - OTHER THAN SHORTLISTED                      
//*---------------------------------------------------------------------        
//STEP10B  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&INELIG,DISP=(OLD,PASS)                                      
//SORTOUT  DD DSN=&&OTHER,DISP=(,PASS),                                         
//            SPACE=(CYL,(80,10),RLSE),UNIT=SYSDA,                              
//            DCB=(RECFM=FB,LRECL=500)                                          
//SYSIN    DD *                                                                 
      SORT FIELDS=(123,8,A),FORMAT=CH                                           
      OMIT    COND=(258,2,CH,EQ,C'SL')                                          
//*---------------------------------------------------------------------        
//*   TO  PRINT OUT THE INELIGIBLE CASES REQUESTS                               
//*   DUE TO SHORTLISTED (SL)                                                   
//*---------------------------------------------------------------------        
//STEP11A  EXEC PGM=BP13C578,COND=(0,NE)                                        
//BP13F520 DD DSN=&&SLIST,DISP=(OLD,PASS)                                       
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR                                      
//BP13K825 DD DSN=BP13.K825.REQOCCP,DISP=SHR                                    
//P13L578A DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//*   TO  PRINT OUT THE INELIGIBLE CASES REQUESTS                               
//*   DUE TO REASONS OTHER THAN SHORTLISTED                                     
//*---------------------------------------------------------------------        
//STEP11B  EXEC PGM=BP13C578,COND=(0,NE)                                        
//BP13F520 DD DSN=&&OTHER,DISP=(OLD,PASS)                                       
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR                                      
//BP13K825 DD DSN=BP13.K825.REQOCCP,DISP=SHR                                    
//P13L578A DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//*   INCLUDE INELIGIBLE REQUESTS - OTHER THAN SHORTLISTED                      
//*---------------------------------------------------------------------        
//STEP12A  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K520.BP13A518,DISP=SHR                                   
//SORTOUT  DD DSN=BP13.F500.REN,DISP=OLD                                        
//SYSIN    DD *                                                                 
      SORT FIELDS=(123,8,A),FORMAT=CH                                           
//*---------------------------------------------------------------------        
//*  REPRO BALLOT FILE TO SEQUENTIAL FILE                                       
//*---------------------------------------------------------------------        
//STEP12   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F500.REN,DISP=SHR                                        
//OUTPUT1  DD DSN=BP13.K730.MATURERQ,DISP=OLD                                   
//SYSIN    DD *                                                                 
    REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1) REPLACE                              
//*---------------------------------------------------------------------        
//* COMPUTE DTE-BALLOT FOR THE QUARTER                                          
//*---------------------------------------------------------------------        
//STEP13  EXEC PGM=BP13C705,COND=(0,NE)                                         
//BP13F500  DD DSN=BP13.F500.REN,DISP=SHR                                       
//BP13F520  DD DSN=&&F520NT,DISP=(,PASS),                                       
//             SPACE=(CYL,(80,10),RLSE),UNIT=SYSDA,                             
//             DCB=(RECFM=FB,LRECL=500)                                         
//BP13K703  DD DSN=BP13.K703.SOCDATE,DISP=SHR                                   
//SYSPRINT  DD SYSOUT=*                                                         
//SYSDBG    DD SYSOUT=*                                                         
//SYSDBOUT  DD SYSOUT=*                                                         
//SYSOUT    DD SYSOUT=*                                                         
//*---------------------------------------------------------------------        
//* ASSIGN SUCC-NT FROM CDE-NT1. AS THERE IS NO PIGEONHILING                    
//*---------------------------------------------------------------------        
//STEP14  EXEC PGM=BP13C584,COND=(0,NE)                                         
//BP13F500  DD DSN=&&F520NT,DISP=(OLD,PASS)                                     
//BP13F520  DD DSN=BP13.F500.NT,DISP=OLD                                        
//SYSPRINT  DD SYSOUT=*                                                         
//SYSDBG    DD SYSOUT=*                                                         
//SYSDBOUT  DD SYSOUT=*                                                         
//SYSOUT    DD SYSOUT=*                                                         
//*---------------------------------------------------------------------        
//* DELETE TEMPORARY FILE                                                       
//*---------------------------------------------------------------------        
//STEP99   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
    DEL (BP13.K520.BP13A518) CL PURGE                                           
//*---------------------------------------------------------------------        
//* END BP13A518                                                                
//*---------------------------------------------------------------------        
