//BP13A243 JOB (BP13P),'SOC',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),                 
//             NOTIFY=CSD0071                                                   
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,                                          
//             DISP=SHR                                                         
//**************************************************************                
//* CHG-NO   BY   ON    - DESCRIPTION                                           
//*----------------------------------                                           
//* BP133610 ESA1020609 - TO REPLACE BP13K767 WITH BP13K816                     
//* BP134991 ESD1120713  CHANGE BP13K816 TO  BP13K813                           
//* BP135404 ESA1030714  TO REMOVE PRINTING OF CNTRL RRT FOR BP13C240           
//* BP135563 KAM4290115  ADDED BP13C0Q2 TO CATER FOR MGPS                       
//* BP135898 KAM4060815  ADDED BP13F205 IN BP13C0Q1 FOR RANGE CHECK             
//* BP135869 KAM4110815  UPDATE STEP04 FROM DELETE TO PASS                      
//* BP136040 ZDD1030316  CHANGE BP13K816 TO BP13K813 (BP13CB07)                 
//* BP13XXXX EL27120516  FIX MISSING MGPS CHILD W/O PA APPT F200                
//* BP137114 ESA1060318  TO REPLACE BP13C208 WITH UPDATE OF                     
//*                      BP13.K200.PNDAPPMT FOR BP13D243 PROCESSING             
//* BP13XXXX EL27130418  ADD VFY STEP FOR KQ60, K203 AND KQ00                   
//******************************************************************            
//*  TO SEND DYNAMIC JOB DESCRIPTOR ENTRIES AHEAD OF THE PRINT                  
//*  DATASET, SINGLE COPY                                                       
//*-----------------------------------------------------------------            
//PRT01  EXEC    PGM=IEBGENER,COND=(0,NE)                                       
//SYSUT1   DD  *                                                                
1$DJDE$ BTEXT='DPT=GRPID-EAAL1A CP-1',END;                                      
1$DJDE$ JDE=BP13D,JDL=BP13,END;                                                 
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAAL1A                                     
//SYSUT2   DD  SYSOUT=2,                                                        
//             OUTPUT=(*.FORMID),DEST=IOM2                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//*-----------------------------------------------------------------            
//STEP00  EXEC PGM=IDCAMS,COND=(0,NE)                                           
//INPUT1   DD DSN=BP13.KQ00.REGN.APPT,DISP=OLD                                  
//INPUT2   DD DSN=BP13.K203.SMS,DISP=OLD                                        
//INPUT3   DD DSN=BP13.KQ60.LAST.QUEUE,DISP=OLD                                 
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN   DD *                                                                  
          VFY FILE(INPUT1)                                                      
          VFY FILE(INPUT2)                                                      
          VFY FILE(INPUT3)                                                      
//*-----------------------------------------------------------------            
//* SORT OUT THE CONTROL REC FOR THIS OPTION                                    
//*-----------------------------------------------------------------            
//STEP01 EXEC    SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=BP13.K205.CTLREC,                                            
//             DISP=SHR                                                         
//SORTOUT  DD  DSN=&&BP13F205,                                                  
//             DISP=(,PASS),                                                    
//             UNIT=(SYSDA,1),                                                  
//             SPACE=(TRK,(1,1),RLSE),                                          
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=0)                                
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,15,A),FORMAT=CH                                               
   INCLUDE COND=(14,2,CH,EQ,C'SC')                                              
/*                                                                              
//*--------------------------------------------------------------------*        
//*  SORT BP13F200 BY ALLOC-DATE, NT/ZONE, FT, CUR-REG-NO                       
//*--------------------------------------------------------------------*        
//STEP02 EXEC    SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=BP13.K200.BKAPPMT,                                           
//             DISP=SHR                                                         
//SORTOUT  DD  DSN=&&P13F200A,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=SYSDA,                                                      
//             SPACE=(CYL,(10,5),RLSE),                                         
//             DCB=(BLKSIZE=23400,LRECL=300,RECFM=FB)                           
//SYSIN    DD  *                                                                
    SORT FIELDS=(9,3,A,12,2,A,50,6,A,57,5,A),FORMAT=CH                          
/*                                                                              
//*--------------------------------------------------------------------*        
//* TO CHECK BOOKING APPOINTMENT FILE AGAINST SOC MASTER TO REMOVE              
//* CANCELLATION CASES                                                          
//*--------------------------------------------------------------------*        
//STEP03 EXEC    PGM=BP13C240,COND=(0,NE)                                       
//BP13F205 DD  DSN=&&BP13F205,                                                  
//             DISP=(SHR,PASS)                                                  
//BP13K800 DD  DSN=BP13.K800.APPLN,                                             
//             DISP=SHR                                                         
//BP13F200 DD  DSN=&&P13F200A,                                                  
//             DISP=(SHR,DELETE)                                                
//P13F200O DD  DSN=&&P13F200B,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=SYSDA,                                                      
//             SPACE=(CYL,(10,5),RLSE),                                         
//             DCB=(BLKSIZE=23400,LRECL=300,RECFM=FB)                           
//P13F240O DD  SYSOUT=2,                                                        
//             OUTPUT=(*.PRT01.FORMID),DEST=IOM2                                
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//*--------------------------------------------------------------------*        
//*SORT BP13F200 BEFORE UPDATING BP13.K200.PNDAPPMT                             
//*--------------------------------------------------------------------*        
//STEP3A   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&P13F200B,DISP=(SHR,PASS)                                    
//SORTOUT  DD DSN=&&P13F2001,                                                   
//            DISP=(NEW,PASS),                                                  
//            SPACE=(CYL,(10,5),RLSE),                                          
//            DCB=(BLKSIZE=23400,LRECL=300,RECFM=FB)                            
//SYSIN    DD *                                                                 
      SORT FIELDS=(1,21,CH,A),FORMAT=CH                                         
      SUM FIELDS=NONE                                                           
/*                                                                              
//*---------------------------------------------------------------------        
//* TO REPLACE BP13C208 WITH THE UPDATE OF BP13.K200.PNDAPPMT TO                
//* BE PROCESSED BY BP13D243                                                    
//*---------------------------------------------------------------------        
//STEP04   EXEC PGM=IDCAMS                                                      
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=&&P13F2001,DISP=(SHR,PASS)                                    
//OUTPUT1  DD DSN=BP13.K200.PNDAPPMT,DISP=SHR                                   
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1) REPLACE                               
//*-------------------------------------------------------------------*         
//* UPDATE BOOKING APPOINTMENTS INTO BP13K203                         *         
//*-------------------------------------------------------------------*         
//STEP05   EXEC PGM=BP13CB07,COND=(0,NE)                                        
//BP13F200 DD DSN=&&P13F200B,DISP=(OLD,PASS)                                    
//BP13K203 DD DSN=BP13.K203.SMS,DISP=SHR                                        
//BP13K204 DD DSN=BP13.K203.SMS.PATH1,DISP=SHR                                  
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR                                      
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR                                      
//BP13K813 DD DSN=BP13.K813.BTOBE,DISP=SHR                                      
//BP13K200 DD DSN=BP13.K200.BKAPPMT,DISP=SHR                                    
//BP13K201 DD DSN=BP13.K200.BKAPPMT.PATH1,DISP=SHR                              
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*--------------------------------------------------------------------*        
//*SORT BOOKING APPOINTMENTS                                                    
//*-------------------------------------------------------------------*         
//STEP06   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&P13F200B,DISP=(SHR,PASS)                                    
//SORTOUT  DD DSN=&&P13F200C,                                                   
//            DISP=(,PASS),                                                     
//            UNIT=SYSDA,                                                       
//            SPACE=(TRK,(10,5),RLSE),                                          
//            DCB=(RECFM=FB,LRECL=300,BLKSIZE=0)                                
//SYSIN    DD *                                                                 
      SORT FIELDS=(50,6,CH,A,38,8,CH,A,57,5,CH,A),FORMAT=CH                     
//*-------------------------------------------------------------------*         
//* WRITE RECORDS TO BP13KQ00                                                   
//*-------------------------------------------------------------------*         
//STEP07   EXEC PGM=BP13C21Q,COND=(0,NE)                                        
//BP13F200 DD DSN=&&P13F200C,DISP=(SHR,PASS)                                    
//BP13K813 DD DSN=BP13.K813.BTOBE,DISP=SHR                                      
//BP13KQ00 DD DSN=BP13.KQ00.REGN.APPT,DISP=SHR                                  
//BP13K060 DD DSN=BP13.K060.CODETAB,DISP=SHR                                    
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*---------------------------------------------------------------------        
//* CREATE PARENT AND CHILD BP13F200 RECORDS FOR MGPS                           
//*---------------------------------------------------------------------        
//STEPM1   EXEC  PGM=BP13C24M,COND=(0,NE)                                       
//BP13F200 DD  DSN=&&P13F200B,                                                  
//             DISP=(SHR,PASS)                                                  
//BP13K200 DD  DSN=BP13.K200.BKAPPMT,                                           
//             DISP=SHR,                                                        
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13K201 DD  DSN=BP13.K200.BKAPPMT.PATH1,                                     
//             DISP=SHR,                                                        
//             AMP=('BUFNI=8','BUFND=4')                                        
//P13F200A DD  DSN=&&P13F200L,                                                  
//             DISP=(NEW,PASS),                                                 
//             SPACE=(CYL,(10,5),RLSE),                                         
//             DCB=(BLKSIZE=23400,LRECL=300,RECFM=FB)                           
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
/*                                                                              
//*--------------------------------------------------------------------*        
//*SORT OUT THOSE MGPS CHILD W/O PA APPT AND SET CDE-PROJECT TO 'BTO'           
//*--------------------------------------------------------------------*        
//STEPM2   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&P13F200L,DISP=(SHR,PASS)                                    
//SORTOUT  DD DSN=&&P13F200M,                                                   
//            DISP=(NEW,PASS),                                                  
//            SPACE=(CYL,(10,5),RLSE),                                          
//            DCB=(BLKSIZE=23400,LRECL=300,RECFM=FB)                            
//SYSIN    DD *                                                                 
      SORT FIELDS=(1,21,CH,A),FORMAT=CH                                         
      INCLUDE COND=(38,8,CH,EQ,C'        ',AND,                                 
                    185,1,CH,EQ,C'C')                                           
      OUTREC BUILD(1,123,C'BTO',127,174)                                        
/*                                                                              
//*--------------------------------------------------------------------*        
//*SORT BP13F200 BEFORE UPDATING BP13.K200.PNDAPPMT                             
//*--------------------------------------------------------------------*        
//STEPM3A  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&P13F200M,DISP=(SHR,PASS)                                    
//SORTOUT  DD DSN=&&P13F2002,                                                   
//            DISP=(NEW,PASS),                                                  
//            SPACE=(CYL,(10,5),RLSE),                                          
//            DCB=(BLKSIZE=23400,LRECL=300,RECFM=FB)                            
//SYSIN    DD *                                                                 
      SORT FIELDS=(1,21,CH,A),FORMAT=CH                                         
      SUM FIELDS=NONE                                                           
/*                                                                              
//*---------------------------------------------------------------------        
//* TO REPLACE BP13C208 WITH THE UPDATE OF BP13.K200.PNDAPPMT TO                
//* BE PROCESSED BY BP13D243 FOR MGPS CHILD                                     
//*---------------------------------------------------------------------        
//STEPM3   EXEC PGM=IDCAMS                                                      
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=&&P13F2002,DISP=(SHR,PASS)                                    
//OUTPUT1  DD DSN=BP13.K200.PNDAPPMT,DISP=SHR                                   
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1) REPLACE                               
//*-------------------------------------------------------------------*         
//* UPDATE BOOKING APPOINTMENTS INTO BP13K203 FOR MGPS CHILD W/O PA APPT        
//*-------------------------------------------------------------------*         
//STEPM4   EXEC PGM=BP13CB07,COND=(0,NE)                                        
//BP13F200 DD DSN=&&P13F200M,DISP=(SHR,PASS)                                    
//BP13K203 DD DSN=BP13.K203.SMS,DISP=SHR                                        
//BP13K204 DD DSN=BP13.K203.SMS.PATH1,DISP=SHR                                  
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR                                      
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR                                      
//BP13K813 DD DSN=BP13.K813.BTOBE,DISP=SHR                                      
//BP13K200 DD DSN=BP13.K200.BKAPPMT,DISP=SHR                                    
//BP13K201 DD DSN=BP13.K200.BKAPPMT.PATH1,DISP=SHR                              
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*--------------------------------------------------------------------*        
//*SORT BOOKING APPOINTMENTS FOR MGPS CHILD W/O PA APPT                         
//*-------------------------------------------------------------------*         
//STEPM5   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&P13F200M,DISP=(SHR,PASS)                                    
//SORTOUT  DD DSN=&&P13F200N,                                                   
//            DISP=(,PASS),                                                     
//            UNIT=SYSDA,                                                       
//            SPACE=(TRK,(10,5),RLSE),                                          
//            DCB=(RECFM=FB,LRECL=300,BLKSIZE=0)                                
//SYSIN    DD *                                                                 
      SORT FIELDS=(50,6,CH,A,38,8,CH,A,57,5,CH,A),FORMAT=CH                     
//*-------------------------------------------------------------------*         
//* WRITE RECORDS TO BP13KQ00 FOR MGPS CHILD W/O PA APPT                        
//*-------------------------------------------------------------------*         
//STEPM6   EXEC PGM=BP13C21Q,COND=(0,NE)                                        
//BP13F200 DD DSN=&&P13F200N,DISP=(SHR,PASS)                                    
//BP13K813 DD DSN=BP13.K813.BTOBE,DISP=SHR                                      
//BP13KQ00 DD DSN=BP13.KQ00.REGN.APPT,DISP=SHR                                  
//BP13K060 DD DSN=BP13.K060.CODETAB,DISP=SHR                                    
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*--------------------------------------------------------------------*        
//*SORT BOOKING APPOINTMENTS                                                    
//*-------------------------------------------------------------------*         
//STEP08   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&P13F200B,DISP=(SHR,PASS)                                    
//SORTOUT  DD DSN=&&P13F200D,                                                   
//            DISP=(,PASS),                                                     
//            UNIT=SYSDA,                                                       
//            SPACE=(CYL,(10,5),RLSE),                                          
//            DCB=(RECFM=FB,LRECL=300,BLKSIZE=0)                                
//SYSIN    DD *                                                                 
      SORT FIELDS=(09,3,A,12,2,A,38,8,A,57,5,A,124,3,A),FORMAT=CH               
      INCLUDE COND=((1,8,CH,NE,C'        '),AND,                                
                    (38,8,CH,NE,C'        '),AND,                               
                    (124,3,CH,EQ,C'BTO',OR,                                     
                     124,3,CH,EQ,C'SBF',OR,                                     
                     124,3,CH,EQ,C'ROF'))                                       
//*-------------------------------------------------------------------*         
//* WRITE LAST QUEUE FOR MYHDBPAGE TO BP13KQ60                                  
//*-------------------------------------------------------------------*         
//STEP09   EXEC PGM=BP13C0Q1,COND=(0,NE)                                        
//BP13F200 DD DSN=&&P13F200D,DISP=(SHR,DELETE)                                  
//BP13F205 DD DSN=&&BP13F205,DISP=(SHR,PASS)                                    
//BP13KQ60 DD DSN=BP13.KQ60.LAST.QUEUE,DISP=SHR                                 
//BP13K813 DD DSN=BP13.K813.BTOBE,DISP=SHR                                      
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*--------------------------------------------------------------------*        
//*SORT BOOKING APPOINTMENTS FOR MGPS CASE                                      
//*-------------------------------------------------------------------*         
//STEP10   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&P13F200B,DISP=(SHR,PASS)                                    
//SORTOUT  DD DSN=&&P13F200E,                                                   
//            DISP=(,PASS),                                                     
//            UNIT=SYSDA,                                                       
//            SPACE=(CYL,(10,5),RLSE),                                          
//            DCB=(RECFM=FB,LRECL=300,BLKSIZE=0)                                
//SYSIN    DD *                                                                 
      SORT FIELDS=(09,3,A,12,2,A,192,8,A,57,5,A,124,3,A),FORMAT=CH              
      INCLUDE COND=((1,8,CH,NE,C'        '),AND,                                
                    (187,5,CH,NE,C'     '),AND,                                 
                    (192,8,CH,NE,C'        '),AND,                              
                    (124,3,CH,EQ,C'BTO',OR,                                     
                    124,3,CH,EQ,C'SBF',OR,                                      
                    124,3,CH,EQ,C'ROF'))                                        
//*-------------------------------------------------------------------*         
//* WRITE LAST QUEUE FOR MYHDBPAGE TO BP13KQ60 (MGPS)                           
//*-------------------------------------------------------------------*         
//STEP11   EXEC PGM=BP13C0Q2,COND=(0,NE)                                        
//BP13F200 DD DSN=&&P13F200E,DISP=(SHR,DELETE)                                  
//BP13KQ60 DD DSN=BP13.KQ60.LAST.QUEUE,DISP=SHR                                 
//BP13K813 DD DSN=BP13.K813.BTOBE,DISP=SHR                                      
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*--------------------------------------------------------------------         
//*  ACCUMULATE THE CONTROL REC INTO CTLREC-ACC FILE                            
//*--------------------------------------------------------------------         
//STEP12 EXEC  PGM=IDCAMS                                                       
//SYSPRINT DD  SYSOUT=*                                                         
//INPUT1   DD  DSN=&&BP13F205,                                                  
//             DISP=(SHR,DELETE)                                                
//OUTPUT1  DD  DSN=BP13.F205.ACCUM,                                             
//             DISP=MOD                                                         
//SYSIN    DD  *                                                                
      REPRO INFILE(INPUT1) OUTFILE(OUTPUT1)                                     
/*                                                                              
//*---------------------------------------------------------------------        
//* END BP13A243                                                                
//*---------------------------------------------------------------------        
