//BP13Y400 JOB (BP13P),'BP13Y400',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),    00010000
//      NOTIFY=CSD0071                                                  00020000
//JOBLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                            00030000
//*---------------------------------------------------------------------00480000
//* NEW SALES STATISTICS FOR MORTGAGE LOAN PROJECTION (FY BUDGET EX)    00480000
//* RUN AT JUNE OF THE YEAR                                             00480000
//*---------------------------------------------------------------------00480000
//* SORT SOC BY SCHEME-ACC-NO                                           00490000
//*---------------------------------------------------------------------00500000
//STEP01   EXEC SORT,COND=(0,NE)                                        00510000
//SORTIN   DD DSN=BP13.F800.APPLN.MONTH(0),DISP=SHR                     00520000
//SORTOUT  DD DSN=&&BP13F800,DISP=(NEW,PASS),                           00530000
//        UNIT=SYSDA,DCB=(RECFM=FB,LRECL=2000),                         00540000
//        SPACE=(CYL,(200,100),RLSE)                                    00550000
//SYSIN    DD  *                                                        00560000
  SORT FIELDS=(155,11,A),FORMAT=CH                                      00570000
  INCLUDE COND=(155,1,CH,NE,C' ')                                               
//*---------------------------------------------------------------------00480000
//* SORT FIS BY SCHEM-ACC-NO                                            00490000
//* OMIT KEY-ISSUED, NOT BOOKED CASES                                   00490000
//*---------------------------------------------------------------------00500000
//STEP02   EXEC SORT,COND=(0,NE)                                        00510000
//SORTIN   DD DSN=BM06.K110.FLATINV,DISP=SHR,                           00520000
//         AMP=('BUFND=4','BUFNI=8')                                            
//SORTOUT  DD DSN=&&BM06F110,DISP=(NEW,PASS),                           00530000
//        UNIT=SYSDA,DCB=(RECFM=FB,LRECL=500),                          00540000
//        SPACE=(CYL,(200,100),RLSE)                                    00550000
//SYSIN    DD  *                                                        00560000
  SORT FIELDS=(1,11,A),FORMAT=CH                                        00570000
  OMIT COND=(323,4,CH,NE,C'0000',OR,                                            
             299,4,CH,EQ,C'0000')                                               
//*-----------------------------------------------------------------    00580000
//* COMPUTE LOAN POSITION, PROJECT FOR NEXT 5 FY                        00590000
//*-----------------------------------------------------------------    00620000
//STEP03   EXEC PGM=BP13CY71,COND=(0,NE)                                00630000
//BP13F800 DD DSN=&&BP13F800,DISP=(OLD,PASS)                            00640000
//BM06F110 DD DSN=&&BM06F110,DISP=(OLD,PASS)                            00640000
//BM06K100 DD DSN=BM06.K100.BLOCK,DISP=SHR                              00640000
//BP13K640 DD DSN=BP13.K640.CA.ACTION,DISP=SHR                          00640000
//BP13K410 DD DSN=BP13.K410.ACCUMSO,DISP=SHR,                           00640000
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13KD00 DD DSN=BP13.KD00.DBSMAST,DISP=SHR,                           00640000
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13LY71 DD DSN=&&BP13LY71,DISP=(NEW,PASS),                           00650000
//        UNIT=SYSDA,                                                   00540000
//        DCB=(RECFM=FB,LRECL=200),                                     00540000
//        SPACE=(CYL,(10,10),RLSE)                                      00550000
//SYSDBG   DD SYSOUT=*                                                  00660000
//SYSDBOUT DD SYSOUT=*                                                  00670000
//SYSOUT   DD SYSOUT=*                                                  00680000
//*-----------------------------------------------------------------            
//* INCLIDE LOAN-TAG (H,A,N,B)                                                  
//*-----------------------------------------------------------------            
//STEP04  EXEC SORT,COND=(0,NE)                                                 
//SORTIN   DD DSN=&&BP13LY71,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&FY71SORT,DISP=(,PASS),                                      
//            UNIT=SYSDA,                                                       
//            DCB=(BLKSIZE=0,LRECL=200,RECFM=FB),                               
//            SPACE=(CYL,(10,10),RLSE)                                          
//SYSIN    DD *                                                                 
  SORT FIELDS=(42,3,A),FORMAT=CH                                                
  INCLUDE COND=(45,1,CH,EQ,C'H',OR,                                             
                45,1,CH,EQ,C'A',OR,                                             
                45,1,CH,EQ,C'B',OR,                                             
                45,1,CH,EQ,C'N')                                                
//*-----------------------------------------------------------------            
//* PRINT REPORT ON ESTIMATED KEY-ISSUE DATE                                    
//*-----------------------------------------------------------------            
//STEP05   EXEC SAS,COND=(0,NE)                                                 
//WORK     DD UNIT=SYSDA,SPACE=(CYL,(500,300))                                  
//BP13FY71 DD DSN=&&FY71SORT,DISP=(OLD,PASS)                                    
//BP13L085 DD DSN=BP13.L085.BP13S085,DISP=OLD                                   
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S085),DISP=SHR                             
