//BP13R505  JOB (BP13P),'BP13R505',CLASS=I,MSGCLASS=N,                          
//        MSGLEVEL=(1,1),NOTIFY=CSD0071,TYPRUN=HOLD                             
//*=================================================================*           
//* CHGE REQ  DATE        BY   DESCRIPTION                          *           
//* --------  ----        ---  -----------                          *           
//* BP130418  22/09/1998  CLT1 Y2K COMPLIANCE CHANGES               *           
//* BP132546  12/06/2004  YCH2 INCLUDE STORCLAS(PRODRLS) & LOG(NONE)            
//*=================================================================*           
//JOBLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                    
//*--------------------------------------------------------------------         
//*  TO DELETE/CREATE SOC MASTER FILE (BP13.K800.APPLN)                         
//*--------------------------------------------------------------------         
//STEP08    EXEC PGM=IDCAMS,COND=(0,NE)                                         
//INPUT1    DD DSN=BP13.F800.APPLN,DISP=SHR                                     
//SYSPRINT  DD SYSOUT=*                                                         
//SYSIN     DD  *                                                               
          DEL (BP13.K800.APPLN) CL PURGE                                        
          DEF CLUSTER                                -                  00800000
              (NAME(BP13.K800.APPLN)                 -                  00810000
              CYL(700 100)                           -                  00830000
              DATACLAS(MULTIVOL)                     -                          
              STORCLAS(PRODRLS)                      -                          
              LOG(NONE)                              -                          
              SPEED                                  -                          
              UNIQUE                                 -                  00840000
              SHR(2 3))                              -                  00850000
              DATA                                   -                  00860000
              (NAME(BP13.K800.APPLN.DATA)            -                  00870000
              KEYS(8 3)                              -                  00880000
              RECSZ(2000 2000)                       -                  00890000
              CISZ(4096)                             -                  00900000
              FSPC(10 10))                           -                  00910000
              INDEX                                  -                  00920000
              (NAME(BP13.K800.APPLN.INDEX)           -                  00930000
              CISZ(4096))                                               00940000
      IF MAXCC = 0  THEN                             -                  00950000
         REPRO IFILE(INPUT1)                         -                  00960000
              ODS(BP13.K800.APPLN)                                      00720000
