//BP13Q902 JOB (BP13P),'BP13Q902',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//       NOTIFY=CSD0071                                                         
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//* ============================================================== *            
//* CHG REF  BY   ON       DESCRIPTION                                          
//* -------- --   ------   -----------                                          
//* BP136810 MRN1 25092017 EC FINANCIAL YEAR REPORT                             
//*===================================================================  00031063
//*-----------------------------------------------------------------            
//* CREATE BASE FILES                                                           
//*-----------------------------------------------------------------            
//STEP01   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE)                            
//BP13K730 DD DSN=BP13.K730.MATURERQ,DISP=SHR                                   
//BP13KB20 DD DSN=BP13.KB20.DBSBK,DISP=SHR                                      
//BP18K300 DD DSN=BP18.K300.MASTER,DISP=SHR                                     
//BP13K130 DD DSN=BP13.K130.SOCHIST,DISP=SHR                                    
//BP13RPT1 DD DSN=BP13.EC.BASE1,DISP=OLD                                        
//BP13RPT2 DD DSN=BP13.EC.BASE2,DISP=OLD                                        
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
    DSN SYSTEM(DSN)                                                             
    RUN PROGRAM(BP13CB0N) PLAN(BP13PCC) -                                       
        LIB('BP13.BATCH.LOADCOB')                                               
    END                                                                         
/*                                                                              
//*-----------------------------------------------------------------            
//* COUNTS CASES BY FINANCIAL YEAR                                              
//*-----------------------------------------------------------------            
//STEP02 EXEC PGM=BP13CB0O,COND=(0,NE)                                          
//BP13RPT1 DD DSN=BP13.EC.BASE1,DISP=SHR                                        
//BP13RPT2 DD DSN=BP13.EC.BASE2,DISP=SHR                                        
//BP13REPT DD DSN=BP13.EC.REPORT.COUNT,DISP=OLD                                 
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
/*                                                                              
