//BP13A216 JOB (BP13P),'BP13A216',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//             NOTIFY=CSD0071,                                                  
//             TYPRUN=HOLD                                                      
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,                                          
//             DISP=SHR                                                         
//* ====================================================================        
//* CHG-NO   BY    ON        DESCRIPTION                                        
//* ======== === ==========  ===========                                        
//* BP132278 JF4 28-03-2003  CHGE BP13F230/F240 LRECL TO 450.                   
//* BP132452 MJ1629-12-2003  INCLUDED NEW PGM BP13C207 TO UPDATE                
//*                          BB14K500 & BB14K580                                
//* BP133610 ESA102-06-2009  TO REPLACE BP13K767 WITH BP13K816                  
//* BP133851 ESA112-03-2010  TO ADD READING OF BP13KQ30 IN BP13C227             
//* BP134086 ESD1 30-12-2010 CATER TO STOP SENDING TXT TO MEDIACORP             
//*                          PERMANENTLY.                                       
//* BP134521 ESA1 04-05-2012 TO ADD READING OF BM06K100 IN BP13C227             
//* BP134587 ESA1 02-07-2012 TO ADD BP13KQ50 IN BP13C227                        
//* BP134769 SMR2 04-03-2013 ADD P13F230B IN BP13C227 INSTEAD OF DUMMY          
//* BP135171 RJE1 10-02-2014 TO CATER FOR DB2 UPGRADE                           
//* BP135404 ESA1 12-03-2014 TO REMOVE BP13C219                                 
//*                          REMOVE CNTRL PRINTING IN BP13C296                  
//* BP135198 ESA1 03-03-2015 TO ADD BP13K813 IN BP13C296                        
//* BP135783 KG12 25-05-2015 TO CATER FOR SAME BLK SAME STREET IN A TWN         
//*---------------------------------------------------------------------        
//******************************************************************            
//* IMPORTANT NOTE :                                                            
//* THIS JCL IS FOR UPDATE BP13K222, BP13K230, BP13K240 FOR WIS.                
//******************************************************************            
//*  TO SEND DYNAMIC JOB DESCRIPTOR ENTRIES AHEAD OF THE PRINT                  
//*  DATASET, SINGLE COPY                                                       
//*-----------------------------------------------------------------            
//PRT01  EXEC    PGM=IEBGENER,COND=(0,NE)                                       
//SYSUT1   DD  *                                                                
$DJDE$ JDE=BP13D,JDL=BP13,END;                                                  
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAAL1A                                     
//SYSUT2   DD  SYSOUT=2,                                                        
//             OUTPUT=(*.FORMID)                                                
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//*---------------------------------------------------------------------        
//*      VERIFY FILES BEFORE DAILY PRODUCTION RUN                               
//*--------------------------------------------------------------------         
//STEP01 EXEC    PGM=IDCAMS,COND=(0,NE)                                         
//INPUT1   DD  DSN=BP13.K278.OCSBLK,                                            
//             DISP=OLD                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  *                                                                
          VFY FILE(INPUT1)                                                      
/*                                                                              
//*---------------------------------------------------------------------        
//* CTRL REC FOR OPTION 3 IN BP13B289 - UPDATE INTV FILE (WIS)                  
//*--------------------------------------------------------------------         
//STEP1A   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K205.CTLREC,DISP=SHR                                     
//SORTOUT  DD DSN=BP13.F205.WISREC,DISP=OLD                                     
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,15,A),FORMAT=CH                                               
   INCLUDE COND=(14,2,CH,EQ,C'WS')                                              
//*--------------------------------------------------------------------         
//*       DEFINE FILE BP13.F222.BP13A202                                        
//*--------------------------------------------------------------------         
//STEP02  EXEC    PGM=IEBGENER,COND=(0,NE)                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUT1   DD  DSN=NULLFILE,                                                    
//             RECFM=FB,LRECL=100,                                              
//             BLKSIZE=0                                                        
//SYSUT2   DD  DSN=BP13.F222.BP13A216,                                          
//             DISP=(NEW,CATLG),                                                
//             UNIT=DISK,                                                       
//             SPACE=(TRK,(1,1)),                                               
//             RECFM=FB,LRECL=100,                                              
//             BLKSIZE=0                                                        
//SYSIN    DD  DUMMY                                                            
//*---------------------------------------------------------------------        
//*     TO CREATE ALLOCATION SUMMARY FILE (BP13K222)                            
//*---------------------------------------------------------------------        
//STEP03 EXEC    PGM=IKJEFT01,COND=(0,NE),                                      
//             REGION=4096K,                                                    
//             DYNAMNBR=20                                                      
//BP13F205 DD  DSN=BP13.F205.WISREC,                                            
//             DISP=SHR                                                         
//BP13K270 DD  DSN=BP13.K270.BOOKPGM,                                           
//             DISP=SHR,                                                        
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13F222 DD  DSN=BP13.F222.BP13A216,                                          
//             DISP=SHR                                                         
//BM06K100 DD  DSN=BM06.K100.BLOCK,                                             
//             DISP=SHR                                                         
//CP27K090 DD  DSN=CP27.K090.HOLIDAY,                                           
//             DISP=SHR                                                         
//BP13K278 DD  DSN=BP13.K278.OCSBLK,                                            
//             DISP=OLD                                                         
//BP13K813 DD  DSN=BP13.K813.BTOBE,                                             
//             DISP=SHR                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//SYSTSPRT DD  SYSOUT=*                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSTSIN  DD  *                                                                
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C296) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
/*                                                                              
//*---------------------------------------------------------------------        
//* SORT EST/N/C/BLK, FLAT-TYPE ORDER                                           
//*---------------------------------------------------------------------        
//STEP04  EXEC    SORT,COND=(0,NE)                                              
//SORTIN   DD  DSN=BP13.F222.BP13A216,                                          
//             DISP=SHR                                                         
//SORTOUT  DD  DSN=&&BP13F222,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=SYSDA,                                                      
//             SPACE=(TRK,(10,5),RLSE),                                         
//             DCB=(BLKSIZE=0,LRECL=100,RECFM=FB)                               
//SYSIN    DD  *                                                                
     SORT FIELDS=(1,15,A),FORMAT=CH                                             
/*                                                                              
//******************************************************************            
//* TO CREATE TEMP BP13K222 FILE                                                
//******************************************************************            
//STEP05   EXEC PGM=IDCAMS,COND=(0,NE),REGION=4096K                             
//SYSPRINT DD   SYSOUT=*                                                        
//INPUT    DD   DSN=&&BP13F222,DISP=(SHR,PASS)                                  
//SYSIN    DD   *                                                               
           DEL 'BP13.K222.BP13A216' CLUSTER PURGE                               
           DEF CLUSTER                                     -                    
               (NAME(BP13.K222.BP13A216)                   -                    
                TRK(2 1)                                   -                    
                UNIQUE                                     -                    
                SHR(2 3))                                  -                    
               DATA                                        -                    
               (NAME(BP13.K222.BP13A216.DATA)              -                    
                KEYS(13 0)                                 -                    
                RECSZ(100 100)                             -                    
                CISZ(4096)                                 -                    
                FSPC(10 10))                               -                    
               INDEX                                       -                    
               (NAME(BP13.K222.BP13A216.INDEX)             -                    
                CISZ(4096))                                                     
           IF MAXCC = 0  THEN                              -                    
              REPRO IFILE(INPUT)                           -                    
              ODS(BP13.K222.BP13A216)                                           
//*---------------------------------------------------------------------        
//* REFORMAT THE FLATLIST FILE TO INTV FILE FORMAT                              
//*---------------------------------------------------------------------        
//STEP8  EXEC    PGM=BP13C27B,COND=(0,NE)                                       
//BM06F800 DD  DSN=BM06.F800.ALLOUNIT,                                          
//             DISP=SHR                                                         
//BP13F205 DD  DSN=BP13.F205.WISREC,                                            
//             DISP=SHR                                                         
//M06F800A DD  DSN=&&BM06F800,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=SYSDA,                                                      
//             SPACE=(CYL,(10,5),RLSE),                                         
//             DCB=(BLKSIZE=0,LRECL=800,RECFM=FB)                               
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
/*                                                                              
//*---------------------------------------------------------------------        
//* SORT EST/N/C/BLK, FLAT-TYPE ORDER                                           
//*---------------------------------------------------------------------        
//STEP8A  EXEC    SORT,COND=(0,NE)                                              
//SORTIN   DD  DSN=&&BM06F800,                                                  
//             DISP=(SHR,PASS)                                                  
//SORTOUT  DD  DSN=BM06.F800.ALLOUNIT.ADHC1,                                    
//             DISP=SHR                                                         
//SYSIN    DD  *                                                                
     SORT FIELDS=(559,2,A,546,2,A,291,8,A,15,13,A,1,11,A),                      
     FORMAT=CH                                                                  
     SUM FIELDS=NONE                                                            
     INCLUDE COND=(619,1,CH,EQ,C'Y')                                            
/*                                                                              
//*---------------------------------------------------------------------        
//* SORT EST/N/C/BLK, FLAT-TYPE ORDER                                           
//*---------------------------------------------------------------------        
//STEP8B  EXEC    SORT,COND=(0,NE)                                              
//SORTIN   DD  DSN=&&BM06F800,                                                  
//             DISP=(SHR,PASS)                                                  
//SORTOUT  DD  DSN=BM06.F800.ALLOUNIT.ADHC1,                                    
//             DISP=MOD                                                         
//SYSIN    DD  *                                                                
     SORT FIELDS=(559,2,A,546,2,A,291,8,A,544,2,A,15,13,A,1,11,A),              
     FORMAT=CH                                                                  
     SUM FIELDS=NONE                                                            
     INCLUDE COND=(619,1,CH,NE,C'Y')                                            
/*                                                                              
//*--------------------------------------------------------------------         
//*       DEFINE FILE BP13.F230.BP13A216                                        
//*--------------------------------------------------------------------         
//STEP09  EXEC    PGM=IEBGENER,COND=(0,NE)                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUT1   DD  DSN=NULLFILE,                                                    
//             RECFM=FB,LRECL=450,                                              
//             BLKSIZE=0                                                        
//SYSUT2   DD  DSN=BP13.F230.BP13A216,                                          
//             DISP=(NEW,CATLG),                                                
//             UNIT=DISK,                                                       
//             SPACE=(CYL,(1,1)),                                               
//             RECFM=FB,LRECL=450,                                              
//             BLKSIZE=0                                                        
//SYSIN    DD  DUMMY                                                            
//*--------------------------------------------------------------------         
//*       DEFINE FILE BP13.F230.BP13D216                                        
//*--------------------------------------------------------------------         
//STEP09B EXEC    PGM=IEBGENER,COND=(0,NE)                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUT1   DD  DSN=NULLFILE,                                                    
//             RECFM=FB,LRECL=450,                                              
//             BLKSIZE=0                                                        
//SYSUT2   DD  DSN=BP13.F230.BP13D216,                                          
//             DISP=(NEW,CATLG),                                                
//             UNIT=DISK,                                                       
//             SPACE=(CYL,(1,1)),                                               
//             RECFM=FB,LRECL=450,                                              
//             BLKSIZE=0                                                        
//SYSIN    DD  DUMMY                                                            
//*---------------------------------------------------------------------        
//* REFORMAT THE FLATLIST FILE TO INTV FILE FORMAT                              
//*---------------------------------------------------------------------        
//STEP10 EXEC    PGM=BP13C227,COND=(0,NE)                                       
//BM06F800 DD  DSN=BM06.F800.ALLOUNIT.ADHC1,                                    
//             DISP=SHR                                                         
//BP13F205 DD  DSN=BP13.F205.WISREC,                                            
//             DISP=SHR                                                         
//BM06K510 DD  DSN=BM06.K510.ESTCDE,                                            
//             DISP=SHR                                                         
//BM06K100 DD  DSN=BM06.K100.BLOCK,                                             
//             DISP=SHR                                                         
//BP13K060 DD  DSN=BP13.K060.CODETAB,                                           
//             DISP=SHR                                                         
//BP13K222 DD  DSN=BP13.K222.BP13A216,                                          
//             DISP=SHR                                                         
//BP13K270 DD  DSN=BP13.K270.BOOKPGM,                                           
//             DISP=SHR                                                         
//BP13K813 DD  DSN=BP13.K813.BTOBE,                                             
//             DISP=SHR                                                         
//BP13KQ30 DD  DSN=BP13.KQ30.PAIR,                                              
//             DISP=SHR                                                         
//BP13KQ31 DD  DSN=BP13.KQ30.PAIR.PATH1,                                        
//             DISP=SHR                                                         
//BP13KQ50 DD  DSN=BP13.KQ50.GROUNIT,                                           
//             DISP=SHR                                                         
//BP13F230 DD  DSN=BP13.F230.BP13A216,                                          
//             DISP=SHR                                                         
//P13F230B DD  DSN=BP13.F230.BP13D216,                                          
//             DISP=SHR                                                         
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
/*                                                                              
//*---------------------------------------------------------------------        
//*  ACCUMULATE THE CONTROL REC INTO CTLREC-ACC FILE                            
//*---------------------------------------------------------------------        
//STEP13 EXEC    PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT DD  SYSOUT=*                                                         
//INPUT1   DD  DSN=BP13.F205.WISREC,                                            
//             DISP=SHR                                                         
//OUTPUT1  DD  DSN=BP13.F205.ACCUM,                                             
//             DISP=MOD                                                         
//SYSIN    DD  *                                                                
      REPRO INFILE(INPUT1) OUTFILE(OUTPUT1)                                     
/*                                                                              
//*---------------------------------------------------------------------        
//* END BP13A216                                                                
//*---------------------------------------------------------------------        
