//BP13M402 JOB (BP13P),'BP13',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),                
//         NOTIFY=CSD0071                                                       
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//**************************************************************                
//*  TO SEND DYNAMIC JDE AHEAD OF THE PRINT DATASET                             
//*  PRT01 : CLASS = 2, COPIES = 1 ** (SALES - AGM TEAM)                        
//**************************************************************                
//PRT01   EXEC PGM=IEBGENER                                                     
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAALAG1A CP-1',END;                                    
1$DJDE$ JDE=BP13D,JDL=BP13,END;                                                 
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALAG1A                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID),DEST=IOM2                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*--------------------------------------------------------------------         
//*      VERIFY FILES BP13K800                                                  
//*--------------------------------------------------------------------         
//STEP0A  EXEC PGM=IDCAMS,COND=(0,NE)                                           
//INPUT1   DD DSN=BP13.K800.APPLN,DISP=OLD                                      
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN   DD *                                                                  
          VFY FILE(INPUT1)                                                      
//*---------------------------------------------------------------------        
//* OUTREC REGN/NRIC1                                                           
//*---------------------------------------------------------------------        
//STEP01   EXEC SORT,CYL=30,COND=(0,NE)                                         
//SORTIN   DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//         AMP=('BUFND=23')                                                     
//SORTOUT  DD DSN=&&F800NRIC,DISP=(NEW,PASS),                                   
//         UNIT=SYSDA,DCB=(RECFM=FB,LRECL=30),                                  
//         SPACE=(CYL,(50,20),RLSE)                                             
//SYSIN    DD  *                                                                
  SORT FIELDS=(4,8,A),FORMAT=CH                                                 
  INCLUDE COND=(1,1,CH,NE,C'C',AND,                                             
                4,1,CH,LT,C'9',AND,                                             
                88,1,CH,NE,C' ')                                                
  OUTREC FIELDS=(4,8,88,9,13X)                                                  
//*---------------------------------------------------------------------        
//* OUTREC REGN/NRIC2                                                           
//*---------------------------------------------------------------------        
//STEP02   EXEC SORT,CYL=30,COND=(0,NE)                                         
//SORTIN   DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//         AMP=('BUFND=23')                                                     
//SORTOUT  DD DSN=&&F800NRIC,DISP=(MOD,PASS),                                   
//         UNIT=SYSDA,DCB=(RECFM=FB,LRECL=30),                                  
//         SPACE=(CYL,(50,20),RLSE)                                             
//SYSIN    DD  *                                                                
  SORT FIELDS=(4,8,A),FORMAT=CH                                                 
  INCLUDE COND=(1,1,CH,NE,C'C',AND,                                             
                4,1,CH,LT,C'9',AND,                                             
                97,1,CH,NE,C' ')                                                
  OUTREC FIELDS=(4,8,97,9,13X)                                                  
//*---------------------------------------------------------------------        
//* OUTREC REGN/NRIC3                                                           
//*---------------------------------------------------------------------        
//STEP03   EXEC SORT,CYL=30,COND=(0,NE)                                         
//SORTIN   DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//         AMP=('BUFND=23')                                                     
//SORTOUT  DD DSN=&&F800NRIC,DISP=(MOD,PASS),                                   
//         UNIT=SYSDA,DCB=(RECFM=FB,LRECL=30),                                  
//         SPACE=(CYL,(50,20),RLSE)                                             
//SYSIN    DD  *                                                                
  SORT FIELDS=(4,8,A),FORMAT=CH                                                 
  INCLUDE COND=(1,1,CH,NE,C'C',AND,                                             
                4,1,CH,LT,C'9',AND,                                             
                106,1,CH,NE,C' ')                                               
  OUTREC FIELDS=(4,8,106,9,13X)                                                 
//*---------------------------------------------------------------------        
//* OUTREC REGN/NRIC4                                                           
//*---------------------------------------------------------------------        
//STEP04   EXEC SORT,CYL=30,COND=(0,NE)                                         
//SORTIN   DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//         AMP=('BUFND=23')                                                     
//SORTOUT  DD DSN=&&F800NRIC,DISP=(MOD,PASS),                                   
//         UNIT=SYSDA,DCB=(RECFM=FB,LRECL=30),                                  
//         SPACE=(CYL,(50,20),RLSE)                                             
//SYSIN    DD  *                                                                
  SORT FIELDS=(4,8,A),FORMAT=CH                                                 
  INCLUDE COND=(1,1,CH,NE,C'C',AND,                                             
                4,1,CH,LT,C'9',AND,                                             
                115,1,CH,NE,C' ')                                               
  OUTREC FIELDS=(4,8,115,9,13X)                                                 
//*---------------------------------------------------------------------        
//* SORT IN NRIC ORDER                                                          
//*---------------------------------------------------------------------        
//STEP05   EXEC SORT,CYL=30,COND=(0,NE)                                         
//SORTIN   DD DSN=&&F800NRIC,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&BP13NRIC,DISP=(,PASS),                                      
//         UNIT=SYSDA,DCB=(RECFM=FB,LRECL=30),                                  
//         SPACE=(CYL,(50,20),RLSE)                                             
//SYSIN    DD  *                                                                
  SORT FIELDS=(9,9,A),FORMAT=CH                                                 
//*---------------------------------------------------------------------        
//* MATCH PPOS FOR SC/CC ELIGIBILITY                                            
//*---------------------------------------------------------------------        
//STEP06 EXEC PGM=BP13C362,COND=(0,NE)                                          
//BP13INP  DD DSN=&&BP13NRIC,DISP=(OLD,PASS)                                    
//BR10K010 DD DSN=BR10.K010.PTEPPTY,DISP=SHR,                                   
//        AMP=('BUFND=23')                                                      
//BP13OUT  DD DSN=BP13.F800.SCELIG,DISP=OLD                                     
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//*                                                                             
//*---------------------------------------------------------------------        
//* SORT IN REGN-NO ORDER FOR THIS MONTH CASES FOUND IN PPOS FILE               
//*---------------------------------------------------------------------        
//STEP07   EXEC SORT,CYL=30,COND=(0,NE)                                         
//SORTIN   DD DSN=BP13.F800.SCELIG,DISP=SHR                                     
//SORTOUT  DD DSN=&&BP13SCCC,DISP=(NEW,PASS),                                   
//         UNIT=SYSDA,DCB=(RECFM=FB,LRECL=30),                                  
//         SPACE=(CYL,(10,10),RLSE)                                             
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,8,A),FORMAT=CH                                                 
  SUM FIELDS=NONE                                                               
//*---------------------------------------------------------------------        
//* SORT IN REGN-NO ORDER FOR PREVIOUS TAG AS SC/CC INELIGBLE CASES             
//*---------------------------------------------------------------------        
//STEP08   EXEC SORT,CYL=30,COND=(0,NE)                                         
//SORTIN   DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//         AMP=('BUFND=23')                                                     
//SORTOUT  DD DSN=&&BP13INP2,DISP=(,PASS),                                      
//         UNIT=SYSDA,DCB=(RECFM=FB,LRECL=30),                                  
//         SPACE=(CYL,(20,10),RLSE)                                             
//SYSIN    DD  *                                                                
  SORT FIELDS=(4,8,A),FORMAT=CH                                                 
  INCLUDE COND=(1,1,CH,NE,C'C',AND,612,1,CH,EQ,C'N')                            
  OUTREC FIELDS=(4,8,88,9,612,1,12X)                                            
//*---------------------------------------------------------------------        
//* UPDATE SOC MASTER TO SC/CC ELIGIBILITY TAG                                  
//* TO 'N' IF THIS MONTH FOUND IN PPOS                                          
//* TO 'Y' IF THIS MONTH NOT FOUND IN PPOS                                      
//*---------------------------------------------------------------------        
//STEP09 EXEC PGM=BP13C363,COND=(0,NE)                                          
//BP13INP  DD DSN=&&BP13SCCC,DISP=(OLD,PASS)                                    
//BP13INP2  DD DSN=&&BP13INP2,DISP=(OLD,PASS)                                   
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//        AMP=('BUFND=23')                                                      
//BP13F800 DD DSN=BP13.F800.SCELIG.PREVMTH,DISP=OLD                             
//BP13L363 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//P13L363A DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//*                                                                             
