//BP13D513 JOB (BP13P),'BP13D513',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//         NOTIFY=CSD0071                                                       
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//*===================================================================*         
//*                                                                   *         
//*  FOR 3 ROOM WALK-IN EXERCISE                                      *         
//*  TO UPDATE DEMAND/SUPPLY                                          *         
//*                                                                   *         
//*===================================================================*         
//* CHG REF  BY  ON       DESCRIPTION                                 *         
//* -------- --- -------- -----------                                 *         
//* BP133008 CLT 260307   FOR 3 ROOM WIS                              *         
//* BP133058 CLT 260407   FOR 3 ROOM WIS MAY07                        *         
//* BP133076 CLT 260407   FOR 3 ROOM WIS JUN07                        *         
//* BP133090 CLT 260607   FOR 3 ROOM WIS JUL07                        *         
//* BP133114 CLT 260707   FOR 3 ROOM WIS AUG07                        *         
//* BP133139 CLT 280807   FOR 3 ROOM WIS SEP07                        *         
//* BP133160 CLT 270907   FOR 3 ROOM WIS OCT07                        *         
//* BP133187 CLT 291007   FOR 3 ROOM WIS NOV07                        *         
//* BP133207 CLT 261107   FOR 3 ROOM WIS DEC07                        *         
//* BP133236 CLT 271207   FOR 3 ROOM WIS JAN08                        *         
//* BP133253 CLT 230108   FOR 3 ROOM WIS FEB08                        *         
//* BP133278 CLT 260208   FOR 3 ROOM WIS MAR08                        *         
//* BP133295 CCC 260308   FOR 3 ROOM WIS APR08                        *         
//* BP133364 CCC 260608   FOR JUL 2008 QTRLY SALE                     *         
//* BP133439 CCC 290908   FOR OCT 2008 QTRLY SALE                     *         
//* BP133506 CCC 281208   FOR JAN 2009 QTRLY SALE                     *         
//* BP133568 CCC 310309   FOR APR 2009 QTRLY SALE -INCL CANCELLED CASE*         
//* BP133650 CCC 260609   FOR JUL 2009 QTRLY SALE                     *         
//*===================================================================*         
//*--------------------------------------------------------------------         
//*      VERIFY FILES BEFORE DAILY PRODUCTION RUN                               
//*--------------------------------------------------------------------         
//STEP0A  EXEC PGM=IDCAMS,COND=(0,NE)                                           
//INPUT1   DD  DSN=BP13.K779.WIS3R.DEMAND,DISP=OLD                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN   DD *                                                                  
          VFY FILE(INPUT1)                                                      
//*-------------------------------------------------------------------* 00001330
//* SORT OUT BP13K757 REC THAT ARE UNDER 3R AND NON-CANCELLED         * 00001340
//*-------------------------------------------------------------------* 00001350
//STEP01 EXEC SORT,COND=(0,NE)                                          00000150
//SORTIN   DD DSN=BP13.K757.BTO,DISP=SHR                                00000160
//SORTOUT  DD DSN=&&BP13F757,DISP=(,PASS),                              00000180
//        UNIT=SYSDA,DCB=(LRECL=80,RECFM=FB),                                   
//        SPACE=(CYL,(500,250),RLSE)                                            
//SYSIN    DD  *                                                        00000200
   SORT FIELDS=(12,3,A,15,2,A),FORMAT=CH                                        
   OUTREC FIELDS=(12,3,15,2,75X)                                                
   INCLUDE COND=(12,3,CH,EQ,C'3R',AND,                                          
                 2985,8,CH,GE,C'20090701')                                      
//*                                                                             
//*-------------------------------------------------------------------* 00001330
//* SORT ALL CASES ACCORDING TO ESTATE/FLAT TYPE                      * 00001340
//*-------------------------------------------------------------------* 00001350
//STEP02 EXEC SORT,COND=(0,NE)                                          00000150
//SORTIN   DD DSN=&&BP13F757,DISP=(OLD,PASS)                            00000160
//SORTOUT  DD DSN=BP13.F730.MATURERQ.DEMAND,DISP=OLD                    00000180
//SYSIN    DD  *                                                        00000200
   SORT FIELDS=(1,6,A),FORMAT=CH                                                
//*                                                                             
//*--------------------------------------------------------------------*00000820
//* TO UPDATE DEMAND / SUPPLY OF BTO EXERCISE                          *00000830
//*--------------------------------------------------------------------*00000850
//STEP03 EXEC  PGM=BP13C730,COND=(0,NE)                                 00000860
//BP13FMAT DD  DSN=BP13.F730.MATURERQ.DEMAND,DISP=SHR                   00000890
//SY02F001 DD  DSN=SY02.F001.DATE,DISP=SHR                              00000890
//BP13K762 DD  DSN=BP13.K779.WIS3R.DEMAND,DISP=OLD,                             
//             AMP=('BUFND=8','BUFNI=4')                                        
//BP13L730 DD  SYSOUT=*                                                 00000980
//SYSDBG   DD  SYSOUT=*                                                 00001000
//SYSDBOUT DD  SYSOUT=*                                                 00001010
//SYSOUT   DD  SYSOUT=*                                                 00001020
//SYSPRINT DD  SYSOUT=*                                                 00001020
//*                                                                             
//*-------------------------------------------------------------------*         
//* SEND MESSAGE TO OPERATOR TO OPEN FILES                            *         
//*-------------------------------------------------------------------*         
//STEP04   EXEC WTOG,COND=(0,NE)                                                
   ----> ############################################                           
   ---->    AFTER SUCCESSFUL COMPLETION OF BP13D513                             
   ---->    PLEASE OPEN BP13K779.                                               
   ----> ############################################                           
//*-------------------------------------------------------------------*         
//*                      END OF JOB                                   *         
//*-------------------------------------------------------------------*         
