//BP13D106 JOB (BP13P),'BP13D106',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//         SCHENV=PKZIP,NOTIFY=CSD0071                                          
//JOBLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                    
//        DD DSN=AV02.LOAD.SUBR,DISP=SHR                                        
//*-------------------------------------------------------------------*         
//* CHG-NO    ON    BY  - DESCRIPTION                                           
//*--------------------------------------                                       
//* BP133535 090211 LSB - PASS ERROR REC TO SMS                                 
//* BP134093 120214 LSB1 CHG B004 TO AB02,F056-F556,F003-F503,F041-F541         
//* BP135678 050615 IL  - CHANGE SERVER NAME FR SGISFTP TO SGNETSTAGE           
//* BP136285 290816 MRN1- CATER FOR ZIPPED FILE                                 
//* BP137155 080117 LJL1- TO SHIFT THE BACKUP OF F128 ACCUM TO BP13D101         
//* BP138865 020819 GUR1- TO ADD IOMS PRINTING                                  
//* BP139082 280322 LJL1- AUTO TRIGGER OF INCOMING SCRIPT VIA TEXT FILE         
//* BP139082 140422 CCC - CHANGE PARM FROM 30 TO 40 FOR STEP0B                  
//*=================================================================            
//*-------------------------------------------------------------------*         
//* TO SEND DYNAMIC JDE AHEAD OF THE PRINT DATASETS                   *         
//* PRT02 : 1 COPY                           (MA&B)                   *         
//*-------------------------------------------------------------------*         
//PRT01    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAAARS1A CP-1',END;                                    
1$DJDE$ JDE=BP13D,JDL=BP13,END;                                                 
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAAARS1A                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID),DEST=IOM2                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*                                                                             
//*-------------------------------------------------------------------*         
//* TO SEND DYNAMIC JDE AHEAD OF THE PRINT DATASETS                   *         
//* PRT02 : 1 COPY                           (AGREEMENT TEAM)         *         
//*-------------------------------------------------------------------*         
//PRT02    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAALAG1 CP-1',END;                                     
1$DJDE$ JDE=BP13D,JDL=BP13,END;                                                 
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALAG1                                    
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID),DEST=IOM2                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*                                                                             
//*-------------------------------------------------------------------*         
//* TO SEND DYNAMIC JDE AHEAD OF THE PRINT DATASETS                   *         
//* PRT03 : 1 COPY                           (AGREEMENT TEAM)         *         
//*-------------------------------------------------------------------*         
//PRT03    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-FIFA CP-1',END;                                        
1$DJDE$ JDE=BP13D,JDL=BP13,END;                                                 
//FORMID   OUTPUT FORMS=1WD1,GROUPID=FIFA                                       
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID),DEST=IOM2                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*                                                                             
//*=================================================================            
//*----------------------------------------------------------------             
//*  CREATE A DUMMY TXT TO CHECK ON DATA FROM SERVER                            
//*----------------------------------------------------------------             
//STEP0A   EXEC FTP,PARM='SGNETSTAGE (EXIT',COND=(0,NE)                         
//NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                                  
//INPUT    DD *                                                                 
  CD  /PROD/APPN/DATA/BP13/TO-HDB/CPF                                           
  DIR                                                                           
  ASCII                                                                         
  PUT 'BP13.BLANK.CHAR100'  BP13D106.TRIGGER.TXT                                
  DIR                                                                           
  QUIT                                                                          
//*----------------------------------------------------------------             
//*  DELAY JOB IN 30 SECONDS (BASE FILE SIZE)                                   
//*----------------------------------------------------------------             
//STEP0B   EXEC PGM=AV02WAIT,COND=(0,NE),PARM='40'                              
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//*=====================================================================        
//*  RECEIVE S&P FILE FROM CPFB                                                 
//*  DELETE ZIP FILE                                                            
//*=====================================================================        
//S01      EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD   SYSOUT=*                                                        
//SYSIN    DD   *                                                               
     DEL (BP13.F128.CPFDBSS.RECV.ZIP)                                           
     IF MAXCC < 12 THEN                                                         
        SET MAXCC = 0                                                           
//*                                                                             
//*=====================================================================        
//* DEFINE ZIP DATASET                                                          
//*=====================================================================        
//S02      EXEC PGM=IEFBR14,COND=(0,NE)                                         
//OUTPUT   DD DSN=BP13.F128.CPFDBSS.RECV.ZIP,                                   
//         DISP=(NEW,CATLG),DATACLAS=MULTIVOL,                                  
//         SPACE=(1,(200,50),RLSE),AVGREC=M,DSORG=PS,                           
//         RECFM=U,LRECL=0,BLKSIZE=27998                                        
/*                                                                              
//*=====================================================================        
//*   GET DATASET FROM FTP SERVER REJECTION FILE                                
//*   PROD PATH --> /PROD/APPN/DATA/BP13/FROM-HDB/CPF/MF                        
//*   TEST PATH --> /TEST/APPN/DATA/BP13/FROM-HDB/CPF/MF                        
//*=====================================================================        
//S09      EXEC FTP,PARM='SGNETSTAGE (EXIT',COND=(0,NE)                         
//NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                                  
//INPUT    DD *                                                                 
  CD /PROD/APPN/DATA/BP13/TO-HDB/CPF                                            
  BINARY                                                                        
  GET HDBPPMI.TXT.ZIP 'BP13.F128.CPFDBSS.RECV.ZIP' (REPLACE                     
  QUIT                                                                          
/*                                                                              
//*=====================================================================        
//*   UNZIP FILE REJECT FILE                                                    
//*=====================================================================        
//S10      EXEC PKUNZIP,COND=(0,NE)                                             
-ARCHIVE(BP13.F128.CPFDBSS.RECV.ZIP)                                            
-UNZIPPED_DSN(**,BP13.F128.CPFDBSS)                                             
-TEXT                                                                           
-OVERWRITE                                                                      
/*                                                                              
//*=====================================================================        
//*   DELETE DATASET FROM FTP SERVER FOR REJECTION                              
//*=====================================================================        
//S11      EXEC FTP,PARM='SGNETSTAGE (EXIT',COND=(0,NE)                         
//NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                                  
//INPUT    DD *                                                                 
  CD /PROD/APPN/DATA/BP13/TO-HDB/CPF                                            
  DIR                                                                           
  BINARY                                                                        
  MDEL HDBPPMI.TXT.ZIP                                                          
  DIR                                                                           
  QUIT                                                                          
/*                                                                              
//*=====================================================================        
//*   DELETE ENCRYPTED DATASET FROM FTP SERVER REJECTION                        
//*=====================================================================        
//S12      EXEC FTP,PARM='SGNETSTAGE (EXIT',COND=(0,NE)                         
//NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                                  
//INPUT    DD *                                                                 
  CD /PROD/APPN/DATA/BP13/TO-HDB/CPF                                            
  DIR                                                                           
  BINARY                                                                        
  MDEL HDBPPMI.TXT.ZIP.P7                                                       
  DIR                                                                           
  QUIT                                                                          
//*--------------------------------------------------------------------         
//* ACCUM CPF RETURN ON WITHDRAWAL TO MONTHLY FLE                               
//*--------------------------------------------------------------------         
//STEP02   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F128.CPFDBSS,DISP=SHR                                    
//OUTPUT1  DD DSN=BP13.F128.CPFDBSS.ACCUM,DISP=MOD                              
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                     
//*-------------------------------------------------------------------*         
//* MATCHING NRIC/SCH-ACC TO CREATE B04F056 FOR BP13D103                        
//* IF RECORD NOT TALLY OR DATE NOT VALID, WRITE TO ERROR FILE                  
//*-------------------------------------------------------------------*         
//STEP03   EXEC PGM=BP13CC31,COND=(0,NE)                                        
//BP13F128 DD DSN=BP13.F128.CPFDBSS,DISP=SHR                                    
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//AB02F556 DD DSN=BP13.F056.CPFDBSS,DISP=OLD                                    
//P13F128A DD DSN=BP13.F128.CPFDBSS.ERROR,DISP=MOD                              
//BP13LC31 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*---------------------------------------------------------------------        
//* PASS TOP STAMP FEE TOP STAMP FEE SYSTEM ONLY CPF FORM PREFIX WITH PP        
//* CPF FORM PREFIX WITH SS, CPF PAYMENT SYSTEM WILL POST TO STAMP SYS          
//* SORT BY SCH-ACC-NO, NRIC                                                    
//*---------------------------------------------------------------------        
//STEP04   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F056.CPFDBSS,DISP=SHR                                    
//SORTOUT  DD DSN=&&BP13B004,DISP=(,PASS),                                      
//        UNIT=SYSDA,DCB=(RECFM=FB,LRECL=100,BLKSIZE=0),                        
//        SPACE=(CYL,(20,10),RLSE)                                              
//SYSIN    DD  *                                                                
  SORT FIELDS=(90,11,A,2,9,A),FORMAT=CH                                         
  INCLUDE COND=(26,10,CH,EQ,C'DBSS STAMP')                                      
//*---------------------------------------------------------------------        
//* OUTPUT STAMP FEE CPF PAYMENT TO STAMP FEE SYSTEM                            
//* OUTPUT RECORD TO GL FILE                                                    
//*---------------------------------------------------------------------        
//STEP05   EXEC PGM=BP13CCA3,COND=(0,NE)                                        
//AB02F556 DD DSN=&&BP13B004,DISP=(OLD,PASS)                                    
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR,                                   
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13KD40 DD DSN=BP13.KD40.APPLPAY,DISP=SHR,                                   
//         AMP=('BUFND=4','BUFNI=8')                                            
//B05F005  DD DSN=BP13.F128.STPFEE,DISP=MOD                                     
//BP13F180 DD DSN=BP13.F180.DBSS.STAMP,DISP=MOD                                 
//BP13LCA3 DD SYSOUT=2,OUTPUT=(*.PRT03.FORMID),DEST=IOM2                        
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*--------------------------------------------------------------------         
//* ACCUM INTERFCE FILE TO STAMP FEE SYSTEM                                     
//*---------------------------------------------------------------------        
//* PASS ERROR CPF RECORD(PREFIX WITH PP)TO SMS TO CHECK IF IS TOP CASE         
//*---------------------------------------------------------------------        
//STEP07   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F128.CPFDBSS,DISP=SHR                                    
//SORTOUT  DD DSN=BP13.F128.CPFDBSS.ERROR.SMS,DISP=MOD                          
//SYSIN    DD  *                                                                
  SORT FIELDS=(20,11,A,1,9,A),FORMAT=CH                                         
