//BP13A581 JOB (BP13P),'BP13A581',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),    JOB02565
//       NOTIFY=CSD0071                                                         
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//*-------------------------------------------------------------------          
//* STEP12:  GET FIRST 2000 RECS FOR EMAIL                             *        
//*--------------------------------------------------------------------*        
//STEP12   EXEC PGM=IDCAMS                                                      
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F23A.EMAIL.F500,DISP=SHR                                 
//OUTPUT1  DD DSN=BP13.F23A.EMAIL.F5A,DISP=SHR                                  
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1) COUNT(2000)                         
//*--------------------------------------------------------------------*        
//* STEP13:  GET NEXT 2000 RECS FOR EMAIL                              *        
//*--------------------------------------------------------------------*        
//IFTEST1 IF (STEP12.RC = 0) THEN                                               
//STEP13   EXEC PGM=IDCAMS                                                      
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F23A.EMAIL.F500,DISP=SHR                                 
//OUTPUT1  DD DSN=BP13.F23A.EMAIL.F5B,DISP=OLD                                  
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1) COUNT(2000) SKIP(2000)              
//ENDTEST1  ENDIF                                                               
//*--------------------------------------------------------------------*        
//* STEP14:  GET NEXT 2000 RECS FOR EMAIL                              *        
//*--------------------------------------------------------------------*        
//IFTEST1 IF (STEP13.RC = 0) THEN                                               
//STEP14   EXEC PGM=IDCAMS                                                      
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F23A.EMAIL.F500,DISP=SHR                                 
//OUTPUT1  DD DSN=BP13.F23A.EMAIL.F5C,DISP=OLD                                  
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1) COUNT(2000) SKIP(4000)              
//ENDTEST1  ENDIF                                                               
//*--------------------------------------------------------------------*        
//STEP18   EXEC PGM=IDCAMS                                                      
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F23A.EMAIL.F600,DISP=SHR                                 
//OUTPUT1  DD DSN=BP13.F23A.EMAIL.F6A,DISP=SHR                                  
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1) COUNT(2000)                         
//*--------------------------------------------------------------------*        
//* STEP13:  GET NEXT 2000 RECS FOR EMAIL                              *        
//*--------------------------------------------------------------------*        
//IFTEST7 IF (STEP18.RC = 0) THEN                                               
//STEP19   EXEC PGM=IDCAMS                                                      
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F23A.EMAIL.F600,DISP=SHR                                 
//OUTPUT1  DD DSN=BP13.F23A.EMAIL.F6B,DISP=OLD                                  
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1) COUNT(2000) SKIP(2000)              
//ENDTEST7  ENDIF                                                               
//*--------------------------------------------------------------------*        
//* STEP13:  GET NEXT 2000 RECS FOR EMAIL                              *        
//*--------------------------------------------------------------------*        
//IFTEST8 IF (STEP19.RC = 0) THEN                                               
//STEP20   EXEC PGM=IDCAMS                                                      
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F23A.EMAIL.F600,DISP=SHR                                 
//OUTPUT1  DD DSN=BP13.F23A.EMAIL.F6C,DISP=OLD                                  
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1) COUNT(2000) SKIP(4000)              
//ENDTEST8  ENDIF                                                               
//*--------------------------------------------------------------------*        
//* STEP13:  GET NEXT 2000 RECS FOR EMAIL                              *        
//*--------------------------------------------------------------------*        
//IFTEST9 IF (STEP20.RC = 0) THEN                                               
//STEP21   EXEC PGM=IDCAMS                                                      
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F23A.EMAIL.F600,DISP=SHR                                 
//OUTPUT1  DD DSN=BP13.F23A.EMAIL.F6D,DISP=OLD                                  
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1) COUNT(2000) SKIP(6000)              
//ENDTEST9  ENDIF                                                               
//*--------------------------------------------------------------------*        
//* STEP13:  GET NEXT 2000 RECS FOR EMAIL                              *        
//*--------------------------------------------------------------------*        
//IFTEST1 IF (STEP21.RC = 0) THEN                                               
//STEP22   EXEC PGM=IDCAMS                                                      
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F23A.EMAIL.F600,DISP=SHR                                 
//OUTPUT1  DD DSN=BP13.F23A.EMAIL.F6E,DISP=OLD                                  
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1) COUNT(2000) SKIP(8000)              
//ENDTEST1  ENDIF                                                               
//*-------------------------------------------------------------------*         
//* STEP13:  GET NEXT 2000 RECS FOR EMAIL                              *        
//*--------------------------------------------------------------------*        
//IFTEST1 IF (STEP22.RC = 0) THEN                                               
//STEP22   EXEC PGM=IDCAMS                                                      
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F23A.EMAIL.F600,DISP=SHR                                 
//OUTPUT1  DD DSN=BP13.F23A.EMAIL.F6F,DISP=OLD                                  
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1) COUNT(2000) SKIP(10000)             
//ENDTEST1  ENDIF                                                               
//*-------------------------------------------------------------------*         
//* STEP23:  GET FIRST 2000 RECS FOR EMAIL                             *        
//*--------------------------------------------------------------------*        
//STEP23   EXEC PGM=IDCAMS                                                      
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F23A.EMAIL.F700,DISP=SHR                                 
//OUTPUT1  DD DSN=BP13.F23A.EMAIL.F7A,DISP=SHR                                  
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1) COUNT(2000)                         
//*--------------------------------------------------------------------*        
//* STEP24:  GET NEXT 2000 RECS FOR EMAIL                              *        
//*--------------------------------------------------------------------*        
//IFTEST1 IF (STEP23.RC = 0) THEN                                               
//STEP24   EXEC PGM=IDCAMS                                                      
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F23A.EMAIL.F700,DISP=SHR                                 
//OUTPUT1  DD DSN=BP13.F23A.EMAIL.F7B,DISP=OLD                                  
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1) COUNT(2000) SKIP(2000)              
//ENDTEST1  ENDIF                                                               
//*-------------------------------------------------------------------*         
//* STEP25:  GET FIRST 2000 RECS FOR EMAIL                             *        
//*--------------------------------------------------------------------*        
//STEP25   EXEC PGM=IDCAMS                                                      
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F23A.EMAIL.F800,DISP=SHR                                 
//OUTPUT1  DD DSN=BP13.F23A.EMAIL.F8A,DISP=SHR                                  
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1) COUNT(2000)                         
//*--------------------------------------------------------------------*        
//* STEP26:  GET NEXT 2000 RECS FOR EMAIL                              *        
//*--------------------------------------------------------------------*        
//IFTEST1 IF (STEP25.RC = 0) THEN                                               
//STEP26   EXEC PGM=IDCAMS                                                      
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F23A.EMAIL.F800,DISP=SHR                                 
//OUTPUT1  DD DSN=BP13.F23A.EMAIL.F8B,DISP=OLD                                  
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1) COUNT(2000) SKIP(2000)              
//ENDTEST1  ENDIF                                                               
//*--------------------------------------------------------------------*        
//IFTEST1 IF (STEP26.RC = 0) THEN                                               
//STEP27   EXEC PGM=IDCAMS                                                      
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F23A.EMAIL.F800,DISP=SHR                                 
//OUTPUT1  DD DSN=BP13.F23A.EMAIL.F8C,DISP=OLD                                  
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1) COUNT(2000) SKIP(4000)              
//ENDTEST1  ENDIF                                                               
//*--------------------------------------------------------------------*        
//* STEP13:  GET NEXT 2000 RECS FOR EMAIL                              *        
//*--------------------------------------------------------------------*        
//IFTEST1 IF (STEP27.RC = 0) THEN                                               
//STEP28   EXEC PGM=IDCAMS                                                      
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F23A.EMAIL.F800,DISP=SHR                                 
//OUTPUT1  DD DSN=BP13.F23A.EMAIL.F8D,DISP=OLD                                  
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1) COUNT(2000) SKIP(6000)              
//ENDTEST1  ENDIF                                                               
//*--------------------------------------------------------------------*        
//* STEP13:  GET NEXT 2000 RECS FOR EMAIL                              *        
//*--------------------------------------------------------------------*        
//IFTEST1 IF (STEP28.RC = 0) THEN                                               
//STEP29   EXEC PGM=IDCAMS                                                      
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F23A.EMAIL.F800,DISP=SHR                                 
//OUTPUT1  DD DSN=BP13.F23A.EMAIL.F8E,DISP=OLD                                  
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1) COUNT(2000) SKIP(8000)              
//ENDTEST1  ENDIF                                                               
