//BP13Q515 JOB (BP13P),'BP13Q515',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//   NOTIFY=CSD0071                                                             
//JOBLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                    
//*=====================================================================        
//*                      JCL PROFILE                                            
//*=====================================================================        
//* HOUSE KEEPING OF PLAN_TABLE                                                 
//*=====================================================================        
//*=================================================================*           
//* CHGE REQ  DATE     BY    DESCRIPTION                                        
//* --------  ----     ---   -----------                                        
//* BP133064 17052007  IL5   NEW JOB                                            
//* BP135171 11022014  RJE1  TO CATER FOR DB2 UPGRADE                           
//*=================================================================*           
//*------------------------------------------------------------------*          
//* STEP 1  :  *   RUN BP13C999                                                 
//*------------------------------------------------------------------*          
//Q515S001 EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE)                            
//SYSDBG   DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
    DSN SYSTEM(DSN)                                                             
    RUN PROGRAM(BP13C999)       -                                               
    PLAN(BP13PCC) -                                                             
    LIB('BP13.BATCH.LOADCOB')                                                   
    END                                                                         
/*                                                                              
