//BP13M030  JOB (BP13P),'BP13M030',MSGCLASS=N,CLASS=I,MSGLEVEL=(1,1),   00010000
//      NOTIFY=CSD0071                                                  00020000
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,DISP=SHR                          00030000
//********************************************************************* 00250000
//* CHG-NO   BY   ON      - DESCRIPTION                                 00260000
//*------------------------------------                                 00270000
//* BP131000 LSB 20010523 - NEW JOB FOR AMORTISATION OF SA              00280000
//* BP131016 LSB 20010707 - ADD SY02F002 IN C395, COPY TO FIN L395      00290000
//* BP132292 SK  20030320 - ADD BP13C366,C367,C369,C376                 00300000
//* BP132546 YCH 11062004 - INCLUDE STORCLAS(PRODRLS) & LOG(NONE)       00310000
//* BP132571 SK  20040726 - BACKUP BP13.F120.SATRAN.SURR                00320000
//*                                BP13.F690.VOUCHER & COMPLETE         00330000
//*          SK  20040820 - INCLUDE BP13.F690.AMORTISE.ABORT IN BP13C36700340000
//* BP135171 RJE 20140211 - TO CATER FOR DB2 UPGRADE                    00350000
//* BP135903 LSB 20160215 - TO CATER FOR 2-ROOM FLEXI                   00360000
//* BP135903 LSB 20160318 - SPLIT REPORT SA/SHORT LEASE                 00370000
//* BP136163 LSB 20160618 - EXPNAD K690 X(600), AMORTISE PREMIUM,GRANT  00380000
//*                       - BP13C39D WILL REPLACE BP13C396              00390000
//*                       - BP13C39G WILL REPLACE BP13S323              00400000
//*                       - BP13C39H WILL REPLACE BP13S324              00410000
//*                       - BP13C39I WILL REPLACE BP13S325              00420000
//*                       - BP13C39J WILL REPLACE BP13S326              00430000
//* BP136966 LSB 20170928 - BP13L376, L369                              00440000
//* BP137363 LSB 20170928 - READ GRANT TABLE                            00440000
//* BP137885 LSB 20190708 - C395, C30C - DO NOT READ HISTORY FILE       00440000
//*                       - K690.AMORTISE.COMPLETE, DO NOT DO RESERSAL  00430000
//*                       - FOR GRANT AND OTHER PREMIUM FOR SURR CASE   00430000
//* BP138944 FP6 20211018 - EXPAND F690/K690 FROM 600 TO 800            00440000
//********************************************************************* 00450000
//* BACKUP  BP13K690  TO  BP13F690                                      00460000
//********************************************************************* 00470000
//STEP01  EXEC PGM=IDCAMS,COND=(0,NE)                                   00480000
//INPUT1    DD DSN=BP13.K690.AMORTISE,DISP=SHR,                         00490000
//         AMP=('BUFND=4','BUFNI=8')                                    00500000
//OUTPUT1   DD DSN=BP13.F690.AMORTISE.BACKUP,DISP=OLD                   00510000
//*                                                                     00520000
//INPUT2    DD DSN=BP13.F120.SATRAN.AMORT,DISP=SHR                      00530000
//OUTPUT2   DD DSN=BP13.F120.SATRAN.AMORT.MTHBKUP,DISP=OLD              00540000
//*                                                                     00550000
//INPUT3    DD DSN=BP13.F120.SATRAN.SURR,DISP=SHR                       00560000
//OUTPUT3   DD DSN=BP13.F120.SATRAN.SURR.MTHBKUP,DISP=OLD               00570000
//*                                                                     00580000
//INPUT4    DD DSN=BP13.F690.AMORTISE.VOUCHER,DISP=SHR                  00590000
//OUTPUT4   DD DSN=BP13.F690.AMORTISE.VOUCHER.MTHBKUP,DISP=OLD          00600000
//*                                                                     00610000
//INPUT5    DD DSN=BP13.F690.AMORTISE.COMPLETE,DISP=SHR                 00620000
//OUTPUT5   DD DSN=BP13.F690.AMORTISE.COMPLETE.MTHBKUP,DISP=OLD         00630000
//*                                                                     00640000
//INPUT6    DD DSN=BP13.F120.SATRAN.SA.M030,DISP=SHR                    00650000
//OUTPUT6   DD DSN=BP13.F120.SATRAN.SA.M030BKUP,DISP=OLD                00660000
//*                                                                     00670000
//SYSPRINT  DD SYSOUT=*                                                 00680000
//SYSIN     DD *                                                        00690000
  REPRO INFILE(INPUT1) OUTFILE(OUTPUT1)                                 00700000
  REPRO INFILE(INPUT2) OUTFILE(OUTPUT2)                                 00710000
  REPRO INFILE(INPUT3) OUTFILE(OUTPUT3)                                 00720000
  REPRO INFILE(INPUT4) OUTFILE(OUTPUT4)                                 00730000
  REPRO INFILE(INPUT5) OUTFILE(OUTPUT5)                                 00740000
  REPRO INFILE(INPUT6) OUTFILE(OUTPUT6)                                 00750000
//*-------------------------------------------------------------------- 00760000
//*  TO INCLUDE CASES WHEN SALES-TYPE IS 13                             00770000
//*  TRANS-TY=29, PAYMENT-TYPE = SA  STUDO APARTMENT                    00780000
//*  TRANS-TY=29, PAYMENT-TYPE = VRL 2-ROOM FLEXI VARYING LEASE         00790000
//*-------------------------------------------------------------------- 00800000
//STEP02 EXEC SORT,COND=(0,NE)                                          00810000
//SORTIN   DD DSN=BP13.F120.SATRAN.SA.MTH,DISP=SHR                      00820000
//SORTOUT  DD DSN=BP13.F120.SATRAN.SA.M030,DISP=OLD                     00830000
//SYSIN     DD  *                                                       00840000
   SORT FIELDS=(102,11,A),FORMAT=CH                                     00850000
   INCLUDE COND=(1,2,CH,EQ,C'29',AND,                                   00860000
               (99,2,CH,EQ,C'SA',OR,99,3,CH,EQ,C'VRL'))                 00870000
//*-------------------------------------------------------------------- 00880000
//* CREATE BP13F690 AMORTISED FILE FROM SALES ORDER FILE                00890000
//*-------------------------------------------------------------------- 00900000
//STEP03   EXEC PGM=IKJEFT01,COND=(0,NE)                                00910000
//BP13F120 DD DSN=BP13.F120.SATRAN.SA.M030,DISP=SHR                     00920000
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR,                           00930000
//         AMP=('BUFND=4','BUFNI=8')                                    00940000
//*BP13KD09 DD DSN=BP13.KD09.GRANT,DISP=SHR,                            00950000
//*         AMP=('BUFND=4','BUFNI=8')                                   00960000
//BP13F690 DD DSN=BP13.F690.AMORTISE,DISP=OLD                           00970000
//SYSOUT   DD SYSOUT=*                                                  00980000
//SYSTSPRT DD SYSOUT=*                                                  00990000
//SYSPRINT DD SYSOUT=*                                                  01000000
//SYSDBG   DD SYSOUT=*                                                  01010000
//SYSDBOUT DD SYSOUT=*                                                  01020000
//SYSTSIN  DD *                                                         01030000
  DSN SYSTEM(DSN)                                                       01040000
  RUN PROGRAM(BP13C393) PLAN(BP13PCC) -                                 01050000
      LIB('BP13.BATCH.LOADCOB')                                         01060000
  END                                                                   01070000
//*-------------------------------------------------------------------- 01080000
//* MERGE NEW MONTHLY AND ACCUMULATED AMORT FILE                        01090000
//*-------------------------------------------------------------------- 01100000
//STEP04 EXEC SORT,COND=(0,NE)                                          01110000
//SORTIN   DD DSN=BP13.F690.AMORTISE.BACKUP,DISP=SHR                    01120000
//         DD DSN=BP13.F690.AMORTISE,DISP=SHR                           01130000
//SORTOUT  DD DSN=&&F690AMOR,DISP=(NEW,PASS),                           01140000
//             UNIT=SYSDA,                                              01150000
//             DCB=(RECFM=FB,LRECL=800,BLKSIZE=18400),                  01160000
//             SPACE=(CYL,(40,5),RLSE)                                  01170000
//SYSIN     DD  *                                                       01180000
   SORT FIELDS=(1,11,A),FORMAT=CH                                       01190000
   OMIT COND=(1,11,CH,EQ,C'           ')                                01200000
//*-------------------------------------------------------------------- 01210000
//* AMORTISE STUDIO APARTMENT FOR THE  MONTH                            01220000
//*-------------------------------------------------------------------- 01230000
//STEP05   EXEC PGM=BP13C394,COND=(0,NE)                                01240000
//BP13F690 DD DSN=&&F690AMOR,DISP=(OLD,PASS)                            01250000
//BP13F120 DD DSN=BP13.F120.SATRAN.AMORT,DISP=OLD                       01260000
//P13F690A DD DSN=BP13.F690.AMORTISE.ACCUM,DISP=OLD                     01270000
//P13F690B DD DSN=BP13.F690.AMORTISE.NEW,DISP=OLD                       01280000
//P13F690C DD DSN=BP13.F690.AMORTISE.ERROR,DISP=OLD                     01290000
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                               01300000
//SYSOUT   DD SYSOUT=*                                                  01310000
//SYSTSPRT DD SYSOUT=*                                                  01320000
//SYSPRINT DD SYSOUT=*                                                  01330000
//SYSDBG   DD SYSOUT=*                                                  01340000
//SYSDBOUT DD SYSOUT=*                                                  01350000
//SYSTSIN  DD *                                                         01360000
//*-------------------------------------------------------------------- 01370000
//*  TO MERGE ACCUM AND ERROR FILE TO GET THE FINAL ACCUM               01380000
//*-------------------------------------------------------------------- 01390000
//STEP06 EXEC SORT,COND=(0,NE)                                          01400000
//SORTIN   DD DSN=BP13.F690.AMORTISE.ACCUM,DISP=SHR                     01410000
//         DD DSN=BP13.F690.AMORTISE.ERROR,DISP=SHR                     01420000
//SORTOUT  DD DSN=&&F690SORT,DISP=(NEW,PASS),                           01430000
//             UNIT=SYSDA,                                              01440000
//             DCB=(RECFM=FB,LRECL=800,BLKSIZE=18400),                  01450000
//             SPACE=(CYL,(40,5),RLSE)                                  01460000
//SYSIN     DD  *                                                       01470000
   SORT FIELDS=(1,11,A),FORMAT=CH                                       01480000
   SUM FIELDS=NONE                                                      01490000
//*-------------------------------------------------------------------- 01500000
//*   DELETE AND DEFINE BP13K690                                        01510000
//*-------------------------------------------------------------------- 01520000
//STEP07   EXEC PGM=IDCAMS,COND=(0,NE)                                  01530000
//SYSPRINT DD SYSOUT=*                                                  01540000
//BP13F690 DD DSN=&&F690SORT,DISP=(OLD,PASS)                            01550000
//SYSIN    DD *                                                         01560000
         DEL 'BP13.K690.AMORTISE' CL PURGE                              01570000
         DEF CL (NAME(BP13.K690.AMORTISE)       -                       01580000
                 CYL(30 10)                        -                    01590000
                 STORCLAS(PRODRLS)               -                      01600000
                 LOG(NONE)                       -                      01610000
                 SPEED                           -                      01620000
                 UNIQUE                          -                      01630000
                 SHR(2 3))                       -                      01640000
                 DATA                            -                      01650000
                 (NAME(BP13.K690.AMORTISE.DATA)  -                      01660000
                 KEYS(11 0)                      -                      01670000
                 RECSZ(800 800)                  -                      01680000
                 CISZ(4096))                     -                      01690000
                 INDEX                           -                      01700000
                 (NAME(BP13.K690.AMORTISE.INDEX))                       01710000
              IF MAXCC = 0 THEN                                         01720000
                 REPRO INFILE(BP13F690) ODS(BP13.K690.AMORTISE)         01730000
//*-------------------------------------------------------------------- 01740000
//*  TO MERGE ACCUM AND ERROR FILE TO GET THE FINAL ACCUM               01750000
//*-------------------------------------------------------------------- 01760000
//STEP7A EXEC SORT,COND=(0,NE)                                          01770000
//SORTIN   DD DSN=BP13.F690.AMORTISE.ACCUM,DISP=SHR                     01780000
//         DD DSN=BP13.F690.AMORTISE.ERROR,DISP=SHR                     01790000
//         DD DSN=BP13.F690.AMORTISE.COMPLETE,DISP=SHR                  01800000
//SORTOUT  DD DSN=&&F690COMP,DISP=(NEW,PASS),                           01810000
//             UNIT=SYSDA,                                              01820000
//             DCB=(RECFM=FB,LRECL=800,BLKSIZE=18400),                  01830000
//             SPACE=(CYL,(40,5),RLSE)                                  01840000
//SYSIN     DD  *                                                       01850000
   SORT FIELDS=(1,11,A),FORMAT=CH                                       01860000
   SUM FIELDS=NONE                                                      01870000
//*-------------------------------------------------------------------- 01880000
//*   DELETE AND DEFINE BP13K690                                        01890000
//*-------------------------------------------------------------------- 01900000
//STEP07B  EXEC PGM=IDCAMS,COND=(0,NE)                                  01910000
//SYSPRINT DD SYSOUT=*                                                  01920000
//BP13F690 DD DSN=&&F690COMP,DISP=(OLD,PASS)                            01930000
//SYSIN    DD *                                                         01940000
         DEL 'BP13.K690.AMORTISE.COMPLETE' CL PURGE                     01950000
         DEF CL (NAME(BP13.K690.AMORTISE.COMPLETE) -                    01960000
                 CYL(30 10)                        -                    01970000
                 STORCLAS(PRODRLS)               -                      01980000
                 LOG(NONE)                       -                      01990000
                 SPEED                           -                      02000000
                 UNIQUE                          -                      02010000
                 SHR(2 3))                       -                      02020000
                 DATA                            -                      02030000
                 (NAME(BP13.K690.AMORTISE.COMPLETE.DATA) -              02040000
                 KEYS(11 0)                      -                      02050000
                 RECSZ(800 800)                  -                      02060000
                 CISZ(4096))                     -                      02070000
                 INDEX                           -                      02080000
                 (NAME(BP13.K690.AMORTISE.COMPLETE.INDEX))              02090000
            IF MAXCC = 0 THEN                                           02100000
               REPRO INFILE(BP13F690) ODS(BP13.K690.AMORTISE.COMPLETE)  02110000
//*-------------------------------------------------------------------- 02120000
//*  PROCESS SA                                                         02130000
//*  TO MERGE F120.AMORT & F120.SURR FILE                               02140000
//*-------------------------------------------------------------------- 02150000
//STEP08   EXEC SORT,COND=(0,NE)                                        02160000
//SORTIN   DD DSN=BP13.F120.SATRAN.AMORT,DISP=SHR                       02170000
//         DD DSN=BP13.F120.SATRAN.SURR,DISP=SHR                        02180000
//SORTOUT  DD DSN=&&F120SA,DISP=(NEW,PASS),                             02190000
//             UNIT=SYSDA,                                              02200000
//             DCB=(RECFM=FB,LRECL=150,BLKSIZE=0),                      02210000
//             SPACE=(CYL,(40,5),RLSE)                                  02220000
//SYSIN    DD  *                                                        02230000
   SORT FIELDS=(1,2,A),FORMAT=CH                                        02240000
   INCLUDE COND=(99,3,CH,EQ,C'SA1',OR,                                  02250000
                 99,3,CH,EQ,C'SA2')                                     02260000
//*-------------------------------------------------------------------- 02270000
//* PREPARE SA GL TRANSACTION                                           02280000
//*-------------------------------------------------------------------- 02290000
//STEP09   EXEC PGM=BP13C395,COND=(0,NE)                                02300000
//BP13F120 DD DSN=&&F120SA,DISP=(OLD,PASS)                              02310000
//SY02F001 DD  DSN=SY02.F001.DATE,DISP=SHR                              02320000
//BP13K690 DD DSN=BP13.K690.AMORTISE,DISP=SHR,                          02330000
//         AMP=('BUFND=4','BUFNI=8')                                    02340000
//BP13F180 DD DSN=BP13.F180.GLTRAN.AMORT,DISP=OLD                       02350000
//BP13L395 DD DSN=BP13.L395.BP13C395,DISP=OLD                           02360000
//SYSOUT   DD SYSOUT=*                                                  02370000
//SYSTSPRT DD SYSOUT=*                                                  02380000
//SYSPRINT DD SYSOUT=*                                                  02390000
//SYSDBG   DD SYSOUT=*                                                  02400000
//SYSDBOUT DD SYSOUT=*                                                  02410000
//SYSTSIN  DD *                                                         02420000
//*-----------------------------------------------------------------    02430000
//* PREPARE SA AND VRL GL TRANSACTION FOR AHG/SHG/SRG/REG               02440000
//*-----------------------------------------------------------------    02450000
//STEP10   EXEC PGM=BP13C39E,COND=(0,NE)                                02460000
//BP13F120 DD DSN=BP13.F120.SATRAN.SA.M030,DISP=SHR                     02470000
//SY02F001 DD  DSN=SY02.F001.DATE,DISP=SHR                              02480000
//BP13K690 DD DSN=BP13.K690.AMORTISE,DISP=SHR,                          02490000
//         AMP=('BUFND=4','BUFNI=8')                                    02500000
//BP13F180 DD DSN=BP13.F180.GLTRAN.AMORTGRN,DISP=OLD                    02510000
//BP13L39E DD DSN=BP13.L39E.BP13C39E,DISP=OLD                           02520000
//SYSOUT   DD SYSOUT=*                                                  02530000
//SYSTSPRT DD SYSOUT=*                                                  02540000
//SYSPRINT DD SYSOUT=*                                                  02550000
//SYSDBG   DD SYSOUT=*                                                  02560000
//SYSDBOUT DD SYSOUT=*                                                  02570000
//SYSTSIN  DD *                                                         02580000
//*-------------------------------------------------------------------- 02590000
//* SORT BP13F180 IN GL DESCRIPTION ORDER FOR SA                        02600000
//*-------------------------------------------------------------------- 02610000
//STEP11   EXEC SORT,COND=(0,NE)                                        02620000
//SORTIN   DD DSN=BP13.F180.GLTRAN.AMORT,DISP=SHR                       02630000
//         DD DSN=BP13.F180.GLTRAN.AMORTGRN,DISP=SHR                    02640000
//SORTOUT  DD DSN=&&F180SA,DISP=(NEW,PASS),                             02650000
//            UNIT=SYSDA,SPACE=(CYL,(20,5),RLSE),                       02660000
//            DCB=(BLKSIZE=0,LRECL=120,RECFM=FB)                        02670000
//SYSOUT   DD SYSOUT=*                                                  02680000
//SYSPRINT DD SYSOUT=*                                                  02690000
//SYSIN    DD   *                                                       02700000
   SORT FIELDS=(58,40,A),FORMAT=CH                                      02710000
   INCLUDE COND=(1,2,CH,EQ,C'SA')                                       02720000
//*-------------------------------------------------------------------- 02730000
//* SUM DETAIL GL TRAN RECORD TO GL SYSTEM FOR SA                       02740000
//*-------------------------------------------------------------------- 02750000
//STEP12   EXEC PGM=BP13C109,COND=(0,NE)                                02760000
//BP13F180 DD DSN=&&F180SA,DISP=(OLD,PASS)                              02770000
//AG20F900 DD DSN=BP13.F190.AASUM.AMORT,DISP=OLD                        02780000
//SYSPRINT DD SYSOUT=*                                                  02790000
//SYSOUT   DD SYSOUT=*                                                  02800000
//SYSDBG   DD SYSOUT=*                                                  02810000
//SYSDBOUT DD SYSOUT=*                                                  02820000
//*-------------------------------------------------------------------- 02830000
//* MERGE F120.AMORT & F120.SURR FILE - 2-ROOM FLEXI                    02840000
//*-------------------------------------------------------------------- 02850000
//STEP13   EXEC SORT,COND=(0,NE)                                        02860000
//SORTIN   DD DSN=BP13.F120.SATRAN.AMORT,DISP=SHR                       02870000
//         DD DSN=BP13.F120.SATRAN.SURR,DISP=SHR                        02880000
//SORTOUT  DD DSN=&&F120VRL,DISP=(NEW,PASS),                            02890000
//             UNIT=SYSDA,                                              02900000
//             DCB=(RECFM=FB,LRECL=150,BLKSIZE=0),                      02910000
//             SPACE=(CYL,(40,5),RLSE)                                  02920000
//SYSIN    DD  *                                                        02930000
   SORT FIELDS=(1,2,A),FORMAT=CH                                        02940000
   INCLUDE COND=(99,3,CH,EQ,C'VRL')                                     02950000
//*-------------------------------------------------------------------- 02960000
//* PREPARE VRL GL TRANSACTION FOR 2-ROOM FLEXI                         02970000
//*-------------------------------------------------------------------- 02980000
//STEP14   EXEC PGM=BP13C39C,COND=(0,NE)                                02990000
//BP13F120 DD DSN=&&F120VRL,DISP=(OLD,PASS)                             03000000
//SY02F001 DD  DSN=SY02.F001.DATE,DISP=SHR                              03010000
//BP13K690 DD DSN=BP13.K690.AMORTISE,DISP=SHR,                          03020000
//         AMP=('BUFND=4','BUFNI=8')                                    03030000
//BP13F180 DD DSN=BP13.F180.GLTRAN.AMORTVRL,DISP=OLD                    03040000
//BP13L39C DD DSN=BP13.L39C.BP13C39C,DISP=OLD                           03050000
//SYSOUT   DD SYSOUT=*                                                  03060000
//SYSTSPRT DD SYSOUT=*                                                  03070000
//SYSPRINT DD SYSOUT=*                                                  03080000
//SYSDBG   DD SYSOUT=*                                                  03090000
//SYSDBOUT DD SYSOUT=*                                                  03100000
//SYSTSIN  DD *                                                         03110000
//*-----------------------------------------------------------------    03120000
//* PREPARE SA/VRL GL TRANSACTION FOR PREMIUM ( SINGLE, ELDERLY, SPR)   03130000
//*-----------------------------------------------------------------    03140000
//STEP15   EXEC PGM=BP13C39K,COND=(0,NE)                                03150000
//BP13F120 DD DSN=BP13.F120.SATRAN.SA.M030,DISP=SHR                     03160000
//SY02F001 DD  DSN=SY02.F001.DATE,DISP=SHR                              03170000
//BP13K690 DD DSN=BP13.K690.AMORTISE,DISP=SHR,                          03180000
//         AMP=('BUFND=4','BUFNI=8')                                    03190000
//BP13F180 DD DSN=BP13.F180.GLTRAN.PREMIUM,DISP=OLD                     03200000
//BP13L39K DD DSN=BP13.L39K.BP13C39K,DISP=OLD                           03210000
//SYSOUT   DD SYSOUT=*                                                  03220000
//SYSTSPRT DD SYSOUT=*                                                  03230000
//SYSPRINT DD SYSOUT=*                                                  03240000
//SYSDBG   DD SYSOUT=*                                                  03250000
//SYSDBOUT DD SYSOUT=*                                                  03260000
//SYSTSIN  DD *                                                         03270000
//*-----------------------------------------------------------------    03280000
//* SORT BP13F180 IN GL DESCRIPTION ORDER FOR GRANT                     03290000
//*-----------------------------------------------------------------    03300000
//STEP16   EXEC SORT,COND=(0,NE)                                        03310000
//SORTIN   DD DSN=BP13.F180.GLTRAN.AMORTVRL,DISP=SHR                    03320000
//         DD DSN=BP13.F180.GLTRAN.PREMIUM,DISP=SHR                     03330000
//         DD DSN=BP13.F180.GLTRAN.AMORTGRN,DISP=SHR                    03340000
//SORTOUT  DD DSN=&&F180PRM,DISP=(NEW,PASS),                            03350000
//            UNIT=SYSDA,SPACE=(CYL,(20,5),RLSE),                       03360000
//            DCB=(BLKSIZE=0,LRECL=120,RECFM=FB)                        03370000
//SYSOUT   DD SYSOUT=*                                                  03380000
//SYSPRINT DD SYSOUT=*                                                  03390000
//SYSIN    DD   *                                                       03400000
   SORT FIELDS=(58,40,A),FORMAT=CH                                      03410000
   INCLUDE COND=(1,2,CH,EQ,C'SF')                                       03420000
//*-----------------------------------------------------------------    03440000
//* SUM DETAIL GL TRAN RECORD TO GL SYSTEM                              03450000
//*-----------------------------------------------------------------    03460000
//STEP17   EXEC PGM=BP13C109,COND=(0,NE)                                03470000
//BP13F180 DD DSN=&&F180PRM,DISP=(OLD,PASS)                             03480000
//AG20F900 DD DSN=BP13.F190.AASUM.AMORT,DISP=MOD                        03490000
//SYSPRINT DD SYSOUT=*                                                  03500000
//SYSOUT   DD SYSOUT=*                                                  03510000
//SYSDBG   DD SYSOUT=*                                                  03520000
//SYSDBOUT DD SYSOUT=*                                                  03530000
//*-----------------------------------------------------------------            
//* SORT BP13F180 IN GL DESCRIPTION ORDER FOR GRANT (FSH)                       
//*-----------------------------------------------------------------            
//STEP18   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F180.GLTRAN.AMORTVRL,DISP=SHR                    03870012
//         DD DSN=BP13.F180.GLTRAN.PREMIUM,DISP=SHR                     03870012
//         DD DSN=BP13.F180.GLTRAN.AMORTGRN,DISP=SHR                    03870012
//SORTOUT  DD DSN=&&F180FSH,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,SPACE=(CYL,(20,5),RLSE),                       00690000
//            DCB=(BLKSIZE=0,LRECL=120,RECFM=FB)                        00700000
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD   *                                                               
   SORT FIELDS=(58,40,A),FORMAT=CH                                              
   INCLUDE COND=(1,2,CH,EQ,C'SE')                                       00130010
//*-----------------------------------------------------------------            
//* SUM DETAIL GL TRAN RECORD TO GL SYSTEM (FSH)                                
//*-----------------------------------------------------------------            
//STEP19   EXEC PGM=BP13C109,COND=(0,NE)                                        
//BP13F180 DD DSN=&&F180FSH,DISP=(OLD,PASS)                                     
//AG20F900 DD DSN=BP13.F190.AASUM.AMORT,DISP=MOD                                
//SYSPRINT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*-================================================================            
//*-----------------------------------------------------------------    03550000
//* REPORT TO MA&B GL POSTING FOR SA DEFERRED INCOME                    03560000
//*-----------------------------------------------------------------    03570000
//STEP20   EXEC PGM=IEBGENER,COND=(0,NE)                                03580000
//SYSUT1   DD DSN=BP13.L395.BP13C395,DISP=SHR                           03590000
//SYSUT2   DD SYSOUT=8,DEST=IOM8                                                
//SYSPRINT DD SYSOUT=*                                                  03610000
//SYSIN    DD DUMMY                                                     03620000
/*                                                                      03630000
//*-----------------------------------------------------------------    03730000
//* REPORT TO MA&B GL POSTING FOR SA FROM SOC TO GRANT                  03740000
//*-----------------------------------------------------------------    03750000
//STEP22   EXEC PGM=IEBGENER,COND=(0,NE)                                03760000
//SYSUT1   DD DSN=BP13.L39E.BP13C39E,DISP=SHR                           03770000
//SYSUT2   DD SYSOUT=8,DEST=IOM8                                                
//SYSPRINT DD SYSOUT=*                                                  03790000
//SYSIN    DD DUMMY                                                     03800000
/*                                                                      03810000
//*-----------------------------------------------------------------    03910000
//* REPORT TO MA&B GL POSTING FOR 2-ROOM FLEXI,DEFERRED INCOME + GRANT  03920000
//*-----------------------------------------------------------------    03930000
//STEP24   EXEC PGM=IEBGENER,COND=(0,NE)                                03940000
//SYSUT1   DD DSN=BP13.L39C.BP13C39C,DISP=SHR                           03950000
//SYSUT2   DD SYSOUT=8,DEST=IOM8                                                
//SYSPRINT DD SYSOUT=*                                                  03970000
//SYSIN    DD DUMMY                                                     03980000
/*                                                                      03990000
//*-----------------------------------------------------------------    04090000
//* REPORT TO MA&B GL POSTING FOR FOR PREMIUM ( SINGLE, ELDERLY, SPR)   04100000
//*-----------------------------------------------------------------    04110000
//STEP26   EXEC PGM=IEBGENER,COND=(0,NE)                                04120000
//SYSUT1   DD DSN=BP13.L39K.BP13C39K,DISP=SHR                           04130000
//SYSUT2   DD SYSOUT=8,DEST=IOM8                                                
//SYSPRINT DD SYSOUT=*                                                  04150000
//SYSIN    DD DUMMY                                                     04160000
/*                                                                      04170000
//*-----------------------------------------------------------------    04270000
//* SORT BP13F180 IN GL DESCRIPTION ORDER FOR SA                        04280000
//*-----------------------------------------------------------------    04290000
//STEP40   EXEC SORT,COND=(0,NE)                                        04300000
//SORTIN   DD DSN=BP13.F180.GLTRAN.AMORT,DISP=SHR                       04310000
//SORTOUT  DD DSN=&&F180SA40,DISP=(NEW,PASS),                           04320000
//            UNIT=SYSDA,SPACE=(CYL,(20,5),RLSE),                       04330000
//            DCB=(BLKSIZE=0,LRECL=120,RECFM=FB)                        04340000
//SYSOUT   DD SYSOUT=*                                                  04350000
//SYSPRINT DD SYSOUT=*                                                  04360000
//SYSIN    DD   *                                                       04370000
     SORT FIELDS=(15,13,A,98,11,A),FORMAT=CH                            04380000
//*-----------------------------------------------------------------    04390000
//* REPORT ON GL ACCNT-CODE SHOWING DR/CR TOTAL FOR SA                  04400000
//* BP13C39D REPALCE BP13C396                                           04410000
//*-----------------------------------------------------------------    04420000
//STEP41   EXEC PGM=BP13C39D,COND=(0,NE)                                04430000
//BP13F180 DD DSN=&&F180SA40,DISP=(OLD,PASS)                            04440000
//SY02F001 DD  DSN=SY02.F001.DATE,DISP=SHR                              04450000
//BP13K80A DD DSN=BP13.K80A.FLATINFO,DISP=SHR,                          04460000
//         AMP=('BUFND=4','BUFNI=8')                                    04470000
//BP13K690 DD DSN=BP13.K690.AMORTISE,DISP=SHR,                          04480000
//         AMP=('BUFND=4','BUFNI=8')                                    04490000
//BP13L39D DD DSN=&&L39DSA,DISP=(,PASS),                                04500000
//            UNIT=SYSDA,SPACE=(CYL,(15,5),RLSE),                       04510000
//            DCB=(BLKSIZE=27930,LRECL=133,RECFM=FBA)                   04520000
//SYSOUT   DD SYSOUT=*                                                  04530000
//SYSTSPRT DD SYSOUT=*                                                  04540000
//SYSPRINT DD SYSOUT=*                                                  04550000
//SYSDBG   DD SYSOUT=*                                                  04560000
//SYSDBOUT DD SYSOUT=*                                                  04570000
//SYSTSIN  DD *                                                         04580000
//*-----------------------------------------------------------------    04590000
//* OUTPUT TO FILE                                                      04600000
//*-----------------------------------------------------------------    04610000
//STEP42   EXEC PGM=IDCAMS,COND=(0,NE)                                  04620000
//INPUT1    DD DSN=&&L39DSA,DISP=(OLD,PASS)                             04630000
//OUTPUT1   DD DSN=BP13.L39D.BP13C39D,DISP=OLD                          04640000
//SYSPRINT  DD SYSOUT=*                                                 04650000
//SYSIN     DD *                                                        04660000
  REPRO INFILE(INPUT1) OUTFILE(OUTPUT1)                                 04670000
//*-----------------------------------------------------------------    04680000
//* SORT BP13F180 IN GL DESCRIPTION ORDER FOR 2-ROOM FLEXI              04690000
//*-----------------------------------------------------------------    04700000
//STEP43   EXEC SORT,COND=(0,NE)                                        04710000
//SORTIN   DD DSN=BP13.F180.GLTRAN.AMORTVRL,DISP=SHR                    04720000
//SORTOUT  DD DSN=&&F180VR43,DISP=(NEW,PASS),                           04730000
//            UNIT=SYSDA,SPACE=(CYL,(20,5),RLSE),                       04740000
//            DCB=(BLKSIZE=0,LRECL=120,RECFM=FB)                        04750000
//SYSOUT   DD SYSOUT=*                                                  04760000
//SYSPRINT DD SYSOUT=*                                                  04770000
//SYSIN    DD   *                                                       04780000
     SORT FIELDS=(15,13,A,98,11,A),FORMAT=CH                            04790000
//*-----------------------------------------------------------------    04800000
//* REPORT ON GL ACCNT-CODE SHOWING DR/CR TOTAL FOR 2-ROOM FLEXI        04810000
//*-----------------------------------------------------------------    04820000
//STEP44   EXEC PGM=BP13C39D,COND=(0,NE),PARM='-A'                      04830000
//BP13F180 DD DSN=&&F180VR43,DISP=(OLD,PASS)                            04840000
//SY02F001 DD  DSN=SY02.F001.DATE,DISP=SHR                              04850000
//BP13K80A DD DSN=BP13.K80A.FLATINFO,DISP=SHR,                          04860000
//         AMP=('BUFND=4','BUFNI=8')                                    04870000
//BP13K690 DD DSN=BP13.K690.AMORTISE,DISP=SHR,                          04880000
//         AMP=('BUFND=4','BUFNI=8')                                    04890000
//BP13L39D DD DSN=&&L39DVRL,DISP=(,PASS),                               04900000
//            UNIT=SYSDA,SPACE=(CYL,(5,5),RLSE),                        04910000
//            DCB=(BLKSIZE=27930,LRECL=133,RECFM=FBA)                   04920000
//SYSOUT   DD SYSOUT=*                                                  04930000
//SYSTSPRT DD SYSOUT=*                                                  04940000
//SYSPRINT DD SYSOUT=*                                                  04950000
//SYSDBG   DD SYSOUT=*                                                  04960000
//SYSDBOUT DD SYSOUT=*                                                  04970000
//SYSTSIN  DD *                                                         04980000
//*-----------------------------------------------------------------    04990000
//* OUTPUT TO FILE                                                      05000000
//*-----------------------------------------------------------------    05010000
//STEP45   EXEC PGM=IDCAMS,COND=(0,NE)                                  05020000
//INPUT1    DD DSN=&&L39DVRL,DISP=(OLD,PASS)                            05030000
//OUTPUT1   DD DSN=BP13.L39D.BP13C39D,DISP=MOD                          05040000
//SYSPRINT  DD SYSOUT=*                                                 05050000
//SYSIN     DD *                                                        05060000
  REPRO INFILE(INPUT1) OUTFILE(OUTPUT1)                                 05070000
//*-----------------------------------------------------------------    05080000
//* REPORT TO MA&B                                                      05090000
//*-----------------------------------------------------------------    05100000
//STEP46   EXEC PGM=IEBGENER,COND=(0,NE)                                05110000
//SYSUT1   DD DSN=&&L39DSA,DISP=(OLD,PASS)                              05120000
//SYSUT2   DD SYSOUT=8,DEST=IOM8                                                
//SYSPRINT DD SYSOUT=*                                                  05140000
//SYSIN    DD DUMMY                                                     05150000
/*                                                                      05160000
//*-----------------------------------------------------------------    05170000
//* REPORT TO MA&B                                                      05180000
//*-----------------------------------------------------------------    05190000
//STEP47   EXEC PGM=IEBGENER,COND=(0,NE)                                05200000
//SYSUT1   DD DSN=&&L39DVRL,DISP=(OLD,PASS)                             05210000
//SYSUT2   DD SYSOUT=8,DEST=IOM8                                                
//SYSPRINT DD SYSOUT=*                                                  05230000
//SYSIN    DD DUMMY                                                     05240000
/*                                                                      05250000
//*-----------------------------------------------------------------    05260000
//* NEW AMORTISE FILE - SORT BY SA, FLEXI                               05270000
//*-----------------------------------------------------------------    05280000
//STEP48  EXEC SORT,COND=(0,NE)                                         05290000
//SORTIN   DD DSN=BP13.F690.AMORTISE.NEW,DISP=SHR                       05300000
//SORTOUT  DD DSN=&&F690NEW,DISP=(NEW,PASS),                            05310000
//             UNIT=SYSDA,                                              05320000
//             DCB=(RECFM=FB,LRECL=800,BLKSIZE=18400),                  05330000
//             SPACE=(CYL,(40,5),RLSE)                                  05340000
//SYSIN     DD  *                                                       05350000
   SORT FIELDS=(225,1,A,1,11,A),FORMAT=CH                               05360000
//*-------------------------------------------------------------------- 05370000
//* PRINT MONTHLY AMORTISATION REPORT - NEW 'SA' CASES                  05380000
//*-------------------------------------------------------------------- 05390000
//STEP50  EXEC   PGM=BP13C39G,COND=(0,NE)                               05400000
//BP13F690 DD  DSN=&&F690NEW,DISP=(OLD,PASS)                            05410000
//P13L39GA  DD DSN=BP13.L39GA.BP13C39G,DISP=OLD                         05420000
//P13L39GB  DD DSN=BP13.L39GB.BP13C39G,DISP=OLD                         05430000
//SYSOUT   DD  SYSOUT=*                                                 05440000
//SYSPRINT DD  SYSOUT=*                                                 05450000
//SYSDBG   DD  SYSOUT=*                                                 05460000
//SYSDBOUT DD  SYSOUT=*                                                 05470000
//*-----------------------------------------------------------------    05480000
//* ACCUM AMORTISE FILE FOR SA                                          05490000
//*-----------------------------------------------------------------    05500000
//STEP51 EXEC SORT,COND=(0,NE)                                          05510000
//SORTIN   DD DSN=BP13.F690.AMORTISE.ACCUM,DISP=SHR                     05520000
//SORTOUT  DD DSN=&&F690ACCM,DISP=(NEW,PASS),                           05530000
//             UNIT=SYSDA,DCB=(RECFM=FB,LRECL=800,BLKSIZE=18400),       05540000
//             SPACE=(CYL,(40,5),RLSE)                                  05550000
//SYSIN     DD  *                                                       05560000
   SORT FIELDS=(225,1,A,1,11,A,225,1,A),FORMAT=CH                       05570000
//*-----------------------------------------------------------------    05580000
//* PRINT ACCUMLATED AMORTISATION REPORT FOR ALL CASES.                 05590000
//* REPALCE BP13S324                                                    05600000
//*-------------------------------------------------------------------- 05610000
//STEP52  EXEC   PGM=BP13C39H,COND=(0,NE)                               05620000
//BP13F690 DD  DSN=&&F690ACCM,DISP=(OLD,PASS)                           05630000
//BP13L39H  DD DSN=BP13.L39H.BP13C39H,DISP=OLD                          05640000
//SYSOUT   DD  SYSOUT=*                                                 05650000
//SYSPRINT DD  SYSOUT=*                                                 05660000
//SYSDBG   DD  SYSOUT=*                                                 05670000
//SYSDBOUT DD  SYSOUT=*                                                 05680000
//*-----------------------------------------------------------------    05690000
//* PRINT SURRENDER AMORTISATION REPORT FOR ALL CASES.                  05700000
//* REPALCE BP13S326                                                    05710000
//*-------------------------------------------------------------------- 05720000
//STEP53  EXEC   PGM=BP13C39J,COND=(0,NE)                               05730000
//BP13F690 DD  DSN=&&F690ACCM,DISP=(OLD,PASS)                           05740000
//BP13L39J  DD DSN=BP13.L39J.BP13C39J,DISP=OLD                          05750000
//SYSOUT   DD  SYSOUT=*                                                 05760000
//SYSPRINT DD  SYSOUT=*                                                 05770000
//SYSDBG   DD  SYSOUT=*                                                 05780000
//SYSDBOUT DD  SYSOUT=*                                                 05790000
//*-----------------------------------------------------------------    05800000
//* PRINT ACCUMLATED AMORTISATION ERROR REPORT                          05810000
//* REPALCE BP13S325                                                    05820000
//*-------------------------------------------------------------------- 05830000
//STEP54  EXEC   PGM=BP13C39I,COND=(0,NE)                               05840000
//BP13F690 DD  DSN=BP13.F690.AMORTISE.ERROR,DISP=SHR                    05850000
//BP13L39I  DD DSN=BP13.L39I.BP13C39I,DISP=OLD                          05860000
//SYSOUT   DD  SYSOUT=*                                                 05870000
//SYSPRINT DD  SYSOUT=*                                                 05880000
//SYSDBG   DD  SYSOUT=*                                                 05890000
//SYSDBOUT DD  SYSOUT=*                                                 05900000
//*-------------------------------------------------------------------- 05910000
//* SORT BY FLAT TYPE & SCH-ACC-NUMBER (FROM ERROR FILE)                05920000
//*-------------------------------------------------------------------- 05930000
//STEP55   EXEC SORT,COND=(0,NE)                                        05940000
//SORTIN   DD DSN=BP13.F690.AMORTISE.REMARK,DISP=SHR                    05950000
//SORTOUT  DD DSN=&&F690REQ,DISP=(,PASS),                               05960000
//            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=800,BLKSIZE=18400),        05970000
//            SPACE=(CYL,(10,20),RLSE)                                  05980000
//SYSIN    DD  *                                                        05990000
  SORT FIELDS=(162,2,A,1,11,A),FORMAT=CH                                06000000
  INCLUDE COND=(204,2,CH,EQ,C'NS',OR,204,2,CH,EQ,C'AC')                 06010000
/*                                                                      06020000
//*-------------------------------------------------------------------- 06030000
//* SORT BY FLAT TYPE & SCH-ACC-NUMBER (FROM ERROR FILE)                06040000
//*-------------------------------------------------------------------- 06050000
//STEP56   EXEC SORT,COND=(0,NE)                                        06060000
//SORTIN   DD DSN=BP13.F690.AMORTISE.REQUEST,DISP=SHR                   06070000
//         DD DSN=BP13.F690.AMORTISE.ABORT,DISP=SHR                     06080000
//         DD DSN=&&F690REQ,DISP=(OLD,PASS)                             06090000
//SORTOUT  DD DSN=&&F690REQA,DISP=(NEW,PASS),                           06100000
//            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=800,BLKSIZE=18400),        06110000
//            SPACE=(CYL,(10,20),RLSE)                                  06120000
//SYSIN    DD  *                                                        06130000
  SORT FIELDS=(162,2,A,1,11,A),FORMAT=CH                                06140000
/*                                                                      06150000
//*-------------------------------------------------------------------- 06160000
//* PRINT REPORT ON SURRENDER/ABORT DATES OF APARTMENT RECEIVED         06170000
//*-------------------------------------------------------------------- 06180000
//STEP57   EXEC PGM=BP13C367,COND=(0,NE)                                06190000
//BP13F690 DD DSN=&&F690REQA,DISP=(OLD,PASS)                            06200000
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                               06210000
//BP13L367 DD DSN=BP13.L367.BP13C367,DISP=OLD                           06220000
//SYSOUT   DD SYSOUT=*                                                  06230000
//SYSTSPRT DD SYSOUT=*                                                  06240000
//SYSPRINT DD SYSOUT=*                                                  06250000
//SYSDBG   DD SYSOUT=*                                                  06260000
//SYSDBOUT DD SYSOUT=*                                                  06270000
//SYSTSIN  DD *                                                         06280000
//*-------------------------------------------------------------------- 06290000
//* SORT BY FLAT TYPE & SCH-ACC-NUMBER                                  06300000
//*-------------------------------------------------------------------- 06310000
//STEP58   EXEC SORT,COND=(0,NE)                                        06320000
//SORTIN   DD DSN=BP13.F690.AMORTISE.VOUCHER,DISP=SHR                   06330000
//SORTOUT  DD DSN=&&F690VCH,DISP=(NEW,PASS),                            06340000
//            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=800,BLKSIZE=18400),        06350000
//            SPACE=(CYL,(10,20),RLSE)                                  06360000
//SYSIN    DD  *                                                        06370000
  SORT FIELDS=(162,2,A,1,11,A),FORMAT=CH                                06380000
/*                                                                      06390000
//*-------------------------------------------------------------------- 06400000
//* SORT BY FLAT TYPE & SCH-ACC-NUMBER (FROM ERROR FILE)                06410000
//*-------------------------------------------------------------------- 06420000
//STEP59   EXEC SORT,COND=(0,NE)                                        06430000
//SORTIN   DD DSN=BP13.F690.AMORTISE.REMARK,DISP=SHR                    06440000
//SORTOUT  DD DSN=&&F690VCH,DISP=(MOD,PASS)                             06450000
//SYSIN    DD  *                                                        06460000
  SORT FIELDS=(162,2,A,1,11,A),FORMAT=CH                                06470000
  INCLUDE COND=(204,2,CH,EQ,C'WB',OR,204,2,CH,EQ,C'WR')                 06480000
/*                                                                      06490000
//*-------------------------------------------------------------------- 06500000
//* SORT BY FLAT TYPE & SCH-ACC-NUMBER (FROM ERROR FILE)                06510000
//*-------------------------------------------------------------------- 06520000
//STEP60   EXEC SORT,COND=(0,NE)                                        06530000
//SORTIN   DD DSN=&&F690VCH,DISP=(OLD,PASS)                             06540000
//SORTOUT  DD DSN=&&F690VCHA,DISP=(NEW,PASS),                           06550000
//            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=800,BLKSIZE=18400),        06560000
//            SPACE=(CYL,(10,20),RLSE)                                  06570000
//SYSIN    DD  *                                                        06580000
  SORT FIELDS=(162,2,A,1,11,A),FORMAT=CH                                06590000
/*                                                                      06600000
//*-------------------------------------------------------------------- 06610000
//* PRINT REPORT ON COMPENSATION AMOUNTS RECEIVED FROM PAYABLES         06620000
//*       AND RECEIVABLES SYSTEM                                        06630000
//*-------------------------------------------------------------------- 06640000
//STEP61   EXEC PGM=BP13C369,COND=(0,NE)                                06650000
//BP13F690 DD DSN=&&F690VCHA,DISP=(OLD,PASS)                            06660000
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                               06670000
//BP13L369 DD DSN=BP13.L369.BP13C369,DISP=OLD                           06680000
//SYSOUT   DD SYSOUT=*                                                  06690000
//SYSTSPRT DD SYSOUT=*                                                  06700000
//SYSPRINT DD SYSOUT=*                                                  06710000
//SYSDBG   DD SYSOUT=*                                                  06720000
//SYSDBOUT DD SYSOUT=*                                                  06730000
//SYSTSIN  DD *                                                         06740000
//*-----------------------------------------------------------------    06750000
//* REPORT TO MA&B                                                      06760000
//*-----------------------------------------------------------------    06770000
//STEP62   EXEC PGM=IEBGENER,COND=(0,NE)                                06780000
//SYSUT1   DD DSN=BP13.L369.BP13C369,DISP=OLD                           06790000
//SYSUT2   DD SYSOUT=8,DEST=IOM8                                                
//SYSPRINT DD SYSOUT=*                                                  06810000
//SYSIN    DD DUMMY                                                     06820000
/*                                                                      06830000
//*-----------------------------------------------------------------    06840000
//* SORT BY FLAT TYPE & SCH-ACC-NUMBER                                  06850000
//*-----------------------------------------------------------------    06860000
//STEP63   EXEC SORT,COND=(0,NE)                                        06870000
//SORTIN   DD DSN=BP13.F690.AMORTISE.COMPLETE,DISP=SHR                  06880000
//SORTOUT  DD DSN=&&F690CMPL,DISP=(NEW,PASS),                           06890000
//            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=800,BLKSIZE=18400),        06900000
//            SPACE=(CYL,(10,20),RLSE)                                  06910000
//SYSIN    DD  *                                                        06920000
  SORT FIELDS=(162,2,A,1,11,A),FORMAT=CH                                06930000
/*                                                                      06940000
//*-----------------------------------------------------------------    06950000
//* PRINT REPORT ON SURRENDER OF STUDIO APARTMENTS COMPLETIONS          06960000
//*       RECEIVED                                                      06970000
//*-----------------------------------------------------------------    06980000
//STEP64   EXEC PGM=BP13C376,COND=(0,NE)                                06990000
//BP13F690 DD DSN=&&F690CMPL,DISP=(OLD,PASS)                            07000000
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                               07010000
//BP13L376 DD DSN=BP13.L376.BP13C376,DISP=OLD                           07020000
//SYSOUT   DD SYSOUT=*                                                  07030000
//SYSTSPRT DD SYSOUT=*                                                  07040000
//SYSPRINT DD SYSOUT=*                                                  07050000
//SYSDBG   DD SYSOUT=*                                                  07060000
//SYSDBOUT DD SYSOUT=*                                                  07070000
//SYSTSIN  DD *                                                         07080000
//*-----------------------------------------------------------------    07090000
//* SORT ON SCH-ACC                                                     07100000
//*-----------------------------------------------------------------    07110000
//STEP67   EXEC SORT,COND=(0,NE)                                        07120000
//SORTIN   DD DSN=BP13.K690.AMORTISE,DISP=SHR                           07130000
//SORTOUT  DD DSN=&&BP13F690,DISP=(NEW,PASS),                           07140000
//            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=800,BLKSIZE=18400),        07150000
//            SPACE=(CYL,(10,20),RLSE)                                  07160000
//SYSIN    DD  *                                                        07170000
  SORT FIELDS=(1,11,A),FORMAT=CH                                        07180000
/*                                                                      07190000
//*-----------------------------------------------------------------    07200000
//* PRINT REPORT ON DATE PROCESSED NOT SURRENDER                        07210000
//* (2 NRIC SAME WITH DIFFERENT LESSE CODE)                             07220000
//*-----------------------------------------------------------------    07230000
//STEP68   EXEC PGM=BP13C366,COND=(0,NE)                                07240000
//BP13F690 DD DSN=&&BP13F690,DISP=(OLD,PASS)                            07250000
//BP13L366 DD DSN=BP13.L366.BP13C366,DISP=OLD                           07260000
//SYSOUT   DD SYSOUT=*                                                  07270000
//SYSTSPRT DD SYSOUT=*                                                  07280000
//SYSPRINT DD SYSOUT=*                                                  07290000
//SYSDBG   DD SYSOUT=*                                                  07300000
//SYSDBOUT DD SYSOUT=*                                                  07310000
//SYSTSIN  DD *                                                         07320000
//*-----------------------------------------------------------------    07330000
//* REPORT TO MA&B                                                      07340000
//*-----------------------------------------------------------------    07350000
//STEP69   EXEC PGM=IEBGENER,COND=(0,NE)                                07360000
//SYSUT1   DD DSN=BP13.L366.BP13C366,DISP=OLD                           07370000
//SYSUT2   DD SYSOUT=8,DEST=IOM8                                                
//SYSPRINT DD SYSOUT=*                                                  07390000
//SYSIN    DD DUMMY                                                     07400000
/*                                                                      07410000
//*-----------------------------------------------------------------    07420000
//* ACCUM COMPLETED SURRENDER CASE TO HISTORY FILE                      07430000
//*-----------------------------------------------------------------    07440000
//STEP96  EXEC PGM=IDCAMS,COND=(0,NE)                                   07450000
//INPUT1    DD DSN=BP13.F690.AMORTISE.COMPLETE,DISP=SHR                 07460000
//OUTPUT1   DD DSN=BP13.F690.AMORTISE.HISTORY,DISP=MOD                  07470000
//SYSPRINT  DD SYSOUT=*                                                 07480000
//SYSIN     DD *                                                        07490000
  REPRO INFILE(INPUT1) OUTFILE(OUTPUT1)                                 07500000
//*-----------------------------------------------------------------    07510000
//*  BACKUP FILE                                                        07520000
//*-------------------------------------------------------------------* 07530000
//STEP97   EXEC PGM=IDCAMS,COND=(0,NE)                                  07540000
//SYSPRINT DD SYSOUT=*                                                  07550000
//INPUT1   DD DSN=BP13.F690.AMORTISE.NEW,DISP=SHR                       07560000
//OUTPUT1  DD DSN=BP13.F690.AMORTISE.NEW.MTHBKUP(+1),                   07570000
//            DISP=(NEW,CATLG),                                         07580000
//            SPACE=(CYL,(10,5)),                                       07590000
//            DCB=(BP13.GDG,RECFM=FB,LRECL=800,BLKSIZE=18400)           07600000
//*                                                                     07610000
//INPUT2   DD DSN=BP13.F690.AMORTISE.ACCUM,DISP=SHR                     07620000
//OUTPUT2  DD DSN=BP13.F690.AMORTISE.ACCUM.MTHBKUP(+1),                 07630000
//            DISP=(NEW,CATLG),                                         07640000
//            SPACE=(CYL,(25,5)),                                       07650000
//            DCB=(BP13.GDG,RECFM=FB,LRECL=800,BLKSIZE=18400)           07660000
//*                                                                     07670000
//INPUT3   DD DSN=BP13.F120.SATRAN.SURR,DISP=SHR                        07680000
//OUTPUT3  DD DSN=BP13.F120.SATRAN.SURR.MONTH(+1),DISP=(NEW,CATLG),     07690000
//            SPACE=(CYL,(10,3)),                                       07700000
//            DCB=(BP13.GDG,RECFM=FB,LRECL=150,BLKSIZE=27900)           07710000
//*                                                                     07720000
//INPUT4   DD DSN=BP13.F120.SATRAN.AMORT,DISP=SHR                       07730000
//OUTPUT4  DD DSN=BP13.F120.SATRAN.AMORT.MONTH(+1),DISP=(NEW,CATLG),    07740000
//            SPACE=(CYL,(10,3)),                                       07750000
//            DCB=(BP13.GDG,RECFM=FB,LRECL=150,BLKSIZE=27900)           07760000
//*                                                                     07770000
//SYSIN    DD  *                                                        07780000
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                               07790000
   REPRO INFILE(INPUT2)  OUTFILE(OUTPUT2)                               07800000
   REPRO INFILE(INPUT3)  OUTFILE(OUTPUT3)                               07810000
   REPRO INFILE(INPUT4)  OUTFILE(OUTPUT4)                               07820000
//*                                                                     07830000
//*-------------------------------------------------------------------- 07840000
//*  REPRO VSAM FILE TO SEQUENTIAL FILES                                07850000
//*-------------------------------------------------------------------- 07860000
//STEP98 EXEC    PGM=IDCAMS,COND=(0,NE)                                 07870000
//SYSPRINT DD  SYSOUT=*                                                 07880000
//INPUT1   DD  DSN=BP13.K690.AMORTISE,                                  07890000
//             DISP=SHR                                                 07900000
//OUTPUT1  DD  DSN=BP13.F690.AMORTISE.MONTH(+1),                        07910000
//             DISP=(NEW,CATLG),                                        07920000
//             UNIT=CART,                                               07930000
//             LABEL=(1,SL),                                            07940000
//             DCB=(BP13.GDG,BLKSIZE=18400,LRECL=800,RECFM=FB)          07950000
//INPUT2   DD  DSN=BP13.F690.AMORTISE.REQUEST,                          07960000
//             DISP=SHR                                                 07970000
//         DD  DSN=BP13.F690.AMORTISE.VOUCHER,                          07980000
//             DISP=SHR                                                 07990000
//         DD  DSN=BP13.F690.AMORTISE.REMARK,                           08000000
//             DISP=SHR                                                 08010000
//         DD  DSN=BP13.F690.AMORTISE.COMPLETE,                         08020000
//             DISP=SHR                                                 08030000
//         DD  DSN=BP13.F690.AMORTISE.ABORT,                            08040000
//             DISP=SHR                                                 08050000
//OUTPUT2  DD  DSN=BP13.F690.AMORTISE.SURRMTH(+1),                      08060000
//             DISP=(NEW,CATLG),                                        08070000
//             UNIT=CART,                                               08080000
//             LABEL=(2,SL),                                            08090000
//             VOL=REF=*.OUTPUT1,                                       08100000
//             DCB=(BP13.GDG,BLKSIZE=18400,LRECL=800,RECFM=FB)          08110000
//SYSIN    DD  *                                                        08120000
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                             08130000
     REPRO INFILE(INPUT2)  OUTFILE(OUTPUT2)                             08140000
//*---------------------------------------------------------------------08150000
//* EMPTY REQUEST FILE                                                  08160000
//*-------------------------------------------------------------------- 08170000
//STEP99 EXEC    PGM=IDCAMS,COND=(0,NE)                                 08180000
//SYSPRINT DD  SYSOUT=*                                                 08190000
//INPUT1   DD  DUMMY                                                    08200000
//OUTPUT1  DD  DSN=BP13.F690.AMORTISE.ABORT,                            08210000
//             DISP=OLD                                                 08220000
//OUTPUT2  DD  DSN=BP13.F690.AMORTISE.REQUEST,                          08230000
//             DISP=OLD                                                 08240000
//OUTPUT3  DD  DSN=BP13.F690.AMORTISE.VOUCHER,                          08250000
//             DISP=OLD                                                 08260000
//OUTPUT4  DD  DSN=BP13.F690.AMORTISE.COMPLETE,                         08270000
//             DISP=OLD                                                 08280000
//OUTPUT5  DD  DSN=BP13.F690.AMORTISE.REMARK,                           08290000
//             DISP=OLD                                                 08300000
//OUTPUT6  DD  DSN=BP13.F120.SATRAN.SURR,                               08310000
//             DISP=OLD                                                 08320000
//SYSIN    DD  *                                                        08330000
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                             08340000
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT2)                             08350000
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT3)                             08360000
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT4)                             08370000
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT5)                             08380000
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT6)                             08390000
//*                                                                     08400000
