//BP13A23B JOB (BP13P),'BP13A23B',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//             NOTIFY=CSD0071                                                   
/*JOBPARM LINECT=0                                                              
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,                                          
//             DISP=SHR                                                         
//*-----------------------------------------------------------------            
//* CHG-NO   BY    ON    - DESCRIPTION                                          
//* ----------------------------------                                          
//* BP136836 ESA1 160817 - NEW JCL FOR ROF ADJUSTED FLATLIST                    
//* BP139436 MRR5 310123 - STEP FOR BP13C298 CHANGE TO DB2,                     
//*                        ADD DDNAME BM06K100 AND BM06K110                     
//*================================================================== *         
//******************************************************************            
//*  TO SEND DYNAMIC JOB DESCRIPTOR ENTRIES AHEAD OF THE PRINT                  
//*  DATASET, SINGLE COPY                                                       
//*-----------------------------------------------------------------            
//PRT01  EXEC    PGM=IEBGENER,COND=(0,NE)                                       
//SYSUT1   DD  *                                                                
1$DJDE$ BTEXT='DPT=GRPID-EAAL1A CP-1',END;                                      
1$DJDE$ JDE=BP13D,JDL=BP13,END;                                                 
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAAL1A                                     
//SYSUT2   DD  SYSOUT=J,DEST=IOMJ,                                              
//             OUTPUT=(*.FORMID)                                                
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//*-----------------------------------------------------------------            
//* PRINTING OF SELLING PRICE FOR BP13C298                                      
//* COPIES=3, DUPLEX                                                            
//*-----------------------------------------------------------------            
//PRT02  EXEC    PGM=IEBGENER,COND=(0,NE)                                       
//SYSUT1   DD  *                                                                
1$DJDE$ BTEXT='DPT=GRPID-EAAL6H CP-1',END;                                      
1$DJDE$ JDE=13C26E,JDL=BP13,END;                                                
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAAL6H                                     
//SYSUT2   DD  SYSOUT=J,DEST=IOMJ,                                              
//             OUTPUT=(*.FORMID)                                                
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//*-----------------------------------------------------------------            
//* PRINTING OF SELLING PRICE FOR BP13C298                                      
//* COPIES=3, DUPLEX                                                            
//*-----------------------------------------------------------------            
//PRT03  EXEC    PGM=IEBGENER,COND=(0,NE)                                       
//SYSUT1   DD  *                                                                
1$DJDE$ BTEXT='DPT=GRPID-EAAL6I CP-1',END;                                      
1$DJDE$ JDE=13C26E,JDL=BP13,END;                                                
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAAL6I                                     
//SYSUT2   DD  SYSOUT=J,OUTPUT=(*.FORMID),DEST=IOMJ                             
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//*-----------------------------------------------------------------            
//* PRINTING OF SELLING PRICE FOR BP13C298                                      
//* COPIES=3, DUPLEX                                                            
//*-----------------------------------------------------------------            
//PRT04  EXEC    PGM=IEBGENER,COND=(0,NE)                                       
//SYSUT1   DD  *                                                                
1$DJDE$ BTEXT='DPT=GRPID-EAAL3G CP-1',END;                                      
1$DJDE$ JDE=13C26D,JDL=BP13,END;                                                
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAAL3G                                     
//SYSUT2   DD  SYSOUT=J,OUTPUT=(*.FORMID),DEST=IOMJ                             
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//*-----------------------------------------------------------------            
//* PRINTING OF SELLING PRICE FOR BP13C298                                      
//* COPIES=3, DUPLEX                                                            
//*-----------------------------------------------------------------            
//PRT05  EXEC    PGM=IEBGENER,COND=(0,NE)                                       
//SYSUT1   DD  *                                                                
1$DJDE$ BTEXT='DPT=GRPID-EAAL3J CP-1',END;                                      
1$DJDE$ JDE=13C26D,JDL=BP13,END;                                                
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAAL3J                                     
//SYSUT2   DD  SYSOUT=J,OUTPUT=(*.FORMID),DEST=IOMJ                             
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//*-----------------------------------------------------------------            
//PRT06  EXEC    PGM=IEBGENER,COND=(0,NE)                                       
//SYSUT1   DD  *                                                                
1$DJDE$ BTEXT='DPT=GRPID-EAAL3K CP-1',END;                                      
1$DJDE$ JDE=13C26D,JDL=BP13,END;                                                
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAAL3K                                     
//SYSUT2   DD  SYSOUT=J,OUTPUT=(*.FORMID),DEST=IOMJ                             
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//*-----------------------------------------------------------------            
//PRT07  EXEC    PGM=IEBGENER,COND=(0,NE)                                       
//SYSUT1   DD  *                                                                
1$DJDE$ BTEXT='DPT=GRPID-EAAL3L CP-1',END;                                      
1$DJDE$ JDE=13C26D,JDL=BP13,END;                                                
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAAL3L                                     
//SYSUT2   DD  SYSOUT=J,OUTPUT=(*.FORMID),DEST=IOMJ                             
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//*-----------------------------------------------------------------            
//PRT08  EXEC    PGM=IEBGENER,COND=(0,NE)                                       
//SYSUT1   DD  *                                                                
1$DJDE$ BTEXT='DPT=GRPID-EAAL3M CP-1',END;                                      
1$DJDE$ JDE=13C26D,JDL=BP13,END;                                                
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAAL3M                                     
//SYSUT2   DD  SYSOUT=J,OUTPUT=(*.FORMID),DEST=IOMJ                             
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//*-----------------------------------------------------------------            
//* SORT OUT THE CONTROL REC FOR THIS OPTION                                    
//*-----------------------------------------------------------------            
//STEP01 EXEC    SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=BP13.K205.CTLREC,                                            
//             DISP=SHR                                                         
//SORTOUT  DD  DSN=BP13.F205.ADJREC,                                            
//             DISP=OLD                                                         
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,15,A),FORMAT=CH                                               
   INCLUDE COND=(14,2,CH,EQ,C'AD')                                              
/*                                                                              
//*-----------------------------------------------------------------            
//*   PROGRAM TO OUTPUT FILE FOR PRINTING APPENDIX B(BM06F800)                  
//*-----------------------------------------------------------------            
//STEP02 EXEC    PGM=IKJEFT01,COND=(0,NE),                                      
//             REGION=4096K,                                                    
//             DYNAMNBR=20                                                      
//BP13K240 DD  DSN=BP13.K240.HEADFLAT,                                          
//             DISP=SHR,                                                        
//             AMP=('BUFND=8','BUFNI=4')                                        
//BM06K110 DD  DSN=BM06.K110.FLATINV,                                           
//             DISP=SHR,                                                        
//             AMP=('BUFND=8','BUFNI=4')                                        
//BM06K111 DD  DSN=BM06.K110.FLATINV.PATH2,                                     
//             DISP=SHR,                                                        
//             AMP=('BUFND=8','BUFNI=4')                                        
//BM06K100 DD  DSN=BM06.K100.BLOCK,                                             
//             DISP=SHR                                                         
//BP13K813 DD  DSN=BP13.K813.BTOBE,                                             
//             DISP=SHR                                                         
//BP13F205 DD  DSN=BP13.F205.ADJREC,                                            
//             DISP=SHR                                                         
//BM06F800 DD  DSN=&&BM06F800,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=DISK,                                                       
//             SPACE=(CYL,(20,10),RLSE),                                        
//             DCB=(RECFM=FB,LRECL=800,BLKSIZE=0)                               
//SYSOUT   DD  SYSOUT=*                                                         
//SYSTSPRT DD  SYSOUT=*                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSTSIN  DD  *                                                                
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C22O) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
/*                                                                              
//*-----------------------------------------------------------------            
//* TO SORT RECORDS IN ZONE/NT/FLAT-TYPE/ALLOC-DATE SEQUENCE                    
//*-----------------------------------------------------------------            
//STEP03 EXEC    SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=&&BM06F800,                                                  
//             DISP=(SHR,PASS)                                                  
//SORTOUT  DD  DSN=&&BM6F800A,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=DISK,                                                       
//             SPACE=(CYL,(20,10),RLSE),                                        
//             DCB=(RECFM=FB,LRECL=800,BLKSIZE=0)                               
//SYSIN    DD  *                                                                
   SORT FIELDS=(559,2,A,546,3,A,544,2,A,540,2,A,15,4,A,                         
                 19,4,A,23,5,A,503,5,A,501,2,A),FORMAT=CH                       
//*-----------------------------------------------------------------            
//* WRITE LIST OF SELLING PRICE                                                 
//*-----------------------------------------------------------------            
//STEP04 EXEC    PGM=IKJEFT01,COND=(0,NE),                                      
//             REGION=4096K,                                                    
//             DYNAMNBR=20                                                      
//BM06F800 DD  DSN=&&BM6F800A,                                                  
//             DISP=(SHR,PASS)                                                  
//BP13K060 DD  DSN=BP13.K060.CODETAB,                                           
//             DISP=SHR                                                         
//BM06K100 DD  DSN=BM06.K100.BLOCK,                                             
//             DISP=SHR                                                         
//BM06K150 DD  DSN=BM06.K150.FLEXIPR,                                           
//             DISP=SHR                                                         
//BP13K240 DD  DSN=BP13.K240.HEADFLAT,                                          
//             DISP=SHR                                                         
//BP13F205 DD  DSN=BP13.F205.ADJREC,                                            
//             DISP=SHR                                                         
//BP13K260 DD  DSN=BP13.K260.BLOCK.DPP,                                         
//             DISP=SHR                                                         
//BB14K500 DD  DSN=BB14.K500.BLKLEASE,                                          
//             DISP=SHR                                                         
//BB14K580 DD  DSN=BB14.K580.UNTLEASE,                                          
//             DISP=SHR                                                         
//BB14K990 DD  DSN=BB14.K990.REGLEASE,                                          
//             DISP=SHR                                                         
//BM06K110 DD  DSN=BM06.K110.FLATINV,                                           
//             DISP=SHR                                                         
//BM06K111 DD  DSN=BM06.K110.FLATINV.PATH2,                                     
//             DISP=SHR                                                         
//BM06K510 DD  DSN=BM06.K510.ESTCDE,                                            
//             DISP=SHR                                                         
//BP13K277 DD  DSN=BP13.K277.OCSCOST,                                           
//             DISP=SHR                                                         
//BP13F999 DD  DSN=BP13.F999.BP13C224.ADJUST,                                   
//             DISP=SHR                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//SYSTSPRT DD  SYSOUT=*                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSTSIN  DD  *                                                                
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C23O) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
//*                                                                             
// IF (STEP04.RC = 00) THEN                                             00000610
//*-----------------------------------------------------------------            
//* TO SORT RECORDS IN CONTRACTS SEQUENCE                                       
//*-----------------------------------------------------------------            
//STEP6B EXEC    SORT                                                           
//SORTIN   DD  DSN=BP13.F999.BP13C224.ADJUST,                                   
//             DISP=SHR                                                         
//SORTOUT  DD  DSN=&&BP13F999,                                                  
//             DISP=(,PASS),                                                    
//             UNIT=SYSDA,                                                      
//             SPACE=(TRK,(20,10),RLSE),                                        
//             DCB=(RECFM=FB,BLKSIZE=0,LRECL=300)                               
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,3,A,5,1,A,4,1,A,117,3,A,4,2,A,38,5,A,26,1,A,                  
                        45,5,A,43,2,A),FORMAT=CH                                
/*                                                                              
// ENDIF                                                                00002130
// IF (STEP04.RC = 22) THEN                                             00000610
//*-----------------------------------------------------------------            
//* TO SORT RECORDS IN CONTRACTS SEQUENCE                                       
//*-----------------------------------------------------------------            
//STEP6B EXEC    SORT                                                           
//SORTIN   DD  DSN=BP13.F999.BP13C224.ADJUST,                                   
//             DISP=SHR                                                         
//SORTOUT  DD  DSN=&&BP13F999,                                                  
//             DISP=(,PASS),                                                    
//             UNIT=SYSDA,                                                      
//             SPACE=(TRK,(20,10),RLSE),                                        
//             DCB=(RECFM=FB,BLKSIZE=0,LRECL=300)                               
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,3,A,117,3,A,38,5,A,26,1,A,                                    
                        45,5,A,43,2,A),FORMAT=CH                                
/*                                                                              
// ENDIF                                                                00002130
// IF (RC = 00 OR RC = 22 OR RC = 77 OR RC = 99) THEN                   00000610
//*-----------------------------------------------------------------            
//* TO UPDATE CAT1 CAT2 CAT3 IN F999 FILE                                       
//*-----------------------------------------------------------------            
//STEP07 EXEC    PGM=BP13C220                                                   
//BP13F999 DD  DSN=&&BP13F999,                                                  
//             DISP=(OLD,PASS)                                                  
//BP13K230 DD  DSN=BP13.K230.FLATLIST,                                          
//             DISP=SHR                                                         
//BP13K240 DD  DSN=BP13.K240.HEADFLAT,                                          
//             DISP=SHR                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//SYSTSPRT DD  SYSOUT=*                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSTSIN  DD  *                                                                
//*-----------------------------------------------------------------            
//* PRINT LIST OF SELLING PRICE                                                 
//*-----------------------------------------------------------------            
//STEP08 EXEC    PGM=IKJEFT01,                                                  
//             REGION=4096K,                                                    
//             DYNAMNBR=20                                                      
//BP13F205 DD  DSN=BP13.F205.ADJREC,                                            
//             DISP=SHR                                                         
//BP13F999 DD  DSN=&&BP13F999,                                                  
//             DISP=(SHR,PASS)                                                  
//BP13K060 DD  DSN=BP13.K060.CODETAB,                                           
//             DISP=SHR                                                         
//BP13K813 DD  DSN=BP13.K813.BTOBE,                                             
//             DISP=SHR                                                         
//BM06K150 DD  DSN=BM06.K150.FLEXIPR,                                           
//             DISP=SHR                                                         
//BM06K110 DD  DSN=BM06.K110.FLATINV,                                           
//             DISP=SHR                                                         
//BM06K100 DD  DSN=BM06.K100.BLOCK,                                             
//             DISP=SHR                                                         
//BP13L29H DD  SYSOUT=J,DEST=IOMJ,                                              
//             OUTPUT=(*.PRT02.FORMID)                                          
//BP13L29I DD  SYSOUT=J,DEST=IOMJ,                                              
//             OUTPUT=(*.PRT03.FORMID)                                          
//BP13L29G DD  SYSOUT=J,DEST=IOMJ,                                              
//             OUTPUT=(*.PRT04.FORMID)                                          
//BP13L29J DD  SYSOUT=J,DEST=IOMJ,                                              
//             OUTPUT=(*.PRT05.FORMID)                                          
//BP13L29K DD  SYSOUT=J,DEST=IOMJ,                                              
//             OUTPUT=(*.PRT06.FORMID)                                          
//BP13L29L DD  SYSOUT=J,DEST=IOMJ,                                              
//             OUTPUT=(*.PRT07.FORMID)                                          
//BP13L29M DD  SYSOUT=J,DEST=IOMJ,                                              
//             OUTPUT=(*.PRT08.FORMID)                                          
//SYSOUT   DD  SYSOUT=*                                                         
//SYSTSPRT DD  SYSOUT=*                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSTSIN  DD  *                                                                
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C298) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
//*-----------------------------------------------------------------            
//* PRINT LIST OF SELLING PRICE                                                 
//*-----------------------------------------------------------------            
//STEP8A EXEC    PGM=IKJEFT01,                                                  
//             REGION=4096K,                                                    
//             DYNAMNBR=20                                                      
//BP13F205 DD  DSN=BP13.F205.ADJREC,                                            
//             DISP=SHR                                                         
//BP13F999 DD  DSN=&&BP13F999,                                                  
//             DISP=(OLD,DELETE)                                                
//BP13K060 DD  DSN=BP13.K060.CODETAB,                                           
//             DISP=SHR                                                         
//BP13K813 DD  DSN=BP13.K813.BTOBE,                                             
//             DISP=SHR                                                         
//BM06K150 DD  DSN=BM06.K150.FLEXIPR,                                           
//             DISP=SHR                                                         
//BM06K110 DD  DSN=BM06.K110.FLATINV,                                           
//             DISP=SHR                                                         
//BM06K100 DD  DSN=BM06.K100.BLOCK,                                             
//             DISP=SHR                                                         
//BP13L29H DD  SYSOUT=8,DEST=IOM8                                               
//BP13L29I DD  SYSOUT=8,DEST=IOM8                                               
//BP13L29G DD  SYSOUT=8,DEST=IOM8                                               
//BP13L29J DD  SYSOUT=8,DEST=IOM8                                               
//BP13L29K DD  SYSOUT=8,DEST=IOM8                                               
//BP13L29L DD  SYSOUT=8,DEST=IOM8                                               
//BP13L29M DD  SYSOUT=8,DEST=IOM8                                               
//SYSOUT   DD  SYSOUT=*                                                         
//SYSTSPRT DD  SYSOUT=*                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSTSIN  DD  *                                                                
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C298) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
//*---------------------------------------------------------------------        
//* PRINT CAT INFORMATION FOR CHECKING                                          
//*---------------------------------------------------------------------        
//STEP09 EXEC    SAS                                                            
//WORK     DD  UNIT=SYSDA,                                                      
//             SPACE=(CYL,(10,10),,,ROUND)                                      
//BP13K060 DD  DSN=BP13.K060.CODETAB,                                           
//             DISP=SHR                                                         
//BP13F205 DD  DSN=BP13.F205.ADJREC,                                            
//             DISP=SHR                                                         
//BP13F240 DD  DSN=BP13.K240.HEADFLAT,                                          
//             DISP=SHR                                                         
//FT42F001 DD  SYSOUT=J,DEST=IOMJ,                                              
//             OUTPUT=(*.PRT01.FORMID)                                          
//SYSIN    DD  DSN=BP13.BATCH.SRC(BP13S218),                                    
//             DISP=SHR                                                         
//*-----------------------------------------------------------------            
//* ACCUM CONTROL REC                                                           
//*-----------------------------------------------------------------            
//STEP10 EXEC    PGM=IDCAMS                                                     
//SYSPRINT DD  SYSOUT=*                                                         
//INPUT1   DD  DSN=BP13.F205.ADJREC,                                            
//             DISP=SHR                                                         
//OUTPUT1  DD  DSN=BP13.F205.ACCUM,                                             
//             DISP=MOD                                                         
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
/*                                                                              
// ENDIF                                                                        
