//BP13Y701 JOB (BP13P),'RNQ-CD50',MSGCLASS=N,CLASS=I,MSGLEVEL=(1,1),            
//      NOTIFY=CSD0071                                                          
//JOBLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                    
//*-----------------------------------------------------------------            
//* PRINT NOTIFICATION OF TOP LETTER FOR DEVELOPER TO INFORM THEM               
//* ON ESTIMATED TOP DATE                                                       
//* PRINT 2 SET OF LETTERS                                                      
//*-----------------------------------------------------------------            
//*-------------------------------------------------------------------          
//* CHG-NO   BY   DATE     DESCRIPTION                                          
//* -------- ---- -------- -------------------------------------------          
//* BP135171 RJE1 20140211 TO CATER FOR DB2 UPGRADE                             
//*-------------------------------------------------------------------          
//PRT01   EXEC PGM=IEBGENER                                                     
//SYSUT1   DD *                                                                 
$DJDE$ JDE=13POT2,JDL=BP13,FORMS=BP13I8,END;                                    
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAAARS1A                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*-----------------------------------------------------------------            
//PRT02    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
$DJDE$ JDE=BP13D,JDL=BP13,END;                                                  
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAMPPA1A                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*===============================================================              
//* SORT OUT PROJECT DTE-BALLOT/MODE/SCH-ACC-NO                                 
//*---------------------------------------------------------------------        
//STEP01   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//         AMP=('BUFNI=8','BUFND=4')                                            
//SORTOUT  DD DSN=&&BP13F800,DISP=(,PASS),                                      
//        UNIT=SYSDA,DCB=(RECFM=FB,LRECL=2000),                                 
//        SPACE=(CYL,(10,3),RLSE)                                               
//SYSIN    DD  *                                                                
  SORT FIELDS=(155,11,A),FORMAT=CH                                              
  INCLUDE COND=(1,1,CH,NE,C'C',AND,                                             
                155,1,CH,NE,C' ',AND,                                           
                924,3,CH,EQ,C'DBS',AND,                                         
                785,6,CH,EQ,C'200810')                                          
//*-------------------------------------------------------------------*         
//* PRINT TOP LETTER                                                            
//*-------------------------------------------------------------------*         
//STEP22   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K               
//BP13F800  DD DSN=&&BP13F800,DISP=(OLD,PASS)                                   
//SY02F001  DD DSN=SY02.F001.DATE,DISP=SHR                                      
//BP13K820  DD DSN=BP13.K820.OCCUP,DISP=SHR,                                    
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13KB20  DD DSN=BP13.KB20.DBSBK,DISP=SHR,                                    
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13K830  DD DSN=BP13.K830.ADDR,DISP=SHR,                                     
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13K831  DD DSN=BP13.K830.ADDR.PATH1,DISP=SHR,                               
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13PD50  DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                 
//BP13LD50  DD SYSOUT=2,OUTPUT=(*.PRT02.FORMID)                                 
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13CD50) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
/*                                                                              
//*-------------------------------------------------------------------*         
//* PRINT TOP LETTER                                                            
//*-------------------------------------------------------------------*         
//STEP23   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K               
//BP13F800  DD DSN=&&BP13F800,DISP=(OLD,PASS)                                   
//SY02F001  DD DSN=SY02.F001.DATE,DISP=SHR                                      
//BP13K820  DD DSN=BP13.K820.OCCUP,DISP=SHR,                                    
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13KB20  DD DSN=BP13.KB20.DBSBK,DISP=SHR,                                    
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13K830  DD DSN=BP13.K830.ADDR,DISP=SHR,                                     
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13K831  DD DSN=BP13.K830.ADDR.PATH1,DISP=SHR,                               
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13PD50  DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                 
//BP13LD50  DD SYSOUT=2,OUTPUT=(*.PRT02.FORMID)                                 
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13CD50) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
/*                                                                              
