//BP13Y201 JOB (BP13P),'BP13Y201',MSGCLASS=N,CLASS=I,MSGLEVEL=(1,1),            
//       NOTIFY=CSD0071                                                         
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,DISP=SHR                                  
//*================================================================== *         
//* YEARLY JOB RUN ON 01/06                                                     
//* GENERATE DATA TO DOS ON CASES BOOKED PENDING KEY ISSUED                     
//*================================================================== *         
//*--------------------------------------------------------------------         
//* CHG-NO   BY   ON    - CHANGES                                               
//*--------------------------------                                             
//* BP134990 LSB 120813 - NEW JCL FIRST RUN BOOKED CASE BEFORE 1/6/13           
//* BP136902 LSB 020817 - GET TAPE BP13F757                                     
//*--------------------------------------------------------------------         
//* GET BOOKED CASES, BYPASS NPL, AMR, SHS CASES                                
//*--------------------------------------------------------------------         
//STEP01   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F800.APPLN.MONTH(0),DISP=SHR                             
//SORTOUT  DD DSN=&&BP13F800,DISP=(,PASS),                                      
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0),                              
//            SPACE=(CYL,(220,50),RLSE)                                         
//SYSIN    DD  *                                                                
  SORT FIELDS=(4,8,A),FORMAT=CH                                                 
  INCLUDE COND=(1,1,CH,NE,C'C',AND,                                             
                155,11,CH,NE,C'           ',AND,                                
                155,11,CH,NE,C'00000000000',AND,                                
                924,3,CH,NE,C'NPL',AND,                                         
                924,3,CH,NE,C'SMR',AND,                                         
                924,3,CH,NE,C'SHS')                                             
//*---------------------------------------------------------------------        
//* CURRENT BP13K757                                                            
//*---------------------------------------------------------------------        
//STEP02   EXEC SORT,CYL=30,COND=(0,NE)                                         
//SORTIN   DD DSN=BP13.K757.BTO,DISP=SHR                                        
//SORTOUT  DD DSN=&&BP13F757,DISP=(NEW,PASS),                                   
//            UNIT=(SYSDA,3),                                                   
//            DCB=(RECFM=FB,LRECL=3000,BLKSIZE=0),                              
//            SPACE=(CYL,(250,30),RLSE)                                         
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,8,A),FORMAT=CH                                                 
  INCLUDE COND=(2536,3,CH,EQ,C'C  ',OR,                                         
                2536,3,CH,EQ,C'P  ')                                            
//*---------------------------------------------------------------------        
//* BACKUP BP13F757 IN 05/2017                                                  
//*---------------------------------------------------------------------        
//STEP03   EXEC SORT,CYL=30,COND=(0,NE)                                         
//SORTIN   DD DSN=BP13.F757.BTO.DELETE.MAY2017,DISP=SHR                         
//SORTOUT  DD DSN=&&BP13F757,DISP=(MOD,PASS),                                   
//            UNIT=(SYSDA,3),                                                   
//            DCB=(RECFM=FB,LRECL=3000,BLKSIZE=0),                              
//            SPACE=(CYL,(250,30),RLSE)                                         
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,8,A),FORMAT=CH                                                 
  INCLUDE COND=(2536,3,CH,EQ,C'C  ',OR,                                         
                2536,3,CH,EQ,C'P  ')                                            
//*---------------------------------------------------------------------        
//* BACKUP BP13F757 IN 05/2016                                                  
//*---------------------------------------------------------------------        
//STEP3A   EXEC SORT,CYL=30,COND=(0,NE)                                         
//SORTIN   DD DSN=BP13.F757.BTO.DELETE.MAY2016,DISP=SHR                         
//SORTOUT  DD DSN=&&BP13F757,DISP=(MOD,PASS),                                   
//            UNIT=(SYSDA,3),                                                   
//            DCB=(RECFM=FB,LRECL=3000,BLKSIZE=0),                              
//            SPACE=(CYL,(250,30),RLSE)                                         
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,8,A),FORMAT=CH                                                 
  INCLUDE COND=(2536,3,CH,EQ,C'C  ',OR,                                         
                2536,3,CH,EQ,C'P  ')                                            
//*---------------------------------------------------------------------        
//* BACKUP BP13F757 IN 05/2015                                                  
//*---------------------------------------------------------------------        
//STEP3B   EXEC SORT,CYL=30,COND=(0,NE)                                         
//SORTIN   DD DSN=BP13.F757.BTO.DELETE.MAY2015,DISP=SHR                         
//SORTOUT  DD DSN=&&BP13F757,DISP=(MOD,PASS),                                   
//            UNIT=(SYSDA,3),                                                   
//            DCB=(RECFM=FB,LRECL=3000,BLKSIZE=0),                              
//            SPACE=(CYL,(250,30),RLSE)                                         
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,8,A),FORMAT=CH                                                 
  INCLUDE COND=(2536,3,CH,EQ,C'C  ',OR,                                         
                2536,3,CH,EQ,C'P  ')                                            
//*---------------------------------------------------------------------        
//* BACKUP BP13F757 IN 05/2014                                                  
//*---------------------------------------------------------------------        
//STEP3C   EXEC SORT,CYL=30,COND=(0,NE)                                         
//SORTIN   DD DSN=BP13.F757.BTO.DELETE.MAY2014,DISP=SHR                         
//SORTOUT  DD DSN=&&BP13F757,DISP=(MOD,PASS),                                   
//            UNIT=(SYSDA,3),                                                   
//            DCB=(RECFM=FB,LRECL=3000,BLKSIZE=0),                              
//            SPACE=(CYL,(250,30),RLSE)                                         
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,8,A),FORMAT=CH                                                 
  INCLUDE COND=(2536,3,CH,EQ,C'C  ',OR,                                         
                2536,3,CH,EQ,C'P  ')                                            
//*---------------------------------------------------------------------        
//* BACKUP BP13F757 IN 09/2012                                                  
//*---------------------------------------------------------------------        
//STEP04   EXEC SORT,CYL=30,COND=(0,NE)                                         
//SORTIN   DD DSN=BP13.F757.BTO.DELETE.NOV2013,DISP=SHR                         
//SORTOUT  DD DSN=&&BP13F757,DISP=(MOD,PASS),                                   
//            UNIT=(SYSDA,3),                                                   
//            DCB=(RECFM=FB,LRECL=3000,BLKSIZE=0),                              
//            SPACE=(CYL,(250,30),RLSE)                                         
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,8,A),FORMAT=CH                                                 
  INCLUDE COND=(2536,3,CH,EQ,C'C  ',OR,                                         
                2536,3,CH,EQ,C'P  ')                                            
//*---------------------------------------------------------------------        
//* BACKUP BP13F757 IN 03/2012                                                  
//*---------------------------------------------------------------------        
//STEP05   EXEC SORT,CYL=30,COND=(0,NE)                                         
//SORTIN   DD DSN=BP13.F757.BTO.DELETE.NOV2014,DISP=SHR                         
//SORTOUT  DD DSN=&&BP13F757,DISP=(MOD,PASS),                                   
//            UNIT=(SYSDA,3),                                                   
//            DCB=(RECFM=FB,LRECL=3000,BLKSIZE=0),                              
//            SPACE=(CYL,(250,30),RLSE)                                         
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,8,A),FORMAT=CH                                                 
  INCLUDE COND=(2536,3,CH,EQ,C'C  ',OR,                                         
                2536,3,CH,EQ,C'P  ')                                            
//*---------------------------------------------------------------------        
//* BACKUP BP13F757 IN 09/2011                                                  
//*---------------------------------------------------------------------        
//STEP06   EXEC SORT,CYL=30,COND=(0,NE)                                         
//SORTIN   DD DSN=BP13.F757.BTO.DELETE.NOV2015,DISP=SHR                         
//SORTOUT  DD DSN=&&BP13F757,DISP=(MOD,PASS),                                   
//            UNIT=(SYSDA,3),                                                   
//            DCB=(RECFM=FB,LRECL=3000,BLKSIZE=0),                              
//            SPACE=(CYL,(250,30),RLSE)                                         
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,8,A),FORMAT=CH                                                 
  INCLUDE COND=(2536,3,CH,EQ,C'C  ',OR,                                         
                2536,3,CH,EQ,C'P  ')                                            
//*---------------------------------------------------------------------        
//* BACKUP BP13F757 05/2011                                                     
//*---------------------------------------------------------------------        
//STEP07   EXEC SORT,CYL=30,COND=(0,NE)                                         
//SORTIN   DD DSN=BP13.F757.BTO.DELETE.NOV2016,DISP=SHR                         
//SORTOUT  DD DSN=&&BP13F757,DISP=(MOD,PASS),                                   
//            UNIT=(SYSDA,3),                                                   
//            DCB=(RECFM=FB,LRECL=3000,BLKSIZE=0),                              
//            SPACE=(CYL,(250,30),RLSE)                                         
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,8,A),FORMAT=CH                                                 
  INCLUDE COND=(2536,3,CH,EQ,C'C  ',OR,                                         
                2536,3,CH,EQ,C'P  ')                                            
//*---------------------------------------------------------------------        
//* SORT BY REGN BP13F757                                                       
//*---------------------------------------------------------------------        
//STEP08   EXEC SORT,CYL=30,COND=(0,NE)                                         
//SORTIN   DD DSN=&&BP13F757,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F757SORT,DISP=(,PASS),                                      
//            UNIT=(SYSDA,3),                                                   
//            DCB=(RECFM=FB,LRECL=3000,BLKSIZE=0),                              
//            SPACE=(CYL,(250,30),RLSE)                                         
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,8,A),FORMAT=CH                                                 
  SUM FIELDS=NONE                                                               
//*---------------------------------------------------------------------        
//STEP09   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT    DD DSN=&&F757SORT,DISP=(OLD,PASS)                                    
//SYSIN    DD *                                                                 
         DEL (BP13.K757.DOS) CL PURGE                                           
         DEF CL (NAME(BP13.K757.DOS)             -                              
                 CYL(150 50)                       -                            
                 UNIQUE                          -                              
                 SPEED                           -                              
                 STORCLAS(PRODRLS)               -                              
                 LOG(NONE)                       -                              
                 SHR(2 3))                       -                              
                 DATA                            -                              
                 (NAME(BP13.K757.DOS.DATA) -                                    
                 KEYS(8 0)                      -                               
                 RECSZ(3000 3000)                  -                            
                 FSPC(10 10)                     -                              
                 CISZ(4096))                                                    
         IF LASTCC = 0 THEN                      -                              
           REPRO IFILE(INPUT)                    -                              
                 ODS(BP13.K757.DOS)                                             
//*-------------------------------------------------------------------*         
//* GENERATE APPLICATION DATA TO DOS INCLUDE MGPS DATA                          
//* GET MCPS PARENT/CHILD DATA FROM BP13K757                                    
//*-------------------------------------------------------------------*         
//STEP10   EXEC PGM=BP13CC99,COND=(0,NE)                                        
//BP13F800 DD DSN=&&BP13F800,DISP=(OLD,PASS)                                    
//BP13K757 DD DSN=BP13.K757.DOS,DISP=SHR,                                       
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13KB78 DD DSN=BP13.KB78.DBSREQ,DISP=SHR,                                    
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K060 DD DSN=BP13.K060.CODETAB,DISP=SHR,                                   
//            AMP=('BUFND=4','BUFNI=8')                                         
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR,                                   
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13FD99 DD DSN=&&FD99DOS,DISP=(,PASS),                                       
//             DCB=(RECFM=FB,LRECL=1200),                                       
//             SPACE=(CYL,(100,20),RLSE)                                        
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*-------------------------------------------------------------------*         
//*  SORT BY SCH-ACC-NO                                                 00039003
//*-----------------------------------------------------------------    00039003
//STEP11   EXEC SORT,COND=(0,NE)                                        00040003
//SORTIN   DD DSN=&&FD99DOS,DISP=(OLD,PASS)                             00040103
//SORTOUT  DD DSN=&&BP13FD99,DISP=(,PASS),                              00040203
//             UNIT=SYSDA,DCB=(RECFM=FB,LRECL=1200),                    00040303
//             SPACE=(CYL,(120,25),RLSE)                                00040403
//SYSIN    DD *                                                         00040503
  SORT FIELDS=(1,11,A),FORMAT=CH                                        00040603
  INCLUDE COND=(1,9,CH,NE,C'         ',AND,                                     
                1,9,CH,NE,C'000000000')                                         
//*-------------------------------------------------------------------*         
//* GET STREET CODE AND ADDRESS                                                 
//*-------------------------------------------------------------------*         
//STEP12   EXEC PGM=BP13C09A,COND=(0,NE)                                00070005
//BP13FD99 DD DSN=&&BP13FD99,DISP=(OLD,PASS)                            00080003
//AB03F089 DD DSN=AB03.F089.PIDB,DISP=SHR                                       
//BP13FOUT DD DSN=&&FD99DATA,DISP=(,PASS),                              00090002
//             UNIT=SYSDA,DCB=(RECFM=FB,LRECL=1200),                    00040303
//             SPACE=(CYL,(120,25),RLSE)                                00040403
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                  00150000
//SYSDBOUT DD SYSOUT=*                                                  00160000
//SYSOUT   DD SYSOUT=*                                                  00170000
//*-------------------------------------------------------------------*         
//*  SORT HEADER RECORD ON TOP                                          00039003
//*-----------------------------------------------------------------    00039003
//STEP13   EXEC SORT,COND=(0,NE)                                        00040003
//SORTIN   DD DSN=&&FD99DATA,DISP=(OLD,PASS)                            00040103
//SORTOUT  DD DSN=BP13.FD99.DOS,DISP=OLD                                00040203
//SYSIN    DD *                                                         00040503
  SORT FIELDS=(46,17,A,1,11,A),FORMAT=CH                                00040603
  INCLUDE COND=(46,17,CH,EQ,C'                 ')                               
//*-------------------------------------------------------------------*         
//*  SORT DETAIL RECORD BY SCH-ACC-NO                                   00039003
//*-----------------------------------------------------------------    00039003
//STEP14   EXEC SORT,COND=(0,NE)                                        00040003
//SORTIN   DD DSN=&&FD99DATA,DISP=(OLD,PASS)                            00040103
//SORTOUT  DD DSN=BP13.FD99.DOS,DISP=MOD                                00040203
//SYSIN    DD *                                                         00040503
  SORT FIELDS=(1,11,A),FORMAT=CH                                        00040603
  OMIT COND=(46,17,CH,EQ,C'                 ')                                  
