//BP13A50C JOB (BP13P),'BP13A50C',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//       NOTIFY=CSD0071                                                         
//*===================================================================*         
//*                                                                   *         
//* OBJECTIVE : EXTRACT PREVIOUS DAY CASES FOR HHTY CHECK                       
//*                                                                   *         
//*===================================================================*         
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//*===================================================================*         
//* CHGE NO  BY  DATE     DESCRIPTION                                           
//* -------- --- ------  ------------                                           
//* BP130445 LSB 980224   EXPAND F558 TO X(400)                                 
//* BP133893 ZDD 100518   REMOVED BP13K703 ON BP13C059                          
//*===================================================================*         
//* TO SEND DYNAMIC JDE AHEAD OF THE PRINT DATASET                    *         
//* PRT01 : CLASS = 2                                                 *         
//*-------------------------------------------------------------------*         
//PRT01   EXEC PGM=IEBGENER                                                     
//SYSUT1   DD *                                                                 
$DJDE$ JDE=BP13D,JDL=BP13,END;                                                  
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALSS1A                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*                                                                             
//*-------------------------------------------------------------------*         
//* WRITE PREVIOUS DAY CASES                                                    
//* BLANK OFF HH/5-YR CHECK                                                     
//*---------------------------------------------------------------------        
//STEP01   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F500.SEQUENCE,DISP=SHR                                   
//SORTOUT  DD DSN=BP13.F500.SEQUENCE.PREVDAY,DISP=OLD                           
//SYSIN    DD  *                                                                
  SORT FIELDS=(123,8,A),FORMAT=CH                                               
  OUTREC FIELDS=(1,67,C'000',71,45,C' ',117,58,C' ',                            
         176,41,C'000',220,281)                                                 
//*-------------------------------------------------------------------*         
//* SORT BP13K825 REC                                                 *         
//*-------------------------------------------------------------------*         
//STEP02   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K825.REQOCCP,DISP=SHR,                                   
//            AMP=('BUFND=23')                                                  
//SORTOUT  DD DSN=&&F825LESS,DISP=(NEW,PASS),                                   
//            UNIT=(SYSDA,1),                                                   
//            DCB=(LRECL=200,RECFM=FB),                                         
//            SPACE=(CYL,(100,50),RLSE)                                         
//SYSIN    DD *                                                                 
    SORT FIELDS=(1,17,A),FORMAT=CH                                              
    INCLUDE COND=(131,1,CH,EQ,C'Y')                                             
//*-------------------------------------------------------------------*         
//* OUTREC BP13F558 FROM BP13K825 REQUEST OCCUPIER FILE               *         
//* INCLUDE LESSEE-CHECK = 'Y' CASE FROM SOC-OCCUP FILE               *         
//* INCLUDE APPLN1, APPLN2, APPLN3, APPLN4, OCCUPIER TAG AS "Y"       *         
//*-------------------------------------------------------------------*         
//STEP03   EXEC  PGM=BP13C059,COND=(0,NE)                                       
//BP13F500 DD DSN=BP13.F500.SEQUENCE.PREVDAY,DISP=SHR                           
//BP13F825 DD  DSN=&&F825LESS,DISP=(OLD,DELETE)                                 
//BP13F558 DD  DSN=BP13.F558.UPGOCCP.PREVDAY,DISP=OLD                           
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//*                                                                             
//*-------------------------------------------------------------------*         
//*                      END OF JOB                                   *         
//*-------------------------------------------------------------------*         
