//BP13D531 JOB (BP13P),'BP13D531',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//         SCHENV=PKZIP,NOTIFY=CSD0071                                          
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//*==================================================================           
//* 1. THIS JOB WILL RUN AT 9.05AM TO 6.05PM, HOURLY                            
//* 2. BP13D532 WILL ZIP AND FTP THE FILE TO LANSFTPP01 SERVER                  
//* 3. THIS JOB WILL ONLY EXTRACT APPLICATION DATA.                             
//* 4. RUN AFTER BP13D530                                                       
//*==================================================================           
//* CHG REF  BY   ON       DESCRIPTION                                          
//* -------- ---- -------- -----------                                          
//* BP133388 IL5  050708   NEW JCL                                              
//* BP133427 IL5  151008   UPDATE PROJECT CODE (NEW PROJECT)                    
//* BP134109 ZDD  231210   UPDATE PROJECT CODE (NEW PROJECT)                    
//* BP134109 IL5  030311   CHANGE CLASS FROM I TO S                             
//* BP134293 IL5  071011   CATER FOR D09                                        
//* BP134363 IL5  071011   CATER FOR D11                                        
//* BP134470 IL5  200211   CATER FOR D13                                        
//* BP135609 HH17 230615   FTP MIGRATION TO LANSFTPP01                          
//*==================================================================           
//*-------------------------------------------------------------------*         
//* STEP1  :  TO DELETE SEQ. DATASETS                                           
//*-------------------------------------------------------------------*         
//D531S001 EXEC PGM=IDCAMS                                                      
//SYSPRINT DD   SYSOUT=*                                                        
//SYSIN    DD   *                                                               
     DEL ('BP13.FB66.FTPREQ.D13')                                               
     DEL ('BP13.FTP.ZIP.APPL.D13')                                              
     IF MAXCC < 12 THEN                                                         
        SET MAXCC = 0                                                           
/*                                                                              
//*------------------------------------------------------------------           
//D531S010 EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.FB66.FTPREQ.APPL.DBSS,DISP=SHR                           
//SORTOUT  DD DSN=BP13.FB66.FTPREQ.D13,DISP=(NEW,CATLG),                        
//         DCB=(BLKSIZE=0,LRECL=3000,RECFM=FB),                                 
//         SPACE=(CYL,(50,10),RLSE)                                             
//SYSIN    DD *                                                                 
   SORT FIELDS=(5,8,A),FORMAT=CH                                                
   INCLUDE COND=(1,3,CH,EQ,C'D13')                                              
//******************************************************************            
//* TO PREPARE ZIP STATEMENT                                                    
//* STEP 1: RENAME BP13.FB66.FTPREQ.D13 APPLDDDMMHHMM.TXT                       
//* STEP 2: PREPARE THE STATEMENT FOR ZIPPING FILE TO BP13.FTP.ZIP.APPL         
//******************************************************************            
//D531S011 EXEC SAS,COND=(8,LT)                                                 
//BP13FTP2 DD DSN=BP13.SEQ.PUTGET.APPL2,                                        
//            DISP=SHR                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DATA _NULL_;                                                                  
     FILE BP13FTP2;                                                             
     CURRDAY = TODAY();                                                         
     DTE_CURR= PUT(CURRDAY,MMDDYY4.);                                           
     CURRTME = TIME();                                                          
     DTE_TME = PUT(CURRTME,HHMM5.);                                             
     LENGTH HH 4.;                                                              
     HH=SUBSTR(DTE_TME,1,2)||SUBSTR(DTE_TME,4,2);                               
     PRTHH=PUT(HH,Z4.);                                                         
     PUT '-ARCHIVE(BP13.FTP.ZIP.APPL.D13)';                                     
     STDPUT   ="-ZIPPED_DSN(BP13.FB66.FTPREQ.D13";                              
     STDPUT7  =",APPLD"||DTE_CURR||"T"||PRTHH||".TXT)";                         
     STDPUT8  ="BP13.FB66.FTPREQ.D13";                                          
     PUT STDPUT STDPUT7;                                                        
     PUT STDPUT8;                                                               
//*                                                                             
//******************************************************************            
//* TO ZIP TXT FILE                                                             
//******************************************************************            
//D531S012 EXEC PKZIP                                                           
//SYSIN    DD DSN=BP13.SEQ.PUTGET.APPL2,DISP=SHR                                
/*                                                                              
//******************************************************************            
//* TO PREPARE FTP STATEMENT                                                    
//* STEP 1: PREPARE THE FTP STATEMENT FOR FTP                                   
//******************************************************************            
//D531S013 EXEC SAS,COND=(8,LT)                                                 
//BP13FTP1 DD DSN=BP13.SEQ.PUTGET.APPL,                                         
//            DISP=SHR                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DATA _NULL_;                                                                  
     FILE BP13FTP1;                                                             
     CURRDAY = TODAY();                                                         
     DTE_CURR= PUT(CURRDAY,MMDDYY4.);                                           
     CURRTME = TIME();                                                          
     DTE_TME = PUT(CURRTME,HHMM5.);                                             
     LENGTH HH 4.;                                                              
     HH=SUBSTR(DTE_TME,1,2)||SUBSTR(DTE_TME,4,2);                               
     PRTHH=PUT(HH,Z4.);                                                         
     PUT    'CD /PROD/APPN/DATA/BP13/FROM-HDB/DBSS/D13/MF';                     
     PUT    'BINARY';                                                           
     STDPUT   = "PUT 'BP13.FTP.ZIP.APPL.D13' ";                                 
     STDPUT7  = "APPLD"||DTE_CURR||"T"||PRTHH||".ZIP";                          
     STDPUT8  = "QUIT";                                                         
     PUT STDPUT STDPUT7;                                                        
     PUT STDPUT8;                                                               
//*                                                                             
//******************************************************************            
//*  FTP TO LANSFTPP01 SERVER                                                   
//******************************************************************            
//D531S014 EXEC FTP,PARM='LANSFTPP01 (EXIT',COND=(8,LT)                         
//NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                                  
//INPUT    DD DSN=BP13.SEQ.PUTGET.APPL,DISP=SHR                                 
//*                                                                             
