//BP13A600 JOB (BP13P),'BP13A600',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//       NOTIFY=CSD0071                                                         
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//**************************************************************                
//* REPORT RUN BEFORE OR DURING SHORTLISTING                                    
//******************************************************************            
//* CHG REF  BY  ON       DESCRIPTION                                           
//* -------- --- --------------------                                           
//* BP133913 IL5 100602   CEASE PRINTING SYSOUT FOR BP13C713                    
//*                       CHANGE COPIES FROM 2 TO 1                             
//* BP134903 SMR 130423   INCLUDE BP13S569 AND BP13CF85                         
//* BP135392 SMR 140619   CATER FOR 3P FLAT TYPE                                
//* BP135708 SMR 150331   CHANGE CLASS=2 TO CLASS=J                             
//* BP136055 IL5 151217   CATER FOR 2F FLAT TYPE                                
//* BP136107 SMR 160217   ACCEPT PARAMETER FROM JCL IN BP13C525                 
//* BP137052 SMR 251017   BACKUP BP13K010 (BEFORE ADJUSTMENT)                   
//* BP138301 AM2 140520   HARDCOPY REPORTS CONVERSION                           
//* BP138600 IL5 100321   CATER FOR FLAT TYPE 1F                                
//**************************************************************                
//*-----------------------------------------------------------------            
//*  REPRO VSAM FILE TO SEQUENTIAL FILE                                         
//*-----------------------------------------------------------------            
//STEP00   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.K010.TENDER,DISP=SHR                                     
//OUTPUT1  DD DSN=BP13.F010.TENDER.A600,DISP=OLD                                
//SYSIN    DD *                                                                 
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
//*-----------------------------------------------------------------            
//* SORT OUT 4,5,E FLATS TO PRINT FLAT SUPPLY BEFORE PIGEONHOLING               
//*-----------------------------------------------------------------            
//STEP01   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K010.TENDER,DISP=SHR                                     
//SORTOUT  DD DSN=&&P13K010N,DISP=(,PASS),                                      
//            UNIT=(SYSDA,1),SPACE=(CYL,(5,3),RLSE),                            
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=28800)                            
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,5,A),FORMAT=CH                                                
  INCLUDE COND=(4,2,CH,EQ,C'3 ',OR,                                             
       4,2,CH,EQ,C'4 ',OR,                                                      
       4,2,CH,EQ,C'5 ')                                                         
//*-----------------------------------------------------------------            
//* PRINT TENDER PROGRAM SUMMARY REPORT BEFORE PIGEON-HOLING                    
//*-----------------------------------------------------------------            
//STEP02    EXEC PGM=BP13C524,COND=(0,NE)                                       
//SYSPRINT  DD SYSOUT=*                                                         
//BP13F010  DD DSN=&&P13K010N,DISP=(OLD,PASS)                                   
//BP13F713  DD DSN=BP13.F713.PIGEON.MATUREPA,DISP=SHR                           
//BP13L524  DD SYSOUT=8,DEST=IOM8                                               
//SYSDBG    DD SYSOUT=*                                                         
//SYSDBOUT  DD SYSOUT=*                                                         
//SYSOUT    DD SYSOUT=*                                                         
/*                                                                              
//*-----------------------------------------------------------------            
//* SORT OUT 4,5,E FLATS TO PRINT FLAT SUPPLY BEFORE PIGEONHOLING               
//*-----------------------------------------------------------------            
//STEP03   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K010.TENDER,DISP=SHR                                     
//SORTOUT  DD DSN=&&P13K010M,DISP=(,PASS),                                      
//            UNIT=(SYSDA,1),SPACE=(CYL,(5,3),RLSE),                            
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=28800)                            
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,5,A),FORMAT=CH                                                
  INCLUDE COND=(4,2,CH,EQ,C'1 ',OR,                                             
       4,2,CH,EQ,C'2 ',OR,                                                      
       4,2,CH,EQ,C'1A',OR,                                                      
       4,2,CH,EQ,C'1F',OR,                                                      
       4,2,CH,EQ,C'2A',OR,                                                      
       4,2,CH,EQ,C'2F',OR,                                                      
       4,2,CH,EQ,C'E ')                                                         
//*-----------------------------------------------------------------            
//* PRINT TENDER PROGRAM SUMMARY REPORT BEFORE PIGEON-HOLING                    
//*-----------------------------------------------------------------            
//STEP04    EXEC PGM=BP13C524,COND=(0,NE)                                       
//SYSPRINT  DD SYSOUT=*                                                         
//BP13F010  DD DSN=&&P13K010M,DISP=(OLD,PASS)                                   
//BP13F713  DD DSN=BP13.F713.PIGEON.MATUREPA,DISP=SHR                           
//BP13L524  DD SYSOUT=8,DEST=IOM8                                               
//SYSDBG    DD SYSOUT=*                                                         
//SYSDBOUT  DD SYSOUT=*                                                         
//SYSOUT    DD SYSOUT=*                                                         
/*                                                                              
//*-----------------------------------------------------------------            
//* SORT OUT 3P FLATS TO PRINT FLAT SUPPLY BEFORE PIGEONHOLING                  
//*-----------------------------------------------------------------            
//STEP05    EXEC SORT,COND=(0,NE)                                               
//SORTIN    DD DSN=BP13.K010.TENDER,DISP=SHR                                    
//SORTOUT   DD DSN=&&P13K010L,DISP=(,PASS),                                     
//             UNIT=(SYSDA,1),SPACE=(CYL,(5,3),RLSE),                           
//             DCB=(RECFM=FB,LRECL=600,BLKSIZE=28800)                           
//SYSOUT    DD SYSOUT=*                                                         
//SYSIN     DD *                                                                
   SORT FIELDS=(1,5,A),FORMAT=CH                                                
   INCLUDE COND=(4,2,CH,EQ,C'3P')                                               
//*-----------------------------------------------------------------            
//* PRINT TENDER PROGRAM SUMMARY REPORT BEFORE PIGEON-HOLING                    
//*-----------------------------------------------------------------            
//STEP06    EXEC PGM=BP13C524,COND=(0,NE)                                       
//SYSPRINT  DD SYSOUT=*                                                         
//BP13F010  DD DSN=&&P13K010L,DISP=(OLD,DELETE)                                 
//BP13F713  DD DSN=BP13.F713.PIGEON.MATUREPA,DISP=SHR                           
//BP13L524  DD SYSOUT=8,DEST=IOM8                                               
//SYSDBG    DD SYSOUT=*                                                         
//SYSDBOUT  DD SYSOUT=*                                                         
//SYSOUT    DD SYSOUT=*                                                         
//*------------------------------------------------------------------           
//* SORT DAILY APPLICATIONS BY REFERENCE NUMBER                                 
//*------------------------------------------------------------------           
//STEP08   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K740.MATUREBA,DISP=SHR                                   
//SORTOUT  DD DSN=&&F740S8,DISP=(NEW,PASS),                                     
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            SPACE=(CYL,(70,10),RLSE)                                          
//SYSIN    DD *                                                                 
   SORT FIELDS=(187,3,A,211,1,A,123,8,A),FORMAT=CH                              
//*------------------------------------------------------------------           
//* PRINT APPLICATION FORM FOR COUNTER AND MAIL CASES                           
//* 3 DIFFERENT LETTERS DEPENDING ON MCPS OPTION                                
//*------------------------------------------------------------------           
//STEP09   EXEC PGM=BP13C525,COND=(0,NE)                                        
//BP13F730 DD DSN=&&F740S8,DISP=(OLD,PASS)                                      
//P13L525A DD SYSOUT=8,DEST=IOM8                                                
//P13L525B DD SYSOUT=8,DEST=IOM8                                                
//P13L525C DD SYSOUT=8,DEST=IOM8                                                
//SYSIN    DD *                                                                 
AL1                                                                             
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*-----------------------------------------------------------------            
//* PRINT REPORT FOR PPS & NON-PPS APPLICANTS                                   
//*-----------------------------------------------------------------            
//STEP10   EXEC SAS,OPTIONS='MACRO DQUOTE,TEXT82',COND=(0,NE)                   
//WORK     DD UNIT=SYSDA,SPACE=(CYL,(40,10))                                    
//BP13F740 DD DSN=&&F740S8,DISP=(OLD,DELETE)                                    
//BP13L569 DD SYSOUT=8,DEST=IOM8                                                
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S569),DISP=SHR                             
//*-----------------------------------------------------------------            
//* GRO CASES SORTED BY NT, FT, REGNO                                           
//*-----------------------------------------------------------------            
//STEP11   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K740.MATUREBA,DISP=SHR                                   
//SORTOUT  DD DSN=&&F740GRO,DISP=(NEW,PASS),                                    
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            UNIT=SYSDA,SPACE=(CYL,(70,10),RLSE)                               
//SYSIN DD *                                                                    
   SORT FIELDS=(187,3,A,211,2,A,123,8,A),FORMAT=CH                              
   INCLUDE COND=(213,3,CH,EQ,C'GRO')                                            
//*-----------------------------------------------------------------            
//* GENERATE FILE OF DETAILED GRO APPLICATIONS                                  
//*-----------------------------------------------------------------            
//STEP12   EXEC PGM=BP13CF85,COND=(0,NE)                                        
//BP13F740 DD DSN=&&F740GRO,DISP=(OLD,DELETE)                                   
//BP13K825 DD DSN=BP13.K825.REQOCCP,DISP=SHR                                    
//BP13K022 DD DSN=BP13.K022.WISOIC,DISP=SHR                                     
//BP13K021 DD DSN=BP13.K022.WISOIC.PATH1,DISP=SHR                               
//BP13K857 DD DSN=BP13.K857.EMAIL,DISP=SHR                                      
//BP13K740 DD DSN=BP13.K740.MATUREBA,DISP=SHR                                   
//BP13LF85 DD DSN=BP13.LF85.GROAPPLN,DISP=OLD                                   
//SYSDBG   DD SYSOUT=*                                                  00120000
//SYSDBOUT DD SYSOUT=*                                                  00130000
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
