//BP13Q50L JOB (BP13P),'BP13Q50L',MSGCLASS=N,CLASS=I,                           
//       MSGLEVEL=(1,1),SCHENV=PKZIP,NOTIFY=CSD0071                             
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,DISP=SHR                                  
//*=================================================================    00030100
//* CHG-NO   BY  ON     -                                               00030100
//*-----------------------                                              00030100
//* BP138180 LSB 300420 - JOB TO PROVIDE TO PULSE OF HEARTLAND          00030100
//*=================================================================    00030100
//* SORT F762 BY NUM-CHOICE & NUM-FT                                            
//*---------------------------------------------------------------------        
//STEP01   EXEC SORT,CYL=30,COND=(0,NE)                                         
//SORTIN   DD DSN=BP13.K762.BTO.DEMAND,DISP=SHR                                 
//SORTOUT  DD DSN=&&BP13F762,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=200,BLKSIZE=0),                    
//            SPACE=(CYL,(5,1),RLSE)                                            
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,5,A),FORMAT=CH                                                 
//*=================================================================            
//* COMPUTE APPLICATION RATE, DEMAD/SUPPLY ON SALE LAUNCH                       
//*------------------------------------------------------------------           
//STEP02   EXEC PGM=BP13CE20,COND=(0,NE)                                        
//BP13F762 DD DSN=&&BP13F762,DISP=(OLD,DELETE)                                  
//BP13K813 DD DSN=BP13.K813.BTOBE,DISP=SHR,                                     
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13FF02 DD DSN=BP13.FF02.SALES,DISP=OLD                                      
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*-------------------------------------------------------------------*         
//*  BACKUP FILE                                                                
//*-------------------------------------------------------------------*         
//STEP03   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.FF02.SALES,DISP=SHR                                      
//OUTPUT1  DD DSN=BP13.FF02.SALES.BKUP(+1),DISP=(NEW,CATLG),                    
//            SPACE=(CYL,(10,5)),                                               
//            DCB=(BP13.GDG,BLKSIZE=27800,LRECL=200,RECFM=FB)                   
//*                                                                             
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
//*=====================================================================        
//*                                                                             
//* DELETE ZIP FILE BEFORE PROCESSING                                           
//*                                                                             
//*=====================================================================        
//STEP04    EXEC  PGM=IDCAMS,COND=(0,NE)                                        
//SYSPRINT  DD  SYSOUT=*                                                        
//SYSIN     DD *                                                                
     DEL (BP13.FF02.SALES.ZIP)                                                  
     IF MAXCC < 12 THEN                                                         
        SET MAXCC = 0                                                           
/*                                                                              
//*=====================================================================        
//*                                                                             
//*   PKZIP FILE                                                                
//*                                                                             
//*=====================================================================        
//STEP05    EXEC PKZIP,COND=(0,NE)                                              
-ARCHIVE(BP13.FF02.SALES.ZIP)                                                   
-ARCHVOL(DUMMY)                                                                 
-UPDATE                                                                         
-METHOD(FAST)                                                                   
-ZIPPED_DSN(BP13.FF02.SALES,BP13FF02.TXT)                                       
-FILE_TERMINATOR()                                                              
    BP13.FF02.SALES                                                             
/*                                                                              
//*=====================================================================        
//*                                                                             
//*   TRANSMIT COMPRESSED FILE TO SGNETSTAGE SERVER                             
//*   PROD PATH --> /PROD/APPN/DATA/BP13/FROM-HDB/SENTIENT                      
//*   TEST PATH --> /TEST/APPN/DATA/BP13/FROM-HDB/SENTIENT                      
//*                                                                             
//*=====================================================================        
//STEP06   EXEC FTP,PARM='LANSFTPP01 (EXIT',COND=(0,NE)                         
//NETRC    DD DSN=SY08.FTP.NETRC.PD09,DISP=SHR                                  
//INPUT    DD *                                                                 
    CD \PROD\APPN\DATA\PD09\FROM-HDB\SENTIENT                                   
    BINARY                                                                      
    PUT 'BP13.FF02.SALES.ZIP' BP13FF02.TXT.ZIP                                  
    QUIT                                                                        
