//BP13A257 JOB (BP13P),'BP13A257',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//             NOTIFY=CSD0071,TYPRUN=HOLD                                       
/*JOBPARM LINECT=0                                                              
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,                                          
//             DISP=SHR                                                         
//*-----------------------------------------------------------------            
//* CHG-NO   BY   DATE    DESCRIPTION                                           
//* -------- ---- ------ -------------------------------------------            
//* BP132967 LMS  210207 JCL FOR UPDATE SERS SELECTION END DATE.                
//*---------------------------------------------------------------------        
//*      VERIFY FILES BEFORE DAILY PRODUCTION RUN                               
//*--------------------------------------------------------------------         
//STEP00 EXEC    PGM=IDCAMS,COND=(0,NE)                                         
//INPUT1   DD  DSN=BP13.K207.SPREC,                                             
//             DISP=OLD                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  *                                                                
          VFY FILE(INPUT1)                                                      
/*                                                                              
//*-----------------------------------------------------------------            
//*   SORT CONTROL RECORD                                                       
//*-----------------------------------------------------------------            
//STEP01 EXEC    SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=BP13.K207.SPREC,                                             
//             DISP=SHR                                                         
//SORTOUT  DD  DSN=&&BP13F207,                                                  
//             DISP=(,PASS),                                                    
//             UNIT=(SYSDA,1),                                                  
//             SPACE=(TRK,(10,5),RLSE),                                         
//             DCB=(RECFM=FB,LRECL=200,BLKSIZE=0)                               
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,18,A),FORMAT=CH                                               
   INCLUDE COND=(169,8,CH,EQ,C'BP13A257')                                       
/*                                                                              
//*-----------------------------------------------------------------            
//* DELETE THE ACCUMULATED FLAT LIST FILE                                       
//*-----------------------------------------------------------------            
//STEP02 EXEC    PGM=BP13C205,COND=(0,NE)                                       
//BP13F207 DD  DSN=&&BP13F207,                                                  
//             DISP=(SHR,PASS)                                                  
//BM06K110 DD  DSN=BM06.K110.FLATINV,                                           
//             DISP=SHR,                                                        
//             AMP=('BUFND=8','BUFNI=4')                                        
//BM06K111 DD  DSN=BM06.K110.FLATINV.PATH2,                                     
//             DISP=SHR,                                                        
//             AMP=('BUFND=8','BUFNI=4')                                        
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
/*                                                                              
//*-------------------------------------------------------------------- 00000230
//*  DELETE/DEFINE BP13K207                                             00000240
//*-------------------------------------------------------------------- 00000250
//STEP03 EXEC    PGM=IDCAMS,COND=(0,NE),                                00000260
//             REGION=4096K                                             00000270
//SYSPRINT DD  SYSOUT=*                                                 00000280
//INPUT    DD  DSN=BP13.BLANK.CHAR200,                                  00000290
//             DISP=SHR                                                 00000300
//SYSIN    DD  *                                                        00000310
           DEL (BP13.K207.SPREC) CL PURGE                                       
           DEF CLUSTER                                     -            00800000
               (NAME(BP13.K207.SPREC)                      -            00810000
                CYL(4 2)                                   -            00830000
                STORCLAS(PRODRLS)                          -                    
                LOG(NONE)                                  -                    
                UNIQUE                                     -            00840000
                SHR(2 3))                                  -            00850000
               DATA                                        -            00860000
               (NAME(BP13.K207.SPREC.DATA)                 -            00870000
                KEYS(18 0)                                 -            00880000
                RECSZ(200 200)                             -            00890000
                CISZ(4096)                                 -            00900000
                FSPC(10 10))                               -            00910000
               INDEX                                       -            00920000
               (NAME(BP13.K207.SPREC.INDEX)                -            00930000
                CISZ(4096))                                             00940000
           IF MAXCC = 0  THEN                              -            00950000
              REPRO IFILE(INPUT)                           -            00960000
              ODS(BP13.K207.SPREC)                                      00720000
/*                                                                      00000320
//*-----------------------------------------------------------------            
//* END OF BP13A257                                                             
//*-----------------------------------------------------------------            
