//BP13D701  JOB (BP13P),'BP13D701',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),           
//      NOTIFY=CSD0071                                                          
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,DISP=SHR                                  
//*================================================================*            
//*                                                                *            
//*             A P P O I N T M E NT   J O B                       *            
//*                                                                *            
//*================================================================*            
//* CHGE REQ     DATE     BY   DESCRIPTION                         *            
//* --------  ----------  ---  -----------                         *            
//* BP132206  26/11/2002  CLT  INTERNET UPDATE APPT                *            
//* BP133745  18/02/2010  PCL3 ADD BP13K50A TO BP13C615            *            
//* BP134212  31/05/2011  ESD1 CATER TO PROCESS THE NEW BP13K452   *            
//* BP134645  13/09/2012  LSB1 MOVE C614, C615 TO BP13D602 JOB     *            
//* BP136329  18/07/2016  LJL1 CHANGE BLOCK SIZE TO ZERO FOR STEP 1*            
//*                       AND 11.                                  *            
//* BP136430  19/11/2016  KSJ3 CHANGE WORKPLAN LENGTH TO 1000      *            
//* BP136430  14/12/2016  KSJ3 INCLUDE BP13C45D                    *            
//* BP136430  09/01/2017  KSJ3 INCLUDE PGMS FOR SELF BOOKING       *            
//* BP136561  19/01/2017  KSJ3 UPDATE BP13C45G                     *            
//*                            ADD    BP13C45J AND BP13C45K        *            
//* BP136561  20/01/2017  KSJ3 FIX FC20.AUTO BACKUP LENGTH         *            
//* BP136561  25/01/2017  KSJ3 REPL BP13K310 WITH BP13F310 IN C45K *            
//* BP136574  03/02/2017  KSJ3 REMOVE SUM FIELDS IN STEP16         *            
//* BP136561  21/02/2017  KSJ3 FIX COND CODE FOR STEP99            *            
//* BP136797  29/05/2017  KSJ3 ADD BP13K800 TO BP13C45G            *            
//* BP137027  11/10/2017  PCL4 TO ADD BP13C38U                     *            
//* BP137053  10/11/2017  PCL4 TO UPDATE BP13C38U EMAIL FORMAT     *            
//* BP137172  31/01/2018  RJB1 UPDATE BP13C38U INTO DB2 CALLING PGM*            
//* BP137196  20/06/2018  PCL4 TO ADD BP13CF80 (AUTO SOCA - APPT)  *            
//* BP138280  07/04/2020  LJL1 TO TERMINATE JOB FOR BP13CF80       *            
//*                            FOR COVID19 CIRCUIT BREAKER         *            
//* BP138334  03/06/2020  LJL1 TO CATER FOR COVID19 CIRCUIT BREAKER*            
//*                            EXIT                                *            
//* BP138334  28/07/2020  LJL1 TO CATER FOR STEADY STAGE           *            
//*================================================================*            
//*-------------------------------------------------------------------*         
//*  TO SEND DYNAMIC JDE AHEAD OF THE PRINT DATASETS                  *         
//*  PRT01 : CLASS = 2, COPIES = 1 ** (SALES - AGM TEAM)              *         
//*-------------------------------------------------------------------*         
//PRT01    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAALAG1A CP-1',END;                                    
1$DJDE$ JDE=BP13D,JDL=BP13,END;                                                 
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALAG1A                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID),DEST=IOM2                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*--------------------------------------------------------------------         
//*      VERIFY FILES BEFORE DAILY PRODUCTION RUN                               
//*--------------------------------------------------------------------         
//STEP00  EXEC PGM=IDCAMS,COND=(0,NE)                                           
//INPUT1    DD DSN=BP13.K452.WORKPLAN,DISP=OLD                                  
//INPUT2    DD DSN=BP13.K454.APPTABLE,DISP=OLD                                  
//INPUT3    DD DSN=BP13.K800.APPLN,DISP=OLD                                     
//INPUT4    DD DSN=BP13.K680.CPFBAL,DISP=OLD                                    
//INPUT5    DD DSN=BP13.KC60.SELFBLK,DISP=OLD                                   
//INPUT6    DD DSN=BP13.KC70.SELFREGN,DISP=OLD                                  
//INPUT7    DD DSN=BP13.KC20.SELFLIST,DISP=OLD                                  
//INPUT8    DD DSN=BP13.KC30.SELFAPPT,DISP=OLD                                  
//INPUT9    DD DSN=BP13.K310.TRANS,DISP=OLD                                     
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN   DD *                                                                  
          VFY FILE(INPUT1)                                                      
          VFY FILE(INPUT2)                                                      
          VFY FILE(INPUT3)                                                      
          VFY FILE(INPUT4)                                                      
          VFY FILE(INPUT5)                                                      
          VFY FILE(INPUT6)                                                      
          VFY FILE(INPUT7)                                                      
          VFY FILE(INPUT8)                                                      
          VFY FILE(INPUT9)                                                      
//*===================================================================*         
//*                                                                   *         
//* OBJECTIVE : APPT FILE MAINTENANCE                                 *         
//* FREQUENCY : DAILY TO RUN AT 4.30 AM                               *         
//*                                                                   *         
//*===================================================================*         
//*-------------------------------------------------------------------*         
//*  BACKUP APPT FILES BEFORE RUN                                     *         
//*-------------------------------------------------------------------*         
//STEP01   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.K452.WORKPLAN,DISP=SHR,                                  
//            AMP=('BUFND=23')                                                  
//OUTPUT1  DD DSN=BP13.F452.WORKPLAN.BFDAILY(+1),DISP=(NEW,CATLG),              
//            SPACE=(CYL,(2,3)),                                                
//            DCB=(BP13.GDG,BLKSIZE=0,LRECL=1000,RECFM=FB)                      
//*                                                                             
//INPUT2   DD DSN=BP13.K454.APPTABLE,DISP=SHR,                                  
//            AMP=('BUFND=23')                                                  
//OUTPUT2  DD DSN=BP13.F454.APPTABLE.BFDAILY(+1),DISP=(NEW,CATLG),              
//            SPACE=(CYL,(2,3)),                                                
//            DCB=(BP13.GDG,BLKSIZE=23400,LRECL=100,RECFM=FB)                   
//*                                                                             
//INPUT3   DD DSN=BP13.KC20.SELFLIST,DISP=SHR,                                  
//            AMP=('BUFND=23')                                                  
//OUTPUT3  DD DSN=BP13.FC20.SELFLIST.BFDAILY(+1),DISP=(NEW,CATLG),              
//            SPACE=(CYL,(20,10)),                                              
//            DCB=(BP13.GDG,BLKSIZE=0,LRECL=150,RECFM=FB)                       
//*                                                                             
//INPUT4   DD DSN=BP13.KC30.SELFAPPT,DISP=SHR,                                  
//            AMP=('BUFND=23')                                                  
//OUTPUT4  DD DSN=BP13.FC30.SELFAPPT.BFDAILY(+1),DISP=(NEW,CATLG),              
//            SPACE=(CYL,(20,10)),                                              
//            DCB=(BP13.GDG,BLKSIZE=0,LRECL=200,RECFM=FB)                       
//*                                                                             
//INPUT5   DD DSN=BP13.KC20.SELFLIST,DISP=SHR,                                  
//            AMP=('BUFND=23')                                                  
//OUTPUT5  DD DSN=BP13.FC20.SELFLIST.BEFORE.ACCUM,DISP=MOD                      
//*                                                                             
//INPUT6   DD DSN=BP13.KC30.SELFAPPT,DISP=SHR,                                  
//            AMP=('BUFND=23')                                                  
//OUTPUT6  DD DSN=BP13.FC30.SELFAPPT.BEFORE.ACCUM,DISP=MOD                      
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
   REPRO INFILE(INPUT2)  OUTFILE(OUTPUT2)                                       
   REPRO INFILE(INPUT3)  OUTFILE(OUTPUT3)                                       
   REPRO INFILE(INPUT4)  OUTFILE(OUTPUT4)                                       
   REPRO INFILE(INPUT5)  OUTFILE(OUTPUT5)                                       
   REPRO INFILE(INPUT6)  OUTFILE(OUTPUT6)                                       
//*                                                                             
//*-------------------------------------------------------------------*         
//*  BACKUP BP13K458                                                  *         
//*-------------------------------------------------------------------*         
//STEP02   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT10  DD DSN=BP13.K458.TIMESLOT,DISP=SHR,                                  
//            AMP=('BUFND=23')                                                  
//OUTPUT10 DD DSN=BP13.F458.TIMESLOT,DISP=OLD                                   
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT10)  OUTFILE(OUTPUT10)                                     
//*                                                                             
//*-------------------------------------------------------------------*         
//*  BACKUP BP13K460                                                  *         
//*-------------------------------------------------------------------*         
//STEP03   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT11  DD DSN=BP13.K460.APPT.LOG,DISP=SHR,                                  
//            AMP=('BUFND=23')                                                  
//OUTPUT11 DD DSN=BP13.F460.APPT.LOG,DISP=SHR                                   
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT11)  OUTFILE(OUTPUT11)                                     
//*                                                                             
//*-------------------------------------------------------------------*         
//*  SORT BP13K454 BY REGN                                            *         
//*-------------------------------------------------------------------*         
//STEP04 EXEC    SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=BP13.K454.APPTABLE,DISP=SHR                                  
//SORTOUT  DD  DSN=&&P13F454,DISP=(,PASS),                                      
//        UNIT=SYSDA,DCB=(RECFM=FB,LRECL=100),                                  
//        SPACE=(CYL,(20,10),RLSE)                                              
//SYSIN    DD  *                                                                
  SORT FIELDS=(15,8,A),FORMAT=CH                                                
//*                                                                             
//*-------------------------------------------------------------------*         
//*  SYNCHRONISE BP13K800 WITH BP13K454, AS BP13K454 IS 24*7          *         
//*-------------------------------------------------------------------*         
//STEP05    EXEC  PGM=BP13C457,COND=(0,NE)                                      
//BP13F454  DD DSN=&&P13F454,DISP=(OLD,PASS)                                    
//BP13K800  DD DSN=BP13.K800.APPLN,DISP=SHR                                     
//BP13K454  DD DSN=BP13.K454.APPTABLE,DISP=SHR                                  
//BP13L457  DD SYSOUT=*                                                         
//SYSOUT    DD SYSOUT=*                                                         
//SYSDBOUT  DD SYSOUT=*                                                         
//*                                                                             
//*-------------------------------------------------------------------*         
//*   DELETE WORKPLAN WHEN IT IS ALREADY PAST                         *         
//*-------------------------------------------------------------------*         
//STEP06    EXEC PGM=BP13C452,COND=(0,NE)                                       
//BP13K452  DD DSN=BP13.K452.WORKPLAN,DISP=SHR                                  
//BP13K454  DD DSN=BP13.K454.APPTABLE,DISP=SHR                                  
//SYSPRINT  DD SYSOUT=*                                                         
//SYSDBG    DD SYSOUT=*                                                         
//SYSDBOUT  DD SYSOUT=*                                                         
//SYSOUT    DD SYSOUT=*                                                         
//*                                                                             
//*-------------------------------------------------------------------*         
//* SORT OUT REJECTED CASES  IN KIVTRAN FILE                          *         
//* SORT IN NEWTOWN /REQ NO SEQUENCE                                  *         
//*-------------------------------------------------------------------*         
//STEP07   EXEC  SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=BP13.F310.TRANS,DISP=SHR                                     
//SORTOUT  DD  DSN=&&F310REJ,DISP=(NEW,PASS),                                   
//             UNIT=SYSDA,                                                      
//             SPACE=(TRK,(10,5),RLSE),                                         
//             DCB=(RECFM=FB,LRECL=150,BLKSIZE=23400)                           
//SYSIN    DD  *                                                                
      SORT FIELDS=(61,3,A,1,8,A),FORMAT=CH,SIZE=E200000                         
      INCLUDE COND=(9,2,CH,EQ,C'RI',OR,                                         
                    9,2,CH,EQ,C'RS',OR,                                         
                    9,2,CH,EQ,C'RW',OR,                                         
                    9,2,CH,EQ,C'RA',OR,                                         
                    9,2,CH,EQ,C'RK',OR,                                         
                    9,2,CH,EQ,C'RL',OR,                                         
                    9,2,CH,EQ,C'RM')                                            
//*-------------------------------------------------------------------*         
//*   DELETE APPT OF CANCELLED 'SA' APPT CASES                        *         
//*   THESE ARE BOOKED FLAT CASES WHICH SUBSEQUENTLY CANCEL           *         
//*-------------------------------------------------------------------*         
//STEP08   EXEC  PGM=BP13C456,COND=(0,NE)                                       
//BP13K800 DD  DSN=BP13.K800.APPLN,DISP=SHR,                                    
//             AMP=('BUFND=4','BUFNI=8')                                        
//BP13K452 DD  DSN=BP13.K452.WORKPLAN,DISP=SHR                                  
//P13K454  DD  DSN=BP13.K454.APPTABLE,DISP=SHR                                  
//P13K4541 DD  DSN=BP13.K454.APPTABLE.PATH1,DISP=SHR                            
//BP13F310 DD  DSN=&&F310REJ,DISP=(OLD,PASS)                                    
//SYSPRINT DD  SYSOUT=*                                                         
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
/*                                                                              
//*===================================================================*         
//*                                                                             
//*   S E L F   B O O K I N G   P R O C E S S I N G                             
//*                                                                             
//*===================================================================*         
//*--------------------------------------------------------------------         
//*   SORT BP13KC60 FOR THOSE BLOCKS REQUESTED FOR EXTRACTION                   
//*--------------------------------------------------------------------         
//STEP09   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.KC60.SELFBLK,DISP=SHR                                    
//SORTOUT  DD DSN=&&BP13FC60,DISP=(NEW,PASS),                                   
//            DCB=(RECFM=FB,LRECL=150,BLKSIZE=0),                               
//            SPACE=(CYL,(5,1),RLSE)                                            
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,16,A),FORMAT=CH                                               
   INCLUDE COND=((17,8,CH,NE,C'        ',AND,17,8,CH,NE,C'00000000'),           
             AND,(33,8,CH,EQ,C'        ',OR,33,8,CH,EQ,C'00000000'))            
//*                                                                             
//*--------------------------------------------------------------------         
//*   POPULATE REGNS INTO BP13KC70                                              
//*--------------------------------------------------------------------         
//STEP10   EXEC PGM=BP13C45D,COND=(0,NE)                                        
//BP13FC60 DD DSN=&&BP13FC60,DISP=(OLD,DELETE)                                  
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR                                    
//BM06K111 DD DSN=BM06.K110.FLATINV.PATH2,DISP=SHR                              
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR                                      
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR                                      
//BP13KC20 DD DSN=BP13.KC20.SELFLIST,DISP=SHR                                   
//BP13KC21 DD DSN=BP13.KC20.SELFLIST.PATH1,DISP=SHR                             
//BP13KC25 DD DSN=BP13.KC25.SELFLIST.QUEUE,DISP=SHR                             
//BP13KC22 DD DSN=BP13.KC25.SELFLIST.QUEUE.PATH1,DISP=SHR                       
//BP13K454 DD DSN=BP13.K454.APPTABLE,DISP=SHR                                   
//BP13K451 DD DSN=BP13.K454.APPTABLE.PATH1,DISP=SHR                             
//BP13K460 DD DSN=BP13.K460.APPT.LOG,DISP=SHR                                   
//BP13KC60 DD DSN=BP13.KC60.SELFBLK,DISP=OLD                                    
//BP13KC70 DD DSN=BP13.KC70.SELFREGN,DISP=OLD                                   
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*--------------------------------------------------------------------         
//*   SORT SELF BOOK LIST                                                       
//*--------------------------------------------------------------------         
//STEP11   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.KC20.SELFLIST,DISP=SHR                                   
//SORTOUT  DD DSN=&&BP13FC20,DISP=(NEW,PASS),                                   
//            DCB=(RECFM=FB,LRECL=150,BLKSIZE=0),                               
//            SPACE=(CYL,(20,10),RLSE)                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,22,A,31,8,A),FORMAT=CH                                        
//*                                                                             
//*--------------------------------------------------------------------         
//*   EXTRACT RECORDS WITH BOOKING WINDOW PERIOD ENDED PREVIOUS DAY             
//*   REQUIRED ON 18 JUN 2020                                                   
//*   BLANK RECORD FC20                                                         
//*BP13FC20 DD DSN=BP13.BLANK.CHAR150,DISP=SHR                                  
//*--------------------------------------------------------------------         
//STEP12   EXEC PGM=BP13C45F,COND=(0,NE)                                        
//BP13FC20 DD DSN=&&BP13FC20,DISP=(OLD,DELETE)                                  
//BP13FC2A DD DSN=&&BP13FC2A,DISP=(NEW,PASS),                                   
//            DCB=(RECFM=FB,LRECL=150,BLKSIZE=0),                               
//            SPACE=(CYL,(20,10),RLSE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*--------------------------------------------------------------------         
//* PROCESS BATCH CLOSING                                                       
//* (1) AUTO ASSIGN APPTS TO VALID REGNS W/O APPT (NEED USER APPROVAL)          
//* (2) CONSOLIDATE UNUSED SELF BOOKING TIME SLOTS                              
//* (3) GENERATE REPORT ON OPT-OUT CASES WITH NO MANUAL BOOKING                 
//*--------------------------------------------------------------------         
//STEP13   EXEC PGM=BP13C45G,COND=(0,NE)                                        
//BP13FC20 DD DSN=&&BP13FC2A,DISP=(OLD,DELETE)                                  
//BP13KC30 DD DSN=BP13.KC30.SELFAPPT,DISP=SHR                                   
//BP13KC31 DD DSN=BP13.KC30.SELFAPPT.PATH2,DISP=SHR                             
//BP13K452 DD DSN=BP13.K452.WORKPLAN,DISP=SHR                                   
//BP13K454 DD DSN=BP13.K454.APPTABLE,DISP=SHR                                   
//BP13K451 DD DSN=BP13.K454.APPTABLE.PATH1,DISP=SHR                             
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=OLD                                      
//BP13KC20 DD DSN=BP13.KC20.SELFLIST,DISP=OLD                                   
//BP13KC21 DD DSN=BP13.KC20.SELFLIST.PATH1,DISP=OLD                             
//BP13FC30 DD DSN=BP13.FC30.SELFAPPT,DISP=OLD                                   
//BP13FC2A DD DSN=BP13.FC20.SELFLIST.AUTO,DISP=OLD                              
//P13L45GA DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//P13L45GB DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//P13L45GC DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//P13L45GD DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*--------------------------------------------------------------------         
//*   SORT SELF BOOK TIME SLOTS AND APPOINTMENTS                                
//*--------------------------------------------------------------------         
//STEP14   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.KC30.SELFAPPT,DISP=SHR                                   
//SORTOUT  DD DSN=&&BP13FC30,DISP=(NEW,PASS),                                   
//            DCB=(RECFM=FB,LRECL=200,BLKSIZE=0),                               
//            SPACE=(CYL,(20,10),RLSE)                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,28,A),FORMAT=CH                                               
//*                                                                             
//*--------------------------------------------------------------------         
//*   EXTRACT RECORDS WITH BOOKING WINDOW PERIOD ENDED PREVIOUS DAY             
//*   REQUIRED ON 18 JUN 2020                                                   
//*   BLANK RECORD FC30                                                         
//*BP13FC30 DD DSN=BP13.BLANK.CHAR200,DISP=SHR                                  
//*--------------------------------------------------------------------         
//STEP15   EXEC PGM=BP13C45H,COND=(0,NE)                                        
//BP13FC30 DD DSN=&&BP13FC30,DISP=(OLD,DELETE)                                  
//BP13KC20 DD DSN=BP13.KC20.SELFLIST,DISP=SHR                                   
//BP13FC3A DD DSN=BP13.FC30.SELFAPPT,DISP=MOD                                   
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*--------------------------------------------------------------------         
//*   SORT SELF BOOK TIME SLOTS BY APPT TYPE + APPT DATE + APPT TIME            
//*--------------------------------------------------------------------         
//STEP16   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.FC30.SELFAPPT,DISP=SHR                                   
//SORTOUT  DD DSN=BP13.FC30.SELFAPPT.SWITCH,DISP=OLD                            
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
   SORT FIELDS=(11,16,A,47,2,A),FORMAT=CH                                       
//*                                                                             
//*--------------------------------------------------------------------         
//* SWITCH COUNTERS FOR UNUSED SELF BOOK SLOTS TO MANUAL AND                    
//* DELETE FROM BP13KC30                                                        
//* COVID19 CB EXIT                                                             
//*BP13FC30 DD DSN=BP13.BLANK.CHAR200,DISP=SHR                                  
//*--------------------------------------------------------------------         
//STEP17   EXEC PGM=BP13C45I,COND=(0,NE)                                        
//BP13FC30 DD DSN=BP13.FC30.SELFAPPT.SWITCH,DISP=SHR                            
//BP13K452 DD DSN=BP13.K452.WORKPLAN,DISP=OLD                                   
//BP13KC30 DD DSN=BP13.KC30.SELFAPPT,DISP=OLD                                   
//BP13L45I DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*--------------------------------------------------------------------         
//* AUTO BOOK CASES UPDATED FROM BP13C45G                                       
//*--------------------------------------------------------------------         
//STEP18   EXEC PGM=IKJEFT01,COND=(0,NE),REGION=4096K,                          
//            DYNAMNBR=20                                                       
//BP13FC20 DD DSN=BP13.FC20.SELFLIST.AUTO,DISP=SHR                              
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR                                    
//BM06K111 DD DSN=BM06.K110.FLATINV.PATH1,DISP=SHR                              
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR                                      
//BP13K857 DD DSN=BP13.K857.EMAIL,DISP=SHR                                      
//BP13K435 DD DSN=BP13.K435.KEY.BORROW,DISP=SHR                                 
//BP13K452 DD DSN=BP13.K452.WORKPLAN,DISP=OLD                                   
//BP13K454 DD DSN=BP13.K454.APPTABLE,DISP=OLD                                   
//BP13K451 DD DSN=BP13.K454.APPTABLE.PATH1,DISP=OLD                             
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=OLD                                      
//BP13K310 DD DSN=BP13.K310.TRANS,DISP=OLD                                      
//BP13KC30 DD DSN=BP13.KC30.SELFAPPT,DISP=OLD                                   
//BP13KC31 DD DSN=BP13.KC30.SELFAPPT.PATH2,DISP=OLD                             
//BP13F203 DD DSN=BP13.F203.SMS.SBK.AUTO,DISP=OLD                               
//BP13F23B DD DSN=BP13.F23B.EMAIL.SBK.AUTO,DISP=OLD                             
//BP13L45J DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSIN  DD  *                                                                
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C45J) PLAN(BP13PCC) -                                         
      LIB    ('BP13.BATCH.LOADCOB')                                             
  END                                                                           
/*                                                                              
//*--------------------------------------------------------------------         
//* SORT OUT TP RECS FROM TRANS FILE                                            
//*--------------------------------------------------------------------         
//STEP19   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F310.TRANS,DISP=SHR                                      
//SORTOUT  DD DSN=&&BP13F310,DISP=(NEW,PASS),                                   
//          DCB=(RECFM=FB,LRECL=150,BLKSIZE=0),                                 
//          SPACE=(CYL,(5,1),RLSE)                                              
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
   SORT FIELDS=(30,8,A,1,16,A),FORMAT=CH                                        
   INCLUDE COND=(9,2,CH,EQ,C'TP')                                               
//*                                                                             
//*--------------------------------------------------------------------         
//* RUN REPORT ON SELF BOOKING CASES BOOKED FOR THE DAY                         
//*--------------------------------------------------------------------         
//STEP20   EXEC PGM=IKJEFT01,COND=(0,NE),REGION=4096K,                          
//            DYNAMNBR=20                                                       
//BP13F310 DD DSN=&&BP13F310,DISP=(OLD,DELETE)                                  
//BP13KC20 DD DSN=BP13.KC20.SELFLIST,DISP=SHR                                   
//BP13KC21 DD DSN=BP13.KC20.SELFLIST.PATH1,DISP=SHR                             
//BP13K454 DD DSN=BP13.K454.APPTABLE,DISP=SHR                                   
//BP13K451 DD DSN=BP13.K454.APPTABLE.PATH1,DISP=SHR                             
//BP13MAIL DD DSN=BP13.MAILRPT.BP13L45K,DISP=OLD                                
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSIN  DD  *                                                                
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C45K) PLAN(BP13PCC) -                                         
      LIB    ('BP13.BATCH.LOADCOB')                                             
  END                                                                           
//*---------------------------------------------------------------------        
//* SORT BP13K454                                                               
//*---------------------------------------------------------------------        
//STEP21   EXEC SORT,COND=(4,LT)                                                
//SORTIN   DD DSN=BP13.K454.APPTABLE,DISP=SHR                                   
//SORTOUT  DD DSN=&&BP13F454,DISP=(NEW,PASS),                                   
//         UNIT=SYSDA,SPACE=(CYL,(5,5),RLSE),                                   
//         DCB=(RECFM=FB,LRECL=100)                                             
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,22,A),FORMAT=CH                                               
   INCLUDE COND=(1,8,CH,NE,C'        ',AND,                                     
                 1,8,CH,NE,C'00000000')                                         
//*--------------------------------------------------------------------         
//* BP13C38U - APPOINTMENT DETAILS SOCA, SATP & TP CASES                        
//*--------------------------------------------------------------------         
//STEP22   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(4,LT),REGION=4096K               
//BP13F454 DD  DSN=&&BP13F454,DISP=(OLD,PASS)                                   
//BP13K800 DD  DSN=BP13.K800.APPLN,DISP=SHR                                     
//BP13K022 DD  DSN=BP13.K022.WISOIC,DISP=SHR                                    
//BP13K021 DD  DSN=BP13.K022.WISOIC.PATH1,DISP=SHR                              
//BP13L38U DD  DSN=BP13.L38U.BP13C38U,DISP=SHR                                  
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C38U) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
//*****************************************************************             
//*         AUTO-GENERATE MAIL HEADER PART I                                    
//*         HELO SGPHDBX                                                        
//*         MAIL FROM:<XXXXXXXX@SGPHDBX>                                        
//*****************************************************************             
//STEP22A  EXEC PGM=IRXJCL,PARM='SMTPHDR'                                       
//SYSTSPRT DD  SYSOUT=*                                                         
//SYSEXEC  DD  DSN=SYS3.SYSTEM.CLIST,DISP=SHR                                   
//SMTPHDR  DD DSN=&&P13MHDG,DISP=(NEW,PASS),                                    
//         SPACE=(TRK,(1,1)),DCB=(DSORG=PS,LRECL=205,RECFM=VB)                  
//SYSTSIN  DD  DUMMY                                                            
//*                                                                             
//*---------------------------------------------------------------------        
//STEP22B  EXEC SAS,COND=(0,NE),OPTIONS='MACRO'                                 
//SYSOUT   DD SYSOUT=*                                                          
//MAILNAME DD DSN=&&MAILNAME,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(2,1),RLSE),                                
//            DCB=(RECFM=VB,LRECL=205)                                          
//MAILRCPT DD DSN=&&MAILRCPT,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(2,1),RLSE),                                
//            DCB=(RECFM=VB,LRECL=205)                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DATA _NULL_;                                                                  
    FILE MAILNAME;                                                              
    PUT @01 '           FILENAME="BP13L38U.TXT"';                               
    PUT @01 ' ';                                                                
  RUN;                                                                          
//         DD DSN=BP13.MAIL.BP13C38U,DISP=SHR                                   
//         DD *                                                                 
    PUT @01 'SUBJECT : APPOINTMENT DETAILS FOR SOCA, SATP AND TP    ';          
//*---------------------------------------------------------------------        
//STEP22C  EXEC PGM=IEBGENER,COND=(0,NE)                                        
//SYSUT1   DD DSN=*.STEP22A.SMTPHDR,DISP=(OLD,DELETE)                           
//         DD DSN=&&MAILRCPT,DISP=(OLD,DELETE)                                  
//         DD DSN=AV05.MIME.HEADERS.VB(MIMEHDR),DISP=SHR                        
//         DD DSN=AV05.MIME.HEADERS.VB(MPHDR),DISP=SHR                          
//         DD DSN=AV05.MIME.HEADERS.VB(BOUNDARY),DISP=SHR                       
//         DD DSN=AV05.MIME.HEADERS.VB(TEXTHDR),DISP=SHR                        
//         DD DSN=AV05.MIME.HEADERS.VB(ATCHHDR),DISP=SHR                        
//         DD DSN=&&MAILNAME,DISP=(OLD,DELETE)                                  
//         DD *                                                                 
//         DD DSN=BP13.L38U.BP13C38U,DISP=SHR                                   
//         DD DSN=AV05.MIME.HEADERS.VB(BOUNDARY),DISP=SHR                       
//SYSUT2   DD DSN=BP13.MAILRPT.BP13C38U,DISP=OLD                                
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*                                                                             
//*-------------------------------------------------------------------*         
//*  SEND MAINFRAME EMAIL                                             *         
//*  APPOINTMENT DETAILS ON SOCA, SATP AND TP                         *         
//*-------------------------------------------------------------------*         
//*-------------------------------------------------------------------*         
//STEP22D  EXEC SENDMAIL,COND=(4,LT)                                            
//INPUT    DD DSN=BP13.MAILRPT.BP13C38U,DISP=SHR                                
//*-------------------------------------------------------------------*         
//*---------------------------------------------------------------------        
//* SORT OUT CASES FOR SCHEDULING BATCH SCHEDULING OF SOCA APPT                 
//* SORT OUT BLANK REC FOR COVID19 AS AUTO SOCA IS STILL PENDING                
//*SORTIN   DD  DSN=BP13.F800.APPLN.LZ37A,DISP=SHR                              
//*---------------------------------------------------------------------        
//STEP23   EXEC  SORT                                                           
//SORTIN   DD  DSN=BP13.BLANK.CHAR2000,DISP=SHR                                 
//SORTOUT  DD DSN=&&BP13F800,DISP=(NEW,PASS),                                   
//             SPACE=(CYL,(50,100),RLSE),                                       
//             DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                              
//SYSIN    DD  *                                                                
     SORT FIELDS=(4,8,A),FORMAT=CH                                              
     INCLUDE COND=(924,3,CH,EQ,C'EAT')                                          
//*---------------------------------------------------------------------        
//* GENERATE SCHEDULE (21 DAYS)                                                 
//*--------------------------------------------------------------------         
//STEP24  EXEC   PGM=BP13CF80,COND=(0,NE)                                       
//BP13F800 DD  DSN=&&BP13F800,DISP=(OLD,DELETE)                                 
//BP13K452 DD  DSN=BP13.K452.WORKPLAN,DISP=SHR                                  
//BP13K454 DD  DSN=BP13.K454.APPTABLE,DISP=SHR                                  
//BP13K451 DD  DSN=BP13.K454.APPTABLE.PATH1,DISP=SHR                            
//BM06K110 DD  DSN=BM06.K110.FLATINV,DISP=SHR                                   
//BP27K800 DD  DSN=BP27.K800.HLAPPLN,DISP=SHR                                   
//BP13K022 DD  DSN=BP13.K022.WISOIC,DISP=SHR                                    
//BP13K021 DD  DSN=BP13.K022.WISOIC.PATH1,DISP=SHR                              
//BM06K100 DD  DSN=BM06.K100.BLOCK,DISP=SHR                                     
//BP13LF80 DD  DSN=BP13.LF80.BP13CF80.AUTO,DISP=SHR                             
//SYSOUT   DD  SYSOUT=*                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//*===================================================================*         
//*-------------------------------------------------------------------*         
//*  SEND MAINFRAME EMAIL (BP13C45K)                                            
//*-----------------------------------------------------------------            
//STEP25A  EXEC SENDMAIL,COND=(4,LT)                                            
//INPUT    DD DSN=BP13.MAILRPT.BP13L45K,DISP=SHR                                
//*                                                                             
//*-------------------------------------------------------------------*         
//*  BACKUP APPT FILES AFTER RUN                                      *         
//*-------------------------------------------------------------------*         
//STEP98   EXEC PGM=IDCAMS                                                      
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.K452.WORKPLAN,DISP=SHR,                                  
//            AMP=('BUFND=23')                                                  
//OUTPUT1  DD DSN=BP13.F452.WORKPLAN.AFDAILY(+1),DISP=(NEW,CATLG),              
//            SPACE=(CYL,(2,3)),                                                
//            DCB=(BP13.GDG,BLKSIZE=0,LRECL=1000,RECFM=FB)                      
//*                                                                             
//INPUT2   DD DSN=BP13.K454.APPTABLE,DISP=SHR,                                  
//            AMP=('BUFND=23')                                                  
//OUTPUT2  DD DSN=BP13.F454.APPTABLE.AFDAILY(+1),DISP=(NEW,CATLG),              
//            SPACE=(CYL,(2,3)),                                                
//            DCB=(BP13.GDG,BLKSIZE=23400,LRECL=100,RECFM=FB)                   
//*                                                                             
//INPUT3   DD DSN=BP13.KC20.SELFLIST,DISP=SHR,                                  
//            AMP=('BUFND=23')                                                  
//OUTPUT3  DD DSN=BP13.FC20.SELFLIST.AFDAILY(+1),DISP=(NEW,CATLG),              
//            SPACE=(CYL,(20,10)),                                              
//            DCB=(BP13.GDG,BLKSIZE=0,LRECL=150,RECFM=FB)                       
//*                                                                             
//INPUT4   DD DSN=BP13.KC30.SELFAPPT,DISP=SHR,                                  
//            AMP=('BUFND=23')                                                  
//OUTPUT4  DD DSN=BP13.FC30.SELFAPPT.AFDAILY(+1),DISP=(NEW,CATLG),              
//            SPACE=(CYL,(20,10)),                                              
//            DCB=(BP13.GDG,BLKSIZE=0,LRECL=200,RECFM=FB)                       
//*                                                                             
//INPUT5   DD DSN=BP13.KC20.SELFLIST,DISP=SHR,                                  
//            AMP=('BUFND=23')                                                  
//OUTPUT5  DD DSN=BP13.FC20.SELFLIST.AFTER.ACCUM,DISP=MOD                       
//*                                                                             
//INPUT6   DD DSN=BP13.KC30.SELFAPPT,DISP=SHR,                                  
//            AMP=('BUFND=23')                                                  
//OUTPUT6  DD DSN=BP13.FC30.SELFAPPT.AFTER.ACCUM,DISP=MOD                       
//*                                                                             
//INPUT7   DD DSN=BP13.FC20.SELFLIST.AUTO,DISP=SHR                              
//OUTPUT7  DD DSN=BP13.FC20.SELFLIST.AUTO.DAILY(+1),DISP=(NEW,CATLG),           
//            SPACE=(CYL,(5,2)),                                                
//            DCB=(BP13.GDG,BLKSIZE=0,LRECL=150,RECFM=FB)                       
//*                                                                             
//INPUT8   DD DSN=BP13.FC20.SELFLIST.AUTO,DISP=SHR                              
//OUTPUT8  DD DSN=BP13.FC20.SELFLIST.AUTO.ACCUM,DISP=MOD                        
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
   REPRO INFILE(INPUT2)  OUTFILE(OUTPUT2)                                       
   REPRO INFILE(INPUT3)  OUTFILE(OUTPUT3)                                       
   REPRO INFILE(INPUT4)  OUTFILE(OUTPUT4)                                       
   REPRO INFILE(INPUT5)  OUTFILE(OUTPUT5)                                       
   REPRO INFILE(INPUT6)  OUTFILE(OUTPUT6)                                       
   REPRO INFILE(INPUT7)  OUTFILE(OUTPUT7)                                       
   REPRO INFILE(INPUT8)  OUTFILE(OUTPUT8)                                       
//*                                                                             
//*-------------------------------------------------------------------*         
//* SEND MESSAGE TO OPERATOR TO OPEN FILES                            *         
//*-------------------------------------------------------------------*         
//STEP99   EXEC WTOG,COND=(0,NE)                                                
   ----> ############################################                           
   ---->    AFTER SUCCESSFUL COMPLETION OF                                      
   ---->          BP13D701 JOBS                                                 
   ---->    PLEASE GROUP OPEN BP13G                                             
   ---->    EXCEPT MTH END OPEN AFTER BP13M403                                  
   ----> ############################################                           
//*-----------------------------------------------------------------            
//*            END OF JOB                                          *            
//*-----------------------------------------------------------------            
